{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=71468034&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","102"],
    "title":"Studio BA2",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=71468034&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"prop"
  },
  "en":{
    "coefficient":3.0,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"Architecture is about what we would like the world to be. The second semester provides a laboratory condition - a vertical matrix - where students expand on former experiences in the form of a semester-long project, charting architectural process to develop their project, guided by the notions of programme and function.[br/][br/]In honing the crafts of the architect acquired in the first semester students will:[br/][br/][li]formulate a line of inquiry throughout the duration of the project, develop ideas programmatically and engage in a personally driven architectural process to be continued in the forthcoming years;[br/][li]use the devised programme as a means to inform and dictate the project, and to demonstrate intentions on a tectonic and spatial level;[br/][li]co-define the meaning of the group matrix, in spatial, contextual, programmatic and tectonic terms, and how its potentials become reflected within the realm of each project;[br/][li]make a claim to space within the matrix by the physical positioning of tectonic elements, negotiate space within a non-hierarchical condition and develop connections between the different projects;[br/][li]investigate the meaning and implication of scale as a sense of body and a relationship.[br/]",
      "Content":"Students will work within a vertical matrix, a potentially infinite system of overlapping grids. In a basic understanding of the urban, the matrix generates ideas of property, proximity, connectivity and coexistence - expressed through programme and tectonics.[br/][br/]In this given laboratory condition, projects will develop simultaneously, asking students to react to the resulting dynamic environment, creating a condition that questions the way in which we live, as beings, but also the way in which we work as architects: in coexistence and not exclusive of each other - as designers from within. Projects and their tectonic articulation will embody the explorations of the student, and their negotiation: What is my own personal space? How do I define it? What resources do I need? How does this space relate to my own kind and the environment? The semester outcome will be a small universe created collectively by each studio.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA2",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":3.0,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Cours, atelier de projet.[br/]",
      "Contenu":"Les étudiants travailleront avec une matrice verticale, système potentiellement infini de grilles imbriquées qui servira de base aux dessins et maquettes. Condition première de l'urbain, la matrice invoque les notions de propriété, de proximité, de connectivité et de coexistence - exprimées au travers des choix programmatiques et tectoniques. [br/][br/]Cette condition de laboratoire, où les projets se développent de façon simultanée, force à réagir à la dynamique environnementale qui en résulte. Semblable à nos interactions quotidiennes, cette dynamique interroge notre manière de vivre, d'habiter, mais aussi de travailler en tant qu'architecte : évoluant non pas de manière isolée mais en constante interaction, comme des concepteurs [i]in situ[/i]. Les projets, leur articulation tectonique, rendront tangibles les explorations des étudiants comme les négociations au sein de la matrice : Quel est mon espace personnel ? Comment le définir ? De quelles ressources ai-je besoin ? Comment cet espace met-il en jeu mes semblables, et l'environnement ? A la fin du semestre, les étudiants de chaque studio produiront, ensemble, un micro-univers.",
      "Forme du contrôle":"Suivi continu, critique intermédiaire, critique finale.[br/]",
      "Bibliographie et matériel":"Sera distribuée au début du semestre.",
      "Objectifs d'apprentissage":"L'architecture parle du monde tel que l'on souhaiterait qu'il soit. Ce semestre fournit un condition de laboratoire - une matrice verticale - permettant aux étudiants de développer les expériences acquises précédemment dans un projet couvrant l'ensemble du semestre et d'engager leur propre processus architectural guidés par les notions de programme et de fonction.[br/][br/]Poursuivant l'acquisition, introduite au premier semestre, des outils et du savoir-faire de l'architecte, les étudiants devront :[br/][br/][li]formuler un champ d'investigation pour toute la durée du projet, développer des idées de manière programmatique et s'engager dans un processus architectural personnel pour les années à venir; [br/][li]utiliser le programme développé afin de guider le projet et démontrer leurs intentions de manière spatiale et tectonique;[br/][li]définir en groupe un sens à attribuer à la matrice, ses possibilités spatiales, contextuelles, programmatiques et tectoniques et démontrer comment ces potentialités entrent en jeu dans leur propre projet;[br/][li]s'approprier un sous-espace de la matrice par le positionnement physique d'éléments tectoniques, négocier l'espace dans une situation non-hiérarchique et développer des connections entre projets.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA2",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}