{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773967&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","124"],
    "title":"History of architecture II",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773967&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"prop"
  },
  "en":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126097",
      "name":"Gargiani Roberto"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The objective of the course is to provide the student with an in-depth knowledge of the main topics of the architecture of the Quattrocento in Italy, with a special focus on the aspects relating to the building techniques, the structures, the various forms of cladding and space. Throughout the courses, the student will develop the capacity to describe and place the works historically and with a critical eye, an analytical and critical mind towards the meaning of the various architectures regarding their building technique and the cultural context, an in-depth knowledge of the ways materials and structures have been used in the various works as well as a correct terminology, the ability to draw, in a simple and schematic way, sections and building details of the works.[br/]",
      "Content":"The analysis will be about the most significant buildings and about anonymous houses of different urban centres, the master pieces of Brunelleschi, Michelozzo, Rossel-lino, Giuliano da Maiano, Giuliano da Sangallo, Cronaca in Florence and in other Tuscan cities, the master pieces of Alberti, Laurana, Francesco di Giorgio Martini in Mantova, Urbino and Siena, from Filarete, Amadeo, Bramante in Milano, Bergamo, Pavia, from Bon, Gambello, Codussi, Lombardo in Venezia, from Fioravanti, Portigiani, Nuti in Bologna and Cesena, from Sagrera and Carnalivari in Napoli and in Sicilia.[br/][br/]The lessons will concentrate on the systems of construction, the materials and the structures: The cutting of the stone for the building of the walls, arches, architraves, columns; the techniques of the facing in Venezia; the main structural figures \"à l'antique\" in Rome; the vaults and the cupolas \"en agrégat\"; the moulded ornaments and the ornaments in \"papier mâché\"; the works of metal fusion; the geometries and innovative techniques of the military architecture; the rules of art to build codified in the [i]De Re Aedificatoria[/i] of Alberti, in the papers of Filarete and di Giorgio Martini, in the exercise books of da Sangallo, to the studies of da Vinci on the cracks of buildings and resistance of structure. "
    },
    "practical":null,
    "language":"Français",
    "title":"History of architecture II",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126097",
      "name":"Gargiani Roberto"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Histoire de l'architecture I.",
      "Bibliographie et matériel":"Sera distribuée pendant les cours. Les images projetées durant les leçons (plans, sections, vues, détails constructifs, photographies générales et de détails) constituent un support fondamental pour la connaissance des oeuvres. ",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"L'analyse porte sur les bâtiments les plus significatifs et les maisons anonymes dans différents centres urbains, les chefs-d'oeuvre de Brunelleschi, Michelozzo, Rossellino, Giuliano da Maiano, Giuliano da Sangallo, Cronaca à Florence et dans d'autres villes de la Toscane, ceux d'Alberti, Laurana, Francesco di Giorgio Martini à Mantoue, Urbin et Sienne, de Filarete, Amadeo, Bramante à Milan, Bergamo et Pavie, de Bon, Gambello, Codussi, Lombardo à Venise, de Fioravanti, Portigiani, Nuti à Bologne et Cesena, de Sagrera et Carnalivari à Naples et en Sicile.[br/][br/]Les leçons sont centrées sur les systèmes de construction, les matériaux, les structures: la coupe des pierres pour la construction de murs, arches, voûtes, architraves, colonnes; les techniques du revêtement à Venise; les grandes figures structurelles «à l'antique» à Rome; les voûtes et les coupoles en agrégat; les ornements moulés et en papier mâché; les oeuvres de fusion métallique; les géométries et techniques innovatrices de l'architecture militaire; les règles de l'art de bâtir codifiées dans le [i]De Re Aedificatoria[/i] d'Alberti, dans les traités de Filarete et de Francesco di Giorgio Martini, dans les carnets de Giuliano da Sangallo, jusqu'aux études de Leonardo da Vinci sur les lézardes des bâtiments et la résistance des structures.",
      "Forme du contrôle":"Examen écrit. La condition sine qua non pour réussir l'épreuve est que l'étudiant démontre qu'il a acquis une connaissance critique des arguments discutés dans le cours et présentés dans les livres obligatoires indiqués dans la bibliographie.",
      "Préparation pour":"Histoire de l'architecture III.",
      "Objectifs d'apprentissage":"Le cours se propose de fournir les instruments critiques pour une connaissance approfondie des principales thématiques qui caractérisent l'architecture du Quattrocento en Italie, avec un accent particulier sur les aspects relatifs aux techniques constructives, aux structures, aux formes de revêtement et à l'espace. Acquis de formation : être capable de décrire et de situer historiquement et de manière critique les oeuvres, acquérir une capacité d'interprétation critique des significations des diverses architectures en relation à leur technique constructive et au contexte culturel; acquérir une connaissance approfondie des modalités avec lesquelles les matériaux et les structures ont été utilisés dans les diverses oeuvres ainsi qu'une terminologie correcte; savoir dessiner, de manière simple et schématique, les plans, sections et détails constructifs des oeuvres.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de l'architecture II",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}