{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348195695&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","151"],
    "title":"Elements of urban and territorial analysis I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348195695&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"prop"
  },
  "en":{
    "coefficient":1.0,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105248",
      "name":"Gilot Christian"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"\"Faculty to create is never given to us all alone. It always goes hand in hand with the gift of observation.\" Igor Stravinsky.[br/][br/]This course prepares to the spatial analysis of urban and territorial situations. It establishes a corpus of references and presents tools for observations and analysis. It presents theoretical frameworks (for example: modernity) and themes (for example: the relations between urban structures and monuments) which will be developed in the following years. It proposes possible paths between the knowledge given by the analysis, and the intuitions on which the projects can develop.[br/][br/][br/][b]Competence and knowledge to be acquired[/b][br/][br/]At the end of the course, the student will understand:[br/][li]the phenomenon of permanence and question of transformations,[br/][li]the ways by which topography and the infrastructures affect urban structures,[br/][li]the articulations of local and territorial scales,[br/][li]the characteristics of various types of urban fabrics and public spaces.[br/][br/]He (she) will have a basic knowledge of local and international references which establish a cultural framework of the contemporary urban situations.[br/]He will be able to evaluate the interests and the limits of various means of analysis by the development of specific analysis of a particular place.[br/]",
      "Content":"Presentation of various types of analysis in order to understand the issues of scales, and to clarify the articulations between architecture, the city and the territory.[br/]Among these types of analysis, drawing will occupy a central position - drawing considered as a system of representation, as a moment of discovery and as a construction of knowledge.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Elements of urban and territorial analysis I",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":1.0,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105248",
      "name":"Gilot Christian"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Exposés. Etudes de cas.",
      "Contenu":"Présentation de structures territoriales (vallées, bords de lacs, etc.) et urbaines.[br/]Présentation de différents types d'analyse (morphologies, typologies, etc.) permettant de croiser les questions d'échelle et de clarifier les articulations entre l'architecture, la ville et le territoire. Parmi ces types d'analyses, le dessin occupera une position centrale - le dessin considéré comme système de représentation, comme moment de découverte et comme construction de connaissances.[br/][br/]",
      "Forme du contrôle":"Dessins d'analyse à réaliser en groupe et à présenter en jury.[br/][br/]",
      "Objectifs d'apprentissage":"« La faculté de créer ne nous est jamais donnée toute seule. Elle va toujours de pair avec le don d'observation. » Igor Stravinsky.[br/][br/]Ce cours prépare à l'analyse spatiale des situations urbaines et territoriales. Il établit un corpus de références et présente des outils d'observations et d'analyses. Il permet de situer les cadres théoriques (par exemple : la modernité) et thématiques (par exemple : les relations tissus/monuments) qui seront abordés par l'étudiant(e) dans la suite ses études. Il permet à l'étudiant(e) de mesurer le poids des questions d'implantations dans l'élaboration de ses projets. Il situe les chemins possibles entre les connaissances données par l'analyse, et les intuitions sur lesquelles les projets peuvent se développer.[br/][br/][b]Compétence et connaissances à acquérir[/b][br/][br/]A la fin du cours, l'étudiant(e) comprendra :[br/][li]les questions de permanences et de transformations,[br/][li]le caractère structurant de la topographie et des infrastructures,[br/][li]l'articulation des échelles locales et territoriales,[br/][li]les caractéristiques de différents types de tissus urbains et d'espaces publics.[br/][br/]Il (elle) aura acquis la connaissance des caractères spécifiques de références locales (Lausanne, Genève) et internationales (Paris, Rome, New York) qui établissent le cadre culturel dans lequel s'inscrit son rapport aux faits urbains.[br/]Il (elle) sera capable d'évaluer les intérêts et les limites de différents moyens d'analyses présentés au cours par le développement d'une analyse d'un lieu particulier.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Eléments d'analyses urbaines et territoriales I",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}