{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577438720&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","201(a)"],
    "title":"Studio BA3 (Bakker & Blanc A.)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577438720&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/115080",
      "name":"Bakker Marco"
    },{
      "url":"http://people.epfl.ch/143954",
      "name":"Blanc Alexandre"
    }],
    "lab":null,
    "credits":20,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"[b]Hotel Hannibal[/b][br/]The superior didactic goal of this studio is the research for, and development of, relevant varieties of a sensual constructive continuity. The site will be in the alpine center of Europe where, increasingly, tourism is breaking out of its traditional boundaries. The focus is directed at the construction of «Gegenwelten», the spaces that are shaped by travelers, the local population and those who provide services, that area where wishes and needs must be created and simultaneously met. [br/][br/]In the autumn semester we treat \"Hotel Hannibal\" on the Albrun pass in Wallis. [br/]How to conceive a stay for more or less exotic clients in a landscape which is bridging a Swiss and an Italian natural park. The deep reading of the direct surrounding landscape and its cultural traces should result in constructive impulses to act. By considering all scales until the 1 / 1 in the project work, we try to create a tactile direct relationship to the atmospheric potential of materiality. [br/][br/]",
      "Content":"A constructive creativity is driven by the questioning of how to achieve an evident coherence, efficient generosity and a sensual technology."
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA3 (Bakker & Blanc A.)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/115080",
      "name":"Bakker Marco"
    },{
      "url":"http://people.epfl.ch/143954",
      "name":"Blanc Alexandre"
    }],
    "lab":null,
    "credits":20,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"[li]Inputs, intervenants de l'intérieur et extérieur.[br/][li]Exercice \"Re-Use\", in situ sur le col d'Albrun avec la matière du lieu. Travail de groupe.[br/][li]Exercice \"Cinéphonie\", court métrage thématique avec un téléphone portable. Travail de groupe.[br/][li]Projet de semestre. Travail individuel.[br/]",
      "Contenu":"Une créativité du construit est conduite par le questionnement de savoir comment atteindre une cohérence évidente, une générosité efficiente et une technologie sensuelle.",
      "Forme du contrôle":"Critique finale du projet à la fin du semestre.",
      "Objectifs d'apprentissage":"[b]Hôtel Hannibal[/b][br/]L'objectif didactique principal de ce studio est la recherche et le développement de variétés d'objets présentant une continuité constructive de l'ordre du sensible. Le site se trouvera dans le centre alpin de l'Europe, à priori là où le tourisme s'affranchit de ses frontières habituelles. L'attention est portée sur la construction de \"mondes opposés\", d'espaces dont les contours sont dessinés par les voyageurs, la population locale et ceux qui proposent des services; lieux ou des souhaits sont générés et exhaussés parallèlement. [br/][br/]Au semestre d'automne, nous projetterons « l'Hôtel Hannibal » sur le col de l'Albrun en Valais. Comment concevoir un lieu de villégiature pour des clients plus ou moins exotiques dans un paysage qui lie un parc naturel Suisse avec un Italien. La lecture approfondie et intense de l'environnement et des traces culturelles doivent provoquer des impulsions propres à l'action de construire. En considérant toutes les échelles jusqu'au 1:1, le travail de projet devra démontrer une relation directe et tactile avec le potentiel atmosphérique de la matérialité.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA3 (Bakker & Blanc A.)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}