{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577438791&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","201(i)"],
    "title":"Studio BA3 (Giraudi)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577438791&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225186",
      "name":"Giraudi Sandra"
    }],
    "lab":null,
    "credits":20,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The didactical journey leads to conscious expression of thought, straddling ideals and concrete limits, the basis for every transformation of environment and space. The objective is to formulate an arrangement of synthesis that carries architecture to attain autonomy when confronted with complexity, implicit in every reality.[br/]The two semesters, structured in stages of reflection, converge in two periods. [br/]During the first semester, the student interprets and describes \"the place\", explored in the perceived space of the area, determining priorities and values to develop. The initial stage is to arrange the place by means of a project. [br/]In the second semester, in an approach using both research of reference and typology, the student absorbs the tools to interpret the function and its significance. The final stage is a thorough analysis of the project determined by coherent, responsible and exciting choices.[br/][br/]",
      "Content":"The course duration is one year, the period ideal to develop a complete project.[br/]The elevated learning path unwinds in three locations, similar in marginality of urban fabric and different in morphology. United in a single city, the three places are a provocation when compared to the current system that classifies them untouchable.[br/]The guideline is a true story: one that is visible in three different situations.[br/]Between theatre and circus, it is the story of an artistic vagrant event: the \"Finzi Pasca Company\" in search of a place to rest.[br/]The project begins with the design of a public pole of action and culture and concludes in a harbour for artists worldwide, united for months by intense work.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA3 (Giraudi)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225186",
      "name":"Giraudi Sandra"
    }],
    "lab":null,
    "credits":20,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Cours, visites, projet d'architecture, critiques.",
      "Contenu":"Le cours se déroule sur une année, idéal pour élaborer un projet complet.[br/]Le parcours didactique prend place dans trois lieux, similaires du fait de leur marginalité par rapport au tissu urbain, mais différents du point de vue de leur morphologie. Reliés par une ville, ces trois lieux sont une provocation contre le système qui les caractérise comme intouchables.[br/]Le fil conducteur est une histoire réelle, reprise à travers trois situations différentes. Entre théâtre et cirque, c'est l'histoire d'un évènement artistique nomade: la « Compagnie Finzi Pasca », à la recherche d'un endroit où s'établir. [br/]Le projet débute par le dessin d'un pôle public, d'action et culture, et se termine dans un refuge pour artistes du monde entier, unis par des mois d'intense travail.[br/]",
      "Forme du contrôle":"Contrôle continu et jury final.[br/][br/][i]Critères d'évaluation[/i] : [br/]Engagement, compréhension des objectifs, degré d'approfonsissement, qualité du concept développé, représentation du projet.",
      "Bibliographie et matériel":"Jointe aux documents du cours.",
      "Objectifs d'apprentissage":"Le parcours didactique vise une prise de conscience de la capacité d'exprimer ses propres pensées, à cheval entre idéaux et limites concrètes, à la base de toute transformation de l'environnement et de l'espace. L'objectif est la formulation d'une synthèse qui conduit l'architecture à atteindre son autonomie propre par rapport à la complexité inhérente à toute réalité. [br/]Les deux semestres, articulés autour de thèmes de réflexion, convergent vers deux moments. [br/]Dans le premier, l'étudiant appréhende et décrit « le lieu », enquêté dans l'espace de perception du territoire, en évaluant les potentiels et les qualités à développer. L'acte initial est d'ordonner le lieu à travers un projet. [br/]Dans le second, en intégrant une recherche typologique et de références, l'étudiant assimile les outils afin d'interpréter la fonction et sa signification. L'acte final est l'approfondissement du projet déterminé par des choix cohérents, responsables, teintés d'émotion.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA3 (Giraudi)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}