{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577438761&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","201(h)"],
    "title":"Studio BA3 (Durisch & Nolli)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577438761&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://www.lugano.ch/lugano-urbana/grandi-progetti.html"," http://www.lugano.ch/lugano-urbana/grandi-progetti.html"],["http://www.durischnolli.ch","http://www.durischnolli.ch "],["http://sar.epfl.ch/","http://sar.epfl.ch/"]],
    "instructors":[{
      "url":"http://people.epfl.ch/217922",
      "name":"Durisch Nolli Pia"
    },{
      "url":"http://people.epfl.ch/217923",
      "name":"Nolli Aldo"
    }],
    "lab":null,
    "credits":20,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"Architecture is a system that is strictly related to the site. In this system, the different aspects of the architectural project constitute a complex organism. Architecture consists essentially of the complementarity of the elements that constitute it with the emptiness defined by these elements.[br/]An integral vision is essential for architecture. Primary themes like situation, typology, space, light, expression, atmosphere, are the first notions that we learn to conceive. What appears more difficult to understand is the relationship between these metaphysic themes and the physical aspects that constitute them, like structure, construction and materials. To achieve a spatial coherence, a certain atmosphere or expression we must be in the condition to control the physical aspects, we have to be constructors.[br/]Another important aspect of learning is referred to working and presentation tools. If the use of digital tools is important, these cannot substitute a solid knowledge base of analogic tools and skills, which are basic for architectural research and representation.[br/]The project is the core element on which we do confront us with the different aspects of architecture.[br/][br/]",
      "Content":"10 images for Lugano, 10 urban interventions.[br/]Our studio will be a design lab, in which lectures, table critics and individual work are functionally integrated to the project. The two semesters are conceived as articulated but complementary halves of the year.[br/]In the first semester we will get confident with the project site doing simple projects, pavilions, in the simplified context of the Lugano lakeshore promenade and park.[br/]In the second semester, in a gradual progression and with the experience of the first project, we will increase the complexity of the project, facing urban architecture and developing more complex typologies and solutions for important city places.[br/]The available tools will be used with the criteria of its specific utility: models at different scales and materials, sketches, computer aided and hand drawing design, visualisations, and photomontages. The project development will be done at different levels and scales, functional to the requirements of the project. The studio will stimulate the \"patient research\" finalized to constant project development, encourage the use of the library as a working tool, suggest the visit of real references, and introduce the sketchbook as a project diary.[br/]With the help of specific consultants, we will understand the importance of interdisciplinary integration of structural concepts, construction, materials, technical installations and sustainability in the design process.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA3 (Durisch & Nolli)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=0-262-18104-5&amp;con_lng=ENG\" target=\"blank\">A scientific autobiography / Aldo Rossi</a>\". Year:1981. ISBN:0-262-18104-5</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-88474-500-9&amp;con_lng=ENG\" target=\"blank\">L'architecture de la ville / Aldo Rossi</a>\". Year:2001. ISBN:2-88474-500-9</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-3-7643-8453-1&amp;con_lng=ENG\" target=\"blank\">Penser l'architecture / Peter Zumthor</a>\". Year:2008. ISBN:978-3-7643-8453-1</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://www.lugano.ch/lugano-urbana/grandi-progetti.html"," http://www.lugano.ch/lugano-urbana/grandi-progetti.html"],["http://www.durischnolli.ch","http://www.durischnolli.ch "],["http://sar.epfl.ch/","http://sar.epfl.ch/"]],
    "instructors":[{
      "url":"http://people.epfl.ch/217922",
      "name":"Durisch Nolli Pia"
    },{
      "url":"http://people.epfl.ch/217923",
      "name":"Nolli Aldo"
    }],
    "lab":null,
    "credits":20,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Année propédeutique.",
      "Bibliographie et matériel":"Rossi, Aldo, [i]L'architecture de la ville[/i], Infolio Editions, 2001 / [i]A scientific Autobiography[/i], MIT Press 1981/2010. Zumthor, Peter, [i]Penser l'Architecture[/i], Birkhäuser, 2010 / [i]Atmosphères[/i], Birkhäuser, 2006. Calvino, Italo, [i]Six Memos for the Next Millennium[/i], Vintage 1993.",
      "Forme d'enseignement":"Cours, visites, conférences, atelier de projet, critiques.",
      "Contenu":"10 images pour Lugano, 10 interventions urbaines.[br/]Notre atelier est un laboratoire de projet où cours théoriques, critiques à la table et travail individuel sont intégrés en fonction du projet. Les deux semestres sont considérés comme parties articulées mais complémentaires d'un cours annuel.[br/]Dans le premier semestre nous prendrons confiance avec le lieu du projet avec des projets élémentaires, des pavillons, dans le contexte simplifié de la promenade et du parc du Lac de Lugano.[br/]Dans le second semestre, la complexité sera augmentée, pour se confronter avec l'architecture urbaine en développant des typologies plus complexes et des solutions pour des lieux précis de la ville.[br/]Les moyens disponibles seront utilisés en fonction de leur utilité spécifique: maquettes à toutes les échelles et matériaux, croquis, dessins à la main et numériques, visualisations, photomontages. Le développement des projets se fera dans les différentes échelles selon les nécessités du projet. L'enseignement stimulera la recherche patiente pour le développement des projets, l'encouragement à l'utilisation de la bibliothèque, la visite de références réelles et l'utilisation du cahier des croquis comme journal du projet.[br/]Avec l'aide des spécialistes, nous comprendrons l'importance de l'intégration interdisciplinaire dans le projet des notions de structures, construction, matériaux, technique, durabilité.",
      "Forme du contrôle":"Jury.",
      "Objectifs d'apprentissage":"L'architecture est un système strictement lié au lieu. Dans ce système les différents aspects du projet d'architecture constituent un organisme complexe. L'architecture est constituée essentiellement de la complémentarité des éléments qui la constituent et du vide défini par ces éléments.[br/]Une vision intégrale et essentielle de l'architecture est importante. La conception des thèmes primaires : situation, typologie, espace, lumière, expression, atmosphère, sont les premières notions que nous apprenons à manipuler. Ce qui semble plus difficile à comprendre, c'est la relation entre ces thèmes métaphysiques et les aspects physiques qui les constituent, comme la structure, la construction, les matériaux. Pour obtenir une cohérence spatiale, une certaine atmosphère ou expression, il faut être en mesure de maîtriser les aspects physiques, il faut être constructeur.[br/]Un thème d'apprentissage important est aussi celui des moyens de travail et de représentation. Si l'utilisation des moyens numériques est importante, elle ne peut pas se substituer à une base cognitive solide des moyens analogiques et des notions qui sont à la base de la recherche et de la représentation architecturale.[br/]Le projet est l'élément central sur lequel se confronter avec les différents aspects de l'architecture.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA3 (Durisch & Nolli)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=0-262-18104-5&amp;con_lng=FRE\" target=\"blank\">A scientific autobiography / Aldo Rossi</a>\". Année:1981. ISBN:0-262-18104-5</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-88474-500-9&amp;con_lng=FRE\" target=\"blank\">L'architecture de la ville / Aldo Rossi</a>\". Année:2001. ISBN:2-88474-500-9</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-3-7643-8453-1&amp;con_lng=FRE\" target=\"blank\">Penser l'architecture / Peter Zumthor</a>\". Année:2008. ISBN:978-3-7643-8453-1</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}