{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898368070&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","201(c)"],
    "title":"Studio BA3 (Kuo)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898368070&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/217925",
      "name":"Kuo Jeannette Mei-Ying"
    }],
    "lab":null,
    "credits":20,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The course will take as its premise architecture as a construct. It is on the one hand a very literal material and technological construction: a system of parts to whole that negotiates between the figural object of the building and its organizational configurations. On the other hand, architecture is also a conceptual construct - the parameters that we set in positioning our work and developing a decision-making process. Problems and constraints are opportunities.[br/]At the end of the year, beyond addressing the classical architectural problems of program and site, students should be able to: [br/][li]Work systematically and non-linearly, designing with the architectural conventions of plans, sections, and models in constant feedback and across scales. [br/][li]Translate a concept to material form, and understand the relationship of form to performance, all the while maintaining the coherence of the project. [br/][li]Think through making, linking the physical with the conceptual in developing the architectural logic for their projects.[br/]",
      "Content":"Modern society and our collective environments are as much defined through spaces of work as through spaces of living. Through the year we will investigate different scales relating to the idea of the workplace, from landscapes of production to the individual workspace. [br/]The first semester will focus primarily on space, matter, and atmosphere through a public archive. [br/]The second semester will expand to the relationship of space, structure, and organization in rethinking the work place.[br/]The course is organized around a series of exercises and workshops that will establish an inventory of strategies and logics to be tested in one project each semester.  We will unpack historical and contemporary precedents while expanding on the tools and techniques of architectural thinking with individual and team projects. More specifically, we will work with a range of media including large-scale physical models in parallel with drawings and digital tools. Photography and collage will be used to further exploit physical models as both working tools and constructive artifacts.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA3 (Kuo)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/217925",
      "name":"Kuo Jeannette Mei-Ying"
    }],
    "lab":null,
    "credits":20,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Cours théoriques, discussions de groupe, workshops, critiques à la table et présentations.",
      "Contenu":"La société moderne et ses environnements collectifs sont autant définis par les espaces de travail que par les espaces de vie. Nous allons explorer différentes échelles en relation avec l'espace de travail : du paysage industriel jusqu'au poste de travail lui-même. Les thèmes d'espace, « de matière » et d'atmosphère seront traités au travers d'un projet d'archives publiques pendant le semestre d'automne. [br/]Le semestre de printemps portera sur la relation entre espace, structure et organisation en réinterprétant cette thématique.[br/]Une série d'exercices et de workshops constitueront le cours. Un inventaire de stratégies et de logiques sera mise en place par les étudiants et servira de base pour développer les projets de semestre. [br/]Nous allons analyser des précédents aussi bien historiques que contemporains tout en développant des outils et des techniques de pensée architecturale au travers de projets individuels et de projets de groupe. Plus précisément, nous allons travailler avec différents médias tel que des maquettes à grande échelle, le dessin et les outils informatiques. La photographie et le collage seront également utilisés pour exploiter davantage encore la maquette et en saisir la dimension d'outil de travail et d'artefact.[br/]",
      "Forme du contrôle":"10% Participation (présence, participation aux discussions, motivation, préparation pour les cours).[br/]10% Concept (l'adéquation du concept à la problématique donnée et au programme ainsi que sa pertinence dans le contexte).[br/]40% Développement du projet.[br/]40% Présentations intermédiaires et finales (mise en forme du concept, présentations orales et graphiques).",
      "Préparation pour":"Le travail de Master en formant des esprits critiques et indépendants pour le développement du projet d'architecture.",
      "Objectifs d'apprentissage":"L'atelier postule que l'architecture est une construction intellectuelle autant que matérielle. D'une part il s'agit d'un système constitué de parties, formant un tout qui négocie entre l'aspect figural d'un bâtiment et ses configurations organisationnelles. D'autre part, elle est une construction conceptuelle, de par les paramètres que nous définissons pour positionner notre travail et développer un processus. Les problèmes et les contraintes sont des opportunités. [br/]A la fin de l'année, au-delà du traitement des questions architecturales classiques du programme et du site, les étudiants devraient être capables de :[br/][li]Développer un projet de manière systématique et non linéaire à l'aide des conventions architecturales que constituent le plan, la coupe et la maquette à différentes échelles. Il s'agira de conserver un esprit critique tout au long du processus.[br/][li]Traduire un concept en forme matérielle, et comprendre la relation de la forme à la performance, tout en conservant la cohérence du projet.[br/][li]Apprendre à penser au travers du processus de production, et lier ce qui est physique avec ce qui est conceptuel en définissant la logique architecturale d'un projet.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA3 (Kuo)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}