{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773972&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","223"],
    "title":"History of architecture III",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773972&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/169227",
      "name":"Pagliara Pier Nicola"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"[b]Construction, architectures, theories of the \"Cinquecento\"[/b][br/]This course introduces the students to the knowledge of Italian architectures of the \"Haute Renaissance\" by providing them with the tools to analyze them as well as to understand their historical reasons and evaluate their qualities, through the study of a few examples, thus contributing to develop the students'ability to \"read\" architecture. The architectures will be studied in such a way to encourage the students to question the reasons of building them in a definite time and place, the objective of the customer, the builder and the architect, the influence of the architect's conceptions had on the realisations of the architectures, why the spaces and structures have been conceived that way, why the functions have been distributed that way, how and why the various materials and techniques have been chosen, what are the connection between an architecture and its physical location, how it is influenced by the conditions it is viewed, what are its connections with architectures of the past or of the same period with similar functions, etc. These various questions should make the students able to consider the interconnections between several aspects.[br/]",
      "Content":"The architectures of Bramante, Raffaello, Giulio Romano, Antonio da Sangallo \"Le Jeune\", Baldassarre Peruzzi, Jacopo Sansovino, Michele Sanmicheli, Andrea Palladio and [i]I quattro libri dell'architettura[/i], Michelangelo, Vignola and the \"Traité sur les ordres\". The taking measurements of the architectures of the antiquity. Fini and \"non finito\", architecture \"ruinée\". Techniques, structures, materials, finishes. Building sites and the organization of the work.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"History of architecture III",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/169227",
      "name":"Pagliara Pier Nicola"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"Histoire de l'architecture II.",
      "Bibliographie et matériel":"Sera distribuée pendant les cours.",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"Les architectures de Bramante, Raffaello, Giulio Romano, Antonio da Sangallo Le Jeune, Baldassarre Peruzzi, Jacopo Sansovino, Michele Sanmicheli, Andrea Palladio et [i]I quattro libri dell'architettura[/i], Michelangelo, Vignola et le «Traité sur les ordres». Le relevé des architectures de l'antiquité. Fini et «non finito», architecture «ruinée». Techniques, structures, matériaux, finitions. Le chantier et l'organisation des travaux.[br/][br/]",
      "Forme du contrôle":"Epreuve écrite facultative à mi-septembre. En cas de réussite à cette épreuve et selon la note obtenue, un bonus sera ajouté à la note de l'examen oral de fin de semestre.",
      "Préparation pour":"Histoire de l'achitecture IV.",
      "Objectifs d'apprentissage":"[b]Construction, architectures, théories du Cinquecento[/b][br/]Le cours vise à introduire les étudiants à la connaissance d'architectures italiennes de la haute Renaissance, en leur fournissant les instruments pour les analyser, en comprendre les raisons historiques et en évaluer les qualités, à travers l'étude d'un nombre limité d'exemples, pour contribuer ainsi à développer leur capacité à «lire» l'architecture. Les architectures seront examinées afin d'inciter les étudiants à se demander pourquoi elles ont été réalisées à cet endroit et à ce moment, quels étaient les objectifs du commanditaire, du constructeur et de l'architecte, quelle influence les conceptions de l'architecte ont eu sur les façons dont il les a réalisées, pourquoi les espaces et les structures ont été conçus de cette manière, comment les fonctions ont été distribuées, comment les techniques et les matériaux ont été choisis et pourquoi, quels sont les rapports d'une architecture avec son contexte physique, comment elle est influencée par les conditions dans lesquelles elle est vue, quels sont ses rapports avec les architectures qui l'ont précédée et avec celles de la même période comportant des fonctions analogues, etc. Ces divers questionnements devraient permettre aux étudiants de considérer l'interconnexion des différents aspects.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de l'architecture III",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}