{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773977&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","224"],
    "title":"History of architecture IV",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773977&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126097",
      "name":"Gargiani Roberto"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The objective of the course is to provide the student with an in-depth knowledge of the main topics of the architecture of the 16th century in France, until the 18th century in Europe, with a special focus on the aspects relating to the building techniques, the structures, the various forms of cladding and space. Throughout the courses, the student will develop the capacity to describe and place the works historically and with a critical eye, an analytical and critical mind towards the meaning of the various architectures regarding their building technique and the cultural context, an in-depth knowledge of the ways materials and structures have been used in the various works as well as a correct terminology, the ability to draw, in a simple and schematic way, sections and building details of the works.[br/]",
      "Content":"[b]Architecture and construction in France, 16th century[/b][br/]The works of De l'Orme, Lescot, Androuet du Cerceau, Serlio. Doctors on the building site, from Savot to Gallaccini. Galileo, Leibnitz, De la Hire: towards a new science of building. Theory and practice of the cutting of stones: Desargues, Bosse, Jousse, Derand. New monumental orders, from Bernini to Wren. Beyond the orders: Borromini, Guarini. The building in the colonnade of the Louvre: technical and theoretical virtuosities of Blondel, Le Vau, Perrault. Resistance tests of materials and the crisis of the vitruvian theory of architecture. The building site of the Panthéon in Paris, from Soufflot to Rondelet. Patte and the French technical inventions. Lodoli and the \"rigoristi\" of Venice: theoretical fundamentals for an architecture of materials. Laugier and the \"petite cabane rustique\".[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"History of architecture IV",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126097",
      "name":"Gargiani Roberto"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Histoire de l'achitecture III.",
      "Bibliographie et matériel":"Sera distribuée pendant les cours. Les images projetées durant les leçons (plans, sections, vues, détails constructifs, photographies générales et de détails) constituent un support fondamental pour la connaissance des oeuvres. ",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"[b]Architecture et construction en France, XVIe siècle[/b][br/]Les oeuvres de De l'Orme, Lescot, Androuet du Cerceau, Serlio. Médecins sur le chantier, de Savot à Gallaccini. Galilée, Leibnitz, De la Hire : vers une nouvelle science constructive. Théorie et pratique de la coupe des pierres : Desargues, Bosse, Jousse, Derand. Nouveaux ordres monumentaux, de Bernini à Wren. Au-delà des ordres : Borromini, Guarini. La construction dans la colonnade du Louvre : virtuosités techniques et théoriques de Blondel, Le Vau, Perrault. Les essais sur la résistance des matériaux et la crise de la théorie architecturale vitruvienne. Le chantier du Panthéon à Paris, de Soufflot à Rondelet. Patte et les inventions techniques françaises. Lodoli et les «rigoristi» de Venise : fondements théoriques pour une architecture des matériaux. Laugier et la «petite cabane rustique».[br/]",
      "Forme du contrôle":"L'examen consiste en une discussion orale pour vérifier les connaissances acquises par l'étudiant durant les cours et par l'étude de la bibliographie obligatoire. La condition sine qua non pour réussir l'examen orale est que l'étudiant démontre qu'il a acquis une connaissance critique des thèmes abordés dans les cours et dans la bibliographie. L'étudiant devra également démontrer son parcours personnel en présentant son dossier de travail personnel qui réunit les notes prises durant les cours, ses fiches de lecture des livres et articles, ses dessins personnels, et des schémas graphiques originels des diverses oeuvres. La note finale consistera à 45% de la connaissance des cours, à 45% de la connaissance de la bibliographie et à 10% du dossier personnel.",
      "Préparation pour":"Histoire de l'achitecture V.",
      "Objectifs d'apprentissage":"Le cours se propose de fournir les instruments critiques pour une connaissance approfondie des principales thématiques qui caractérisent l'architecture depuis le début du XVIIIe siècle jusqu'à nos jours, avec un accent particulier sur les aspects relatifs aux techniques constructives, aux structures, aux formes de revêtement et à l'espace. Acquis de formation : être capable de décrire et de situer historiquement et de manière critique les oeuvres; acquérir une capacité d'interprétation critique des significations des diverses architectures en relation à leur technique constructive et au contexte culturel; acquérir une connaissance approfondie des modalités avec lesquelles les matériaux et les structures ont été utilisés dans les diverses oeuvres ainsi qu'une terminologie correcte; savoir dessiner, de manière simple et schématique, les plans, sections et détails constructifs des oeuvres.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de l'architecture IV",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}