{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=837374200&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","231"],
    "title":"Construction and sustainability III",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=837374200&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/108031",
      "name":"Bolomey Dan-Alexis"
    },{
      "url":"http://people.epfl.ch/226585",
      "name":"Rousset Soazig"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The courses offered under this title focus as much on the technical validity of the project as on the acquisition of a technical culture and the ability to master the logics of construction.[br/][br/]The course thus leads students to[br/][br/][li]develop a rational understanding of common and complex forms of construction;[br/][br/][li]take account of construction as a step in a project: the ability to project-manage a technically viable architecture with a judicious use of materials and technical processes, together with a mastery of the scales of construction;[br/][br/][li]reflect on the construction opportunities of architectural expression in a well-argued manner.[br/]",
      "Content":"On the basis of the knowledge acquired in the first year, the \"Construction\" angle divides the building into characteristic and recognisable elements in order to introduce the aspects of typology and detail, which will enable students to reconstitute the building as a structure and expressive whole.[br/][br/]In parallel, the \"Materials\" angle presents the complemetary tools required for the choice of appropriate projects.[br/][br/]The course thus favours the acquisition of a creative construction method as a component of a coherent architectural language.[br/][br/]It therefore teaches scientific and technical knowledge that will enable students to take acts of construction into account in a rational, hierarchised and concrete way, thus providing them with the resources necessary to introduce the factor of \"materialisation\" into architectural projects while being aware of whole gamut of their complexity.[br/][br/]At the same time, this specific knowledge is placed in an overall philosophy of architecture and within the framework of reflections on history and doctrine (construction culture), just as it would be in the course of the development of a project (construction project).[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Construction and sustainability III",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/108031",
      "name":"Bolomey Dan-Alexis"
    },{
      "url":"http://people.epfl.ch/226585",
      "name":"Rousset Soazig"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Construction et durabilité I/II. Physique du bâtiment I/II.",
      "Bibliographie et matériel":"Sera distribuée pendant les cours : manuels de construction, polycopiés, fiches thématiques, références spécifiques.",
      "Forme d'enseignement":"Cours ex cathedra. Visites de chantier. Exercices.",
      "Contenu":"Basé sur les connaissances acquises en 1ère année, le volet «Construction» introduit, à travers le découpage du bâtiment en éléments caractéristiques et reconnaissables, l'aspect typologique et de détail, permettant ainsi la recomposition du bâtiment en un tout structuré et expressif.[br/][br/]En parallèle, le volet « Matériaux » apporte les outils complémentaires nécessaires à des choix de projet adéquats.[br/][br/]Le cours favorise ainsi l'acquisition d'une méthode constructive créative, partie d'un langage architectural cohérent.[br/][br/]L'enseignement dispense donc les connaissances scientifiques et techniques qui permettront à l'étudiant de prendre en compte le fait constructif de manière raisonnée, hiérarchisée et concrète et donne ainsi aux étudiants les moyens d'introduire le facteur «matérialisation» dans le projet d'architecture, en tenant compte de toute sa complexité.[br/][br/]Parallèlement, ces connaissances spécifiques sont situées dans une pensée d'ensemble sur l'architecture, dans le cadre des réflexions historiques et doctrinales (culture constructive), comme au cours de l'élaboration d'un projet (projet constructif).[br/]",
      "Forme du contrôle":"Examen écrit composé d'une partie « construction » (dessin d'un détail constructif, « mise en construction » d'une expression architecturale donnée, 75% de la note) et d'une partie « matériaux » (questions, 25% de la note).",
      "Préparation pour":"Théorie et critique du projet, suite du cours au Bachelor, UE E/F/K.",
      "Objectifs d'apprentissage":"Les enseignements regroupés sous cet intitulé visent autant la validité technique du projet que l'acquisition d'une culture technique ou la capacité à maîtriser les logiques constructives.[br/][br/]Il entraîne ainsi l'étudiant à la :[br/][br/][li]Compréhension raisonnée des formes construites courantes et complexes,[br/][br/][li]Prise en compte de la construction dans une démarche de projet : capacité à projeter une architecture techniquement viable, usant judicieusement des matériaux et des procédés techniques et où les échelles constructives sont maîtrisées,[br/][br/][li]Réflexion argumentée sur les enjeux constructifs de l'expression architecturale.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Construction et durabilité III",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}