{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1358520869&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","254"],
    "title":"Public spaces and mobility - interdisciplinary projects",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1358520869&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100701",
      "name":"Camacho-Hübner Eduardo"
    },{
      "url":"http://people.epfl.ch/103441",
      "name":"Rossi Luca"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    },{
      "url":"http://people.epfl.ch/106674",
      "name":"Von Der Mühll Dominique"
    },{
      "url":"http://people.epfl.ch/108877",
      "name":"Zepf Marcus"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Public spaces and mobility - interdisciplinary projects",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100701",
      "name":"Camacho-Hübner Eduardo"
    },{
      "url":"http://people.epfl.ch/103441",
      "name":"Rossi Luca"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    },{
      "url":"http://people.epfl.ch/106674",
      "name":"Von Der Mühll Dominique"
    },{
      "url":"http://people.epfl.ch/108877",
      "name":"Zepf Marcus"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Apports théoriques, travaux en groupes, table ronde, séminaires, visites d'aménagements.",
      "Contenu":"L'enseignement articule de manière interactive des apports théoriques, un travail pratique en groupes, des échanges sous forme de séminaires et une journée de visites. Il fait appel à des intervenants des différentes disciplines concernées et à des acteurs du projet urbain. L'exercice portera sur un site encore à confirmer, bourg, petite ville ou localité de périphérie urbaine - un type de contexte encore peu étudié sous l'angle des espaces publics.[br/]La formule renforcée introduite en 2010 permettra à nouveau de concentrer les apports théoriques sur les deux premières semaines, et de séjourner deux jours sur place pour la première partie de l'exercice pratique. La table ronde en début de semaine offrira la possibilité d'appréhender le rôle des différents acteurs et les mécanismes de conception d'un projet. Une journée sera consacrée à la visite d'aménagements réalisés, en compagnie d'acteurs qui ont été impliqués dans leur planification (programme de la journée encore à définir, choix en lien avec le thème de projet).[br/]",
      "Forme du contrôle":" Les étudiant-e-s travailleront en groupes interdisciplinaires (4-5 étudiant-es). L'évaluation se fera sur la base des présentations lors des séminaires et de la présentation finale : comptes-rendus de la phase d'analyse puis esquisses de propositions. Une importance particulière sera accordée à la capacité d'intégrer les apports théoriques, les contributions des acteurs locaux, les enseignements tirés de la visite de terrain et les échanges communs dans les propositions finales.[br/]",
      "Remarque":"La SE-11 cherche à favoriser les relations avec les acteurs impliqués dans les projets, que ce soit au travers de la table ronde, du travail en groupe ou de la journée de visite. Traditionnellement le séminaire de présentation des propositions se fait en présence d'acteurs locaux (responsables politiques et techniques) du site étudié.[br/]",
      "Objectifs d'apprentissage":"Contexte[br/]La seconde partie du XXe siècle, avec l'essor de la voiture et des déplacements motorisés, a vu évoluer les espaces publics vers une hypertrophie de la fonction de circulation et une séparation des usages et des usagers, comme de l'action des professionnels. Sans forcer beaucoup le trait, l'ingénieur régnait sur la rue devenue la route, l'urbaniste et l'architecte se concentrant sur le bâti, et l'architecte-paysagiste intervenant en fin de parcours pour les choix d'arborisation et de revêtements.[br/]Depuis quelques années cette situation a commencé de changer. La logique de spécialisation et de séparation évolue vers un partage de l'espace-rue et une reconnaissance de sa fonction sociale. Les projets d'espaces publics deviennent interdisciplinaires, et se développent parfois dans le cadre de processus participatifs impliquant divers acteurs locaux, voire supra-locaux. D'un projet technique on passe à des démarches complexes, qui nécessitent de prendre en compte des exigences multiples et parfois contradictoires, tout en cherchant à assurer la cohérence et la qualité du projet.[br/]Objectifs[br/]Comment projeter ensemble les espaces publics contemporains ? Le programme de la semaine vise à initier et sensibiliser les étudiants aux enjeux liés à l'aménagement d'espaces publics (rues et places), à leur proposer des outils pour appréhender les exigences multiples des différents acteurs concernés et à les confronter à l'élaboration d'un projet  interdisciplinaire. Les étudiant-e-s devront aussi s'exercer à une réflexion à plusieurs échelles, mettant en relation le projet localisé et un contexte plus large."
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Mobilité et espaces publics : vers des projets interdisciplinaires",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  }
}