{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1637603424&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","266"],
    "title":"Over the Aire. Mental map of an urban approach",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1637603424&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/113297",
      "name":"Ortelli Luca"
    },{
      "url":"http://people.epfl.ch/113160",
      "name":"Ortlieb Valérie"
    },{
      "url":"http://people.epfl.ch/149208",
      "name":"Perreten Agnès"
    },{
      "url":"http://people.epfl.ch/168011",
      "name":"Rossi Pierre"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Over the Aire. Mental map of an urban approach",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/113297",
      "name":"Ortelli Luca"
    },{
      "url":"http://people.epfl.ch/113160",
      "name":"Ortlieb Valérie"
    },{
      "url":"http://people.epfl.ch/149208",
      "name":"Perreten Agnès"
    },{
      "url":"http://people.epfl.ch/168011",
      "name":"Rossi Pierre"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"PROGRAMME[br/]Arrivée à Genève, le premier jour le travail débutera par la découverte du territoire à analyser, puis un[br/]départ à pied pour parcourir l'entier de l'itinéraire choisi. Le deuxième jour sera consacré à la[br/]réalisation de la carte mentale individuelle. Le troisième jour, chaque groupe d'étudiants partira[br/]arpenter une portion du parcours. Le travail de synthèse s'effectuera les deux derniers jours, à l'EPFL[br/]avec toujours la possibilité de retourner sur le site.[br/][br/]ENSEIGNANTS[br/]Agnès Perreten, architecte, EPFL-ENAC-SAR-ENS, doctorante LCC[br/]Valérie Ortlieb, architecte, chargé de cours externe[br/]Pierre Rossi, EPFL-ENAC-SSIE-ENS, chargé de cours[br/][br/]ENSEIGNANTS INVITES (à confirmer)[br/]ADR architectes, Genève[br/]Alain Léveillé, urbaniste- architecte, Genève[br/]Sébastien Marot, philosophe et historien, Paris[br/]Kaj Noschis, psychologue, EPFL-ENAC-SAR-ENS[br/]Département du territoire - Service de renaturation des cours d'eau, Genève[br/]",
      "Contenu":"L'essentiel du travail s'effectuera par[br/]1. L'observation : marche et arpentage diurne et nocturne[br/]2. La description : mécanismes mentaux et carte mentale[br/]3. L'interprétation : analyses et propositions projectuelles[br/]La réalisation d'une carte mentale au fil de l'eau (Aire - Rhône et lac Léman) dans le territoire genevois,[br/]passera par un regard actif, ciblé sur les marqueurs, les indices majeurs, qui deviennent des repères[br/]utilisables comme des invariants territoriaux, des résistances. On utilisera le croquis, la photographie,[br/]la vidéo et des interviews. La carte mentale n'est pas forcément qu'un document graphique, elle peut[br/]être enrichie d'un récit du lieu, d'un film, d'une bande sonore.[br/]L'aboutissement du travail a pour but d'élaborer une carte mentale élargie et collective des divers[br/]points remarquables de chaque carte mentale dessinée individuellement.[br/]PROGRAMME[br/]Arrivée à Genève, le premier jour le travail débutera par la découverte du territoire à analyser, puis un[br/]départ à pied pour parcourir l'entier de l'itinéraire choisi. Le deuxième jour sera consacré à la[br/]réalisation de la carte mentale individuelle. Le troisième jour, chaque groupe d'étudiants partira[br/]arpenter une portion du parcours. Le travail de synthèse s'effectuera les deux derniers jours, à l'EPFL[br/]avec toujours la possibilité de retourner sur le site.",
      "Objectifs d'apprentissage":"PREAMBULE[br/]Chacun de nous, lors d'un voyage, d'une marche ou d'une visite fabrique et collecte des images[br/]intérieures générées par l'espace, l'environnement construit et son organisation. Ces images peuvent[br/]être transposées à travers un récit mais également dessinées sur une carte que nous appellerons carte[br/]mentale. Elle se base sur la mémoire des perceptions.[br/]HYPOTHESE[br/]Notre hypothèse de travail est qu'il est nécessaire de recueillir de la connaissance sur notre territoire,[br/]de mettre les personnes (en l'occurrence les étudiants) qui le pratiquent en situation de projet et, par[br/]conséquent, les indexer à leur milieu. Ainsi, nous soutenons que l'approche sensible et la perception[br/]produisent de l' \"urbanité\" dans ces nouveaux paysages urbains en mutation.[br/]Il s'agit donc de penser le monde, c'est-à-dire saisir notre territoire ou encore le paysage, comme un[br/]\"projet\" et non comme un \"objet\".[br/]Des \"points d'ancrage\" dans le territoire ont toutes les chances d'exister, ils constituent même un des[br/]éléments forts de la construction du sentiment d'appartenance territoriale. Ce sont des marques[br/]territoriales observées qui peuvent être représentées sur une cartographie différente de la carte[br/]conventionnelle. Comprendre et relever ces repères contribue à développer des nouvelles \"aptitudes[br/]territoriales\".[br/]C'est parce qu'il y a des points d'ancrage - repères et marques territoriales - tous essentiellement[br/]fabriqués par les mémoires collectives, que l'on se sent appartenir à l'endroit, à la région, sans avoir[br/]besoin d'y être né. Le fait de lire, d'observer et de comprendre, par ces points, l'identité du territoire,[br/]nous affilie au lieu, nous aide à le connaître, à le re-connaître, à l'exprimer et à le projeter.[br/]Le lieu, ses repères et ses contraintes deviennent ressources pour le projet.[br/]SUJET[br/]Un cheminement au bord des eaux de l'Aire, du Rhône jusqu'au lac, comme fil rouge d'une lecture[br/]territoriale ...de la campagne à la ville ...du vert au bleu en passant par le gris.[br/]Cette traversée présente des types de paysages différents : une partie de campagne et de jardins le[br/]long d'une rivière, une partie de périphérie, une zone de friche urbaine, la ville et enfin l'horizon du lac.[br/]Ces différentes strates et superpositions jointes par un simple ruban rouge dans l'espace - notre[br/]marche - sont susceptibles de faire lever le récit du lieu.[br/]Dans le contexte actuel, la renaturation de l'Aire rentre dans un programme de requalification des[br/]cours d'eau. Cette valorisation est une réponse à des objectifs territoriaux de reconstitution du paysage[br/]genevois. En effet, prenant en compte les enjeux du futur développement urbain de la plaine de l'Aire[br/](à prédominance de logements), ce projet permet de sécuriser le quartier Praille-Acacias-Vernets[br/](PAV) contre les crues, tout en favorisant les milieux naturels. Du point de vue environnemental, il[br/]s'agit de rétablir un corridor biologique qui s'étendra de la campagne à la ville en optimisant le[br/]développement de la vie animale et végétale. En dernier lieu, la renaturation de l'Aire prévoit[br/]l'aménagement d'espaces publics qui permettront de restituer la fonction sociale d'un cours d'eau (aux[br/]abords d'une ville) aux usagers.[br/]Les auteurs du projet de renaturation de l'Aire ont réalisé un équilibre transitoire (une retenue) qui offre[br/]une discussion dans la durée et qui pose une question fondamentale : « qu'est ce que nous faisons[br/]du monde que l'on nous a transmis ? » C'est ce questionnement qui est à la base de notre parcours[br/]en ces lieux. C'est-à-dire, marcher au travers d'un \"donné\" et d'un \"transformé\", les re-garder pour[br/]comprendre et raconter le site.[br/]OBJECTIFS[br/]Il s'agit de reposer l'attention sur la matière, sur les sensations et sur une expérimentation paysagère.[br/]La démarche est l'expérience de la marche qui territorialise et s'empare du présent pour une reconnaissance[br/]du territoire.[br/]Construire mieux avec le territoire - développer un nouveau regard pour observer, d"
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Au fil de l'Aire. Carte mentale d'une marche urbaine",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  }
}