{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348211982&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","261"],
    "title":"Theories of urban design I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348211982&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100876",
      "name":"Cogato Lanza Elena"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"This course focuses on urbanism considered as a «design» discipline, as it is based on a technical description of a possible future. TU 1 deals with models, projects, techniques and tools of urban planning from the 18th century to present.[br/][br/]Knowledge outcomes: a good fundamental knowledge on the discipline, its major theoretical references and build examples.[br/][br/]Skills outcomes: Using the drawing as a critical tool and relating the visual language and the discourse at a theoretical aim, in the frame of three methodologies:[br/]1. Urban criticism: Analysing a portion of city built characterized by ground and spatial discontinuities.[br/]2. Design criticism: Understanding the rationality that, in an urban project, connects scales, functional areas and built forms.[br/]3. Conceptualization: Formulating of a theoretical statement on the basis of a set of projects, considered as experimenting ideas and concepts through spatial themes.[br/][br/]",
      "Content":"This course focuses on the theory of the city as a build entity, and as a whole limited space. It is structured around specific themes, such as: equilibrium, overlay, variety-repetition-regularity, monocentric-polycentric, hierarchical-isotropic, bird's eye view-on foot approach, urban centre-urban district-neighbourhood unit, etc.[br/][br/]Among the case studies: the \"fazyste belt\" in Geneva; Haussmann's Paris; from garden city to New Towns; the rational cities of Le Corbusier and Hilberseimer; the urban slab; Team X urban design; Halles site in Paris.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Theories of urban design I",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100876",
      "name":"Cogato Lanza Elena"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Bibliographie et matériel":"Anthologie fournie en début de semestre.[br/]Lien : Moodle THUI.",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"Théorie de l'urbanisme I se focalise sur la construction de la ville à partir de ses bâtiments en tant qu'entité spatiale limitée. La matière est structurée autour de thèmes spécifiques, tels que : équilibre, superposition, variété-répétition-régularité, mono centrique- polycentrique, hiérarchique-isotrope, ville à vol d'oiseau-ville pas à pas, etc. [br/][br/]Parmi les cas d'étude: la ceinture fazyste à Genève; le Paris d'Haussmann; de la cité-jardin aux New Towns; les villes rationnelles de Le Corbusier et de Hilberseimer; la dalle urbaine; l'urbanisme du Team X; le site des Halles à Paris.[br/][br/]",
      "Forme du contrôle":"Deux exercices à rendre au cours du semestre (50% de la note). Examen oral sur la base d'un troisième exercice (50% de la note).[br/][br/]Critères d'évaluation :[br/][li]Clarté du point de vue théorique et pertinence du graphisme.[br/][li]Niveau d'approfondissement et richesse de la matière exploitée.[br/][li]Ouverture sur d'autres champs disciplinaires.[br/]",
      "Préparation pour":"Théories de l'urbanisme II.",
      "Objectifs d'apprentissage":"Le cours se concentre sur l'urbanisme comme «forme de projet», fondée sur la description technique d'un futur possible. THU I traitera des modèles, projets, techniques et outils de l'urbanisme dès le XVIIIe siècle à nos jours.[br/][br/]Objectifs de connaissance : acquérir une bonne connaissance de base de la discipline, de ses grands références théoriques et exemples réalisés.[br/][br/]Objectifs de compétence : Utiliser le dessin comme instrument critique et articuler les deux langages du visuel et du discours dans un propos théorique, selon trois modalités :[br/]1. Critique de la ville: Développer l'analyse d'une portion de ville construite.[br/]2. Critique du projet : Comprendre les logiques qui, dans un projet urbain relient les échelles, les domaines fonctionnels et les formes construites.[br/]3. Conceptualisation : articuler un propos théorique à partir d'un ensemble de projets, considérés en tant qu'expérimentations d'idées et de concepts sous la forme de thèmes spatiaux.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théories de l'urbanisme I",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}