{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=353879379&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","280"],
    "title":"État - Espace - Propriété : La maîtrise du sol en droit public et privé",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=353879379&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/159096",
      "name":"Dubey Jacques"
    }],
    "lab":null,
    "credits":null,
    "semester":null,
    "free_text":{
      
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"État - Espace - Propriété : La maîtrise du sol en droit public et privé",
    "recitation":null,
    "exam_form":null,
    "project":{
      "total_hours":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/159096",
      "name":"Dubey Jacques"
    }],
    "lab":null,
    "credits":null,
    "semester":null,
    "free_text":{
      "Forme d'enseignement":"Cours mêlant exposés, exemples et exercices",
      "Contenu":"Contenu:[br/]Sous le titre \"Etat - Espace - Propriété\", le cours de droit associé à la semaine ENAC se propose de servir à la fois d'introduction aux semaines ENAC et de sensibilisation au droit proprement dit. Pour ce faire, il aborde en 7 leçons les principaux domaines de droit public et privé qui ont trait à la maîtrise du sol suisse. Les trois premiers cours présentent les rapports à établir entre les notions d'Etat de droit (cours n° 1), de droits fondamentaux (cours n° 2) et de garantie de la propriété privée (cours n° 3). Les trois cours suivants présentent la manière dont les intérêts publics liés à l'aménagement du territoire (cours n° 3) et à la protection de l'environnement (cours n° 5), de la nature ou du paysage (cours n° 6) sont conciliés avec l'intérêt des propriétaires fonciers à disposer librement de leur parcelle de sol. Ces exposés théoriques sont illustrés par des exemples tirés de la jurisprudence et enrichis par des comparaisons avec d'autres ordres juridiques. La dernière séance (cours n° 7) prend la forme d'un exercice dont la résolution implique de coordonner entre elles les différentes matières traitées.[br/]",
      "Forme du contrôle":"Questionnaire à choix multiple (QCM)",
      "Remarque":"Les slides (.ppt) utilisées durant le cours sont à la disposition des étudiant(e)s dès la veille au soir en version (.pdf) sur la plate-forme http://moodle.epf.ch. Un document de cours qui rassemble toutes les jurisprudences à connaître est par ailleurs en vente à La Fontaine.",
      "Objectifs d'apprentissage":"Sous la devise \"projeter ensemble\", la Semaine ENAC a pour objectif d'amener les étudiant(e)s des trois sections d'architecture, de génie civil et de sciences et ingénierie de l'environnement à travailler de manière approfondie sur une thématique commune dans une perspective polytechnique. Quand bien même le droit n'est pas une discipline polytechnique, son étude constitue une manière privilégiée de se préparer à une telle semaine. En effet, cette étude permet non seulement de sensibiliser les étudiant(e)s aux aspects juridiques des trois disciplines combinées au sein de chaque semaine ENAC, mais également à la manière dont les principes et les règles de droit ont justement pour fonction de combiner entre eux l'ensemble des intérêts publics et privés dont relèvent respectivement l'architecture, le génie civil et les sciences et l'ingénierie de l'environnement. Vu à travers le prisme du droit, tout projet s'inscrit dans un contexte social, économique et politique qui appelle nécessairement une collaboration entre spécialistes."
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"État - Espace - Propriété : La maîtrise du sol en droit public et privé",
    "recitation":null,
    "exam_form":null,
    "project":{
      "total_hours":14
    },
    "library_recommends":null,
    "lecture":null
  }
}