{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898353143&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","284"],
    "title":"Housing economics",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898353143&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://moodle.epfl.ch","http://moodle.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/106542",
      "name":"Thalmann Philippe"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"This course prepares to the analysis of habitats, housing and cities from the economic point of view. At the end of the course, students will be able to assess households' housing needs, their differences and the amounts they are willing to spend for housing, as well as understand the point of view of the landlords and the legal context of housing production. They will understand why some households cannot fulfill their housing aspirations and why the housing stock ends up being allocated as observed.[br/][br/]",
      "Content":"The course examines the past, recent and predictable evolution of housing in Switzerland, living and ownership modes, the aspirations and financial constraints of households, as well as their housing mobility. The course also examines the low proportion of owner-occupants and the permanent shortage that characterize the Swiss housing market, past and present housing policy, as well as rent regulation. Students thus have an opportunity to address the advantages and barriers of owner-occupation, single-family homes, and habitat in city center and suburbs. Furthermore, they discover the economic challenges for landlords, the constraints they face and the financial and legal context in which they operate. Finally, the course gives students the means to understand the mechanisms of housing demand and supply."
    },
    "practical":null,
    "language":"Français",
    "title":"Housing economics",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-88074-599-3&amp;con_lng=ENG\" target=\"blank\">La politique du logement / Stéphane Cuennet, Philippe Favarger, Philippe Thalmann</a>\". Year:2002. ISBN:2-88074-599-3</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-88074-490-3&amp;con_lng=ENG\" target=\"blank\">Locataire ou propriétaire ? : enjeux et mythes de l'accession à la propriété en Suisse / Philippe Thalmann, Philippe Favarger</a>\". Year:2002. ISBN:2-88074-490-3</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://moodle.epfl.ch","http://moodle.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/106542",
      "name":"Thalmann Philippe"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"Seuls les chapitres du cours et transparents distribués sur Moodle et la matière présentée en classe sont interrogés dans le contrôle continu.",
      "Bibliographie et matériel":"Thalmann P., Favarger P., [i]Locataire ou propriétaire ? Enjeux et mythes de l'accession à la propriété en Suisse [/i], Lausanne : PPUR, 2002.[br/]Cuennet S., Favarger P., Thalmann P.,[i] La politique du logement[/i], Lausanne : PPUR, 2002.[br/]Polycopié [i]Economie du logement[/i] de P. Thalmann.[br/]",
      "Mots clés":"Habitat, logement, ménages, accession à la propriété.",
      "Forme d'enseignement":"Cours ex cathedra et discussion des documents de cours mis à disposition au préalable.",
      "Contenu":"Le cours examine l'évolution passée, récente et prévisible du logement en Suisse, les modes de vie et de propriété, les aspirations et les contraintes financières des habitants, ainsi que leur mobilité résidentielle. Le cours examine également la faible proportion de propriétaires occupants et la pénurie chronique qui caractérisent la Suisse, la politique du logement passée et actuelle ainsi que le droit du bail. L'étudiant(e) a ainsi l'occasion d'aborder les avantages et difficultés de l'accès à la propriété, à la maison individuelle, à l'habitat en centre-ville et à l'habitat périurbain. Par ailleurs, il/elle découvre les enjeux économiques du logement pour les propriétaires-bailleurs, les contraintes auxquelles ils font face et le contexte financier et légal dans lequel ils opèrent. Enfin, le cours donne à l'étudiant(e) les moyens de comprendre les mécanismes de la demande et de l'offre de logement. ",
      "Forme du contrôle":"Contrôle continu au milieu et à la fin du semestre.",
      "Préparation pour":"Socio-économie des villes et des territoires.",
      "Objectifs d'apprentissage":"Ce cours prépare à l'analyse de l'habitat, du logement et de la ville sous l'angle économique. A la fin du cours, l'étudiant(e) saura évaluer les besoins des ménages en matière d'habitat et de logement, ce qui les différencie et les montants qu'ils sont disposés à dépenser pour se loger, de même que comprendre le point de vue des propriétaires et le cadre légal de la production de logement. Il/elle comprendra pourquoi certains ménages ne peuvent réaliser leurs aspirations résidentielles et comment on aboutit à la répartition des logements observée.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Economie du logement",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-88074-599-3&amp;con_lng=FRE\" target=\"blank\">La politique du logement / Stéphane Cuennet, Philippe Favarger, Philippe Thalmann</a>\". Année:2002. ISBN:2-88074-599-3</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-88074-490-3&amp;con_lng=FRE\" target=\"blank\">Locataire ou propriétaire ? : enjeux et mythes de l'accession à la propriété en Suisse / Philippe Thalmann, Philippe Favarger</a>\". Année:2002. ISBN:2-88074-490-3</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}