{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577868552&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","301(d)"],
    "title":"Studio BA5 (Fröhlich A. & Fröhlich M.)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1577868552&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225189",
      "name":"Fröhlich Anja"
    },{
      "url":"http://people.epfl.ch/225190",
      "name":"Fröhlich Martin"
    }],
    "lab":null,
    "credits":13,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"[b]Hybride Housing[/b][br/]Cities have been laboratories of modernism since the beginning of the20th century. They consist of well-planned structures, negative spaces and inconsistencies due to random change or negligence. The design task aims to find and analyse such characteristics turning them into an opportunity for a new quality of buildings. It is meant to be an experimental task to find a new typology for \"hybrid housing\" as a result of limitations.[br/]A number of existing found and chosen limitations will be developed into a new coded concept. It is essential to explore the relation between unpredictable and random conditions on one hand and absolute necessities on the other. In this process the design must be constantly adapted to turn these parameters into a new quality. Initially the personal and essential needs must be identified. The design then has to be developed further combining different living concepts to form a communal living. Also a public function has to be added. Finding the right location for the building and making the place will be the final step to adjust the concept. Due to a new interpretation of urbanity the result should be a hybrid city component that aims to meet the requirements of the laboratory of modernism.[br/]",
      "Content":"Introduction.[br/]Existential necessities in housing.[br/]Morphology of the program.[br/]\"Sociology of space\" community and privacy.[br/]Contextual analyzing of the program.[br/]Densification of the city.[br/]Developing of material and constructive aspects.[br/]To combinate and to morph a concept/design.[br/]Developing and presentation of a concept/design.[br/]Presentation models.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA5 (Fröhlich A. & Fröhlich M.)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225189",
      "name":"Fröhlich Anja"
    },{
      "url":"http://people.epfl.ch/225190",
      "name":"Fröhlich Martin"
    }],
    "lab":null,
    "credits":13,
    "semester":"Automne",
    "free_text":{
      "Contenu":"Introduction.[br/]Existential necessities in housing.[br/]Morphology of the program.[br/]\"Sociology of space\" community and privacy.[br/]Contextual analyzing of the program.[br/]Densification of the city.[br/]Developing of material and constructive aspects.[br/]To combinate and to morph a concept/design.[br/]Developing and presentation of a concept/design.[br/]Presentation models.[br/]",
      "Objectifs d'apprentissage":"[b]Habiter Hybride[/b][br/]Depuis le début du 20e siècle, les villes sont vues comme des laboratoires du modernisme. Leur manière d'expérimenter va de structures claires et planifiées à des configurations lacunaires et indéfinies. Le projet tend à utiliser de telles failles comme des occasions d'améliorer la qualité des bâtiments. Et il est supposé permettre l'expérimentation de l' \"habiter hybride\". Ainsi le bâtiment se conçoit comme un produit de contraintes: une série de limitations choisies, données et trouvées conduisent à un concept combinatoire nouveau. Il est donc essentiel d'explorer la relation entre des conditions imprévues ou hasardeuses et des besoins existentiels premiers.[br/][br/]L'idée de projet est soumise à un ajustement. Comme point de départ, l'étudiant identifiera des besoins existentiels personnels. Ensuite, il développera son idée de projet par la mise en correspondance entre un vivre ensemble et une fonction publique. La dernière étape du projet sera déterminée par le choix du site. Il en résultera un nouveau morceau hybride de ville. Par son interprétation de l'urbanité, le projet vise à se montrer à la hauteur d'un laboratoire du modernisme."
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA5 (Fröhlich A. & Fröhlich M.)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}