{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=71470051&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","301(a)"],
    "title":"Studio BA5 (Bassi)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=71470051&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://www.laure.epfl.ch","http://www.laure.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/130344",
      "name":"Bassi Andrea"
    }],
    "lab":null,
    "credits":13,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"The thrust of the reflections to be developed from 2011 to 2014 within the Laboratory of Urban Architecture (LAURE) will relate to architectural projects in sites outside urban and suburban areas. These \"blossoming\" sites are part of an \"imaginary\" metropolis whose growth is mapped through a series of hypotheses.[br/][br/]We have chosen an area undergoing profound changes, whose centre of gravity is defined by the empty space left by Lake Geneva. This \"natural\" void is circumscribed by a built environment whose varying degrees of density make up a polycentric metropolis able to host great functional diversity. We aim to draw up a picture of this metropolis through interventions in several of its urban centres.[br/][br/]The learning objectives aim at devising architectural projects in this context of ongoing urban or suburban development. We shall also reflect on the search for collective values (public areas, mixed-use, density) in urban areas. Students will learn to adopt a town planning and architectural attitude in the face of the metropolis development issue. [br/]",
      "Content":"The urban areas to be investigated are part of the polycentric metropolis around Lake Geneva, beyond city, cantonal and country boundaries. Each semester a new site will be selected within this densifying area for an independent project assessment. Projects will have to integrate the mixed-use dimension and the transformation of the site's current status - mainly industrial areas - into an area dedicated to housing/offices/equipment. Simultaneously, our reflection will focus on the architectural outlook of façades as well as on structural aspects. Theoretical support will fuel project development in the form of in situ studies and conferences. [br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio BA5 (Bassi)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://www.laure.epfl.ch","http://www.laure.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/130344",
      "name":"Bassi Andrea"
    }],
    "lab":null,
    "credits":13,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"histoire de l'architecture, de la ville et du territoire, notions constructives et structurelles.",
      "Mots clés":"Architecture, Médiapolis, densité, mixité, forme urbaine, béton préfabriqué",
      "Forme d'enseignement":"visites in situ, conférences, séminaires, workshop.",
      "Contenu":"Les morceaux de ville sur lesquels nous nous pencherons s'inscrivent dans la métropole polycentrique qui entoure le Lac Léman au delà des limites communales, cantonales et nationales. Un nouveau site sera désigné chaque semestre dans ce territoire à densifier et fera l'objet d'une réflexion de projet autonome. Le développement des projets devra englober l'aspect de la mixité programmatique et de la mutation de l'état actuel du site, principalement industriel, en quartier de logements/bureaux/équipements. En parallèle, l'expression architecturale extérieure et les aspects structurels seront au centre de notre réflexion. Des apports théoriques alimenteront l'élaboration du projet sous forme d'in situ et de conférences.[br/]",
      "Forme du contrôle":"Jury.",
      "Objectifs d'apprentissage":"La réflexion principale que nous développerons au sein du laboratoire d'architecture urbaine (LAURE) de 2011 à 2014 portera sur des projets d'architecture dans des sites en dehors de la ville et de sa périphérie. Ces lieux \"en devenir\" font partie d'une métropole \"imaginaire\" dont la croissance est décrite par une série d'hypothèses.[br/][br/]Nous avons choisi un territoire en profonde mutation dont le centre de gravité est défini par le vide laissé par le Lac Léman. Ce vide \"naturel\" est délimité sur son pourtour par un tissu bâti dont les différents degrés de densité constituent une métropole polycentrique à même d'accueillir une grande mixité fonctionnelle. Nous postulons de faire le portrait de cette métropole par des interventions dans plusieurs des pôles urbains qui la compose.[br/][br/]Les objectifs pédagogiques visent l'élaboration de projets d'architecture dans ce contexte en cours d'urbanisation ou de périurbain. La recherche de valeurs collectives (espace public, mixité programmatique, densité) propres à l'espace de la ville sera également l'objectif de nos réflexions. L'étudiant apprendra à adopter une attitude urbanistique et architecturale face à la problématique de la métropolisation.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet BA5 (Bassi)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}