{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194441&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","328"],
    "title":"Architecture and the human hand",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194441&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/101461",
      "name":"Frey Pierre"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Architecture and the human hand",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/101461",
      "name":"Frey Pierre"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Lecture by Pierre Frey on Definition and History of Vernacular Architecture ;[br/]Lecture by Pierre Frey on New Vernacular Architecture ;[br/]Lecture by Juhani Pallasmaa on Embodied Wisdom in Architecture ;[br/]Lecture by Marie-Pierre Zufferey on Expression of the Artisan's Hand in Stone Carving ;[br/]Lecture by Sytse de Maat on Human Interaction with Building ;[br/]Lecture by Sytse de Maat on Human Expression in Architecture ;[br/]Lecture by (to be proposed) ;[br/]Exercises: five sessions in which students will research and analyse cases of dwelling, homes, workshops, and their contexts in order to suggest vernacular interventions in the spirit of the lectures. [br/]",
      "Contenu":"Thematic[br/]Architecture as an expression of human interaction with the built environment. In the lifetime of a building, many people are involved in giving it shape. Owner-builders are usually deeply engaged in the construction process and have a close relationship with the resulting structure. Artisans have an intense interaction with the structure, which is expressed in its appearance, its texture, its aesthetics and can be recognized by anyone. Designers, developers, and contractors have a more organisational position.[br/]Today the interaction of users, craftsmen, and builders with the building is more and more reduced in the process of institutionalization, mechanization, and industrialization of construction. The course seeks to redefine the role of the architect in this context and to reinforce embodied experience as part of the creation, use, and reconstruction of buildings.  [br/]",
      "Forme du contrôle":"Evaluation / Exam : Scale Model 1:20 and Oral Explanation and Debate (no graphics, no text)[br/]Techniques : manual modelling, all tools permitted except electricity (meaning also no CAD nor CAM)[br/]",
      "Objectifs d'apprentissage":"Objectives[br/]To teach students about the value of human interaction in the use, production and design of architecture. To familiarize students with the involvement of the end-user in design and its potentials in comparison with todays common design and build strategies. [br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Architecture et la main humaine",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}