{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773987&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","324"],
    "title":"History of architecture VI",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773987&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126097",
      "name":"Gargiani Roberto"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The objective of the course is to provide the student with an in-depth knowledge of the main topics of the architecture from the beginning of the 18th century until today, with a special focus on the aspects relating to the building techniques, the structures, the various forms of cladding and space. [br/][br/]Throughout the courses, the student will develop the capacity to describe and place the works historically and with a critical eye, an analytical and critical mind towards the meaning of the various architectures regarding their building technique and the cultural context, an in-depth knowledge of the ways materials and structures have been used in the various works as well as a correct terminology, the ability to draw, in a simple and schematic way, sections and building details of the works.[br/]",
      "Content":"[b]From the \"ossature-remplissage\" of Perret to the hollow structure of Kahn.[/b][br/]From Behrens to Taut: Symbol and structure. From Baudot and Sauvage: shapes \"flamboyantes\" of the structure. From the \"Cite Industrielle\" to the \"Ville Contemporaine\": cities of the future in reinforced concrete. Futurism, constructivism, De Stijl. Perret: order and truth of reinforced concrete. Le Corbusier: from the framework \"Dom-ino\" to the \"espace indicible\". Mies van der Rohe: Search for the perfect structure. Terragni: sculptural framework and wall. Kahn and the hollow structure.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"History of architecture VI",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126097",
      "name":"Gargiani Roberto"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Histoire de l'architecture V.",
      "Bibliographie et matériel":"Sera distribuée pendant les cours. Les images projetées durant les leçons (plans, sections, vues, détails constructifs, photographies générales et de détails) constituent un support fondamental pour la connaissance des oeuvres. [br/][br/]",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"[b]De l'ossature-remplissage de Perret à la construction creuse de Kahn[/b][br/]De Behrens à Taut: symbole et structure. De Baudot et Sauvage: formes «flamboyantes» de structure. De la «Cité Industrielle» à la «Ville Contemporaine»: villes de l'avenir en béton armé. Futurisme, constructivisme, De Stijl. Perret: ordre et vérité du béton armé. Le Corbusier: de l'ossature Dom-ino à l'espace indicible. Mies van der Rohe: recherche de la structure parfaite. Terragni: ossature sculpturale et mur. Kahn et la construction creuse.[br/][br/]",
      "Forme du contrôle":"L'examen consiste en une discussion orale pour vérifier les connaissances acquises par l'étudiant durant les cours et par l'étude de la bibliographie obligatoire. La condition sine qua non pour réussir l'examen orale est que l'étudiant démontre qu'il a acquis une connaissance critique des thèmes abordés dans les cours et dans la bibliographie. L'étudiant devra également démontrer son parcours personnel en présentant son dossier de travail personnel qui réunit les notes prises durant les cours, ses fiches de lecture des livres et articles, ses dessins personnels, et des schémas graphiques originels des diverses oeuvres. La note finale consistera à 45% de la connaissance des cours, à 45% de la connaissance de la bibliographie et à 10% du dossier personnel.",
      "Préparation pour":"Histoire de l'architecture VII.",
      "Objectifs d'apprentissage":"Le cours se propose de fournir les instruments critiques pour une connaissance approfondie des principales thématiques qui caractérisent l'architecture depuis le début du XVIIIe siècle jusqu'à nos jours, avec un accent particulier sur les aspects relatifs aux techniques constructives, aux structures, aux formes de revêtement et à l'espace. [br/][br/]Acquis de formation : être capable de décrire et de situer historiquement et de manière critique les oeuvres; acquérir une capacité d'interprétation critique des significations des diverses architectures en relation à leur technique constructive et au contexte culturel; acquérir une connaissance approfondie des modalités avec lesquelles les matériaux et les structures ont été utilisés dans les diverses oeuvres ainsi qu'une terminologie correcte; savoir dessiner, de manière simple et schématique, les plans, sections et détails constructifs des oeuvres.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de l'architecture VI",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}