{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1776797&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","321"],
    "title":"Theory of architecture V",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1776797&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105747",
      "name":"Marchand Bruno"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"This course is a direct continuation of Theory of architecture IV. It deals with the same questions which now concern the architectural characteristics and developments after the second World War, in order to:[br/][br/][li]Develop an architectural culture[br/][li]Be acquainted with the main principles of architectural theory of this period[br/][li]Understand the evolution of architectural theory in relation to social, economical and political changes[br/][li]Be acquainted with the work of the masters of this period[br/][li]Identify the impact of theories on the design process of architectural work[br/][li]Articulate and argue a theoretical problematic in response to a specific question[br/][li]Search and select relevant information in addition to the content of the hand-out[br/][li]Communicate and present clearly and legibly the development of an answer to a particular issue.[br/]",
      "Content":"The new Monumentality, Le Corbusier, the Ineffable Space and the \"Maison des Hommes\", Humanism, proportions and \"The Palladian Plan\", Alvar Aalto and the Human Architecture, Mies van der Rohe, the aesthetics of construction and the industrial classicism, Louis Kahn, Form and design, American architectural scene and the power of mechanization, Philip Johnson: post-Mies and eclectic classicism, Eero Saarinen: post-Mies and \"sculptural baroquism\", the hidden order of nature: organicism and artistic forms, new paradigms: modular grids and mat-buildings, the emergence of Team X and the end of the CIAM.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Theory of architecture V",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105747",
      "name":"Marchand Bruno"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"Théorie de l'achitecture IV.",
      "Bibliographie et matériel":"Comprise dans un polycopié.",
      "Forme d'enseignement":"Cours magistral.",
      "Contenu":"La nouvelle Monumentalité, Le Corbusier, l'espace indicible et la Maison des Hommes, Humanisme, proportions et le plan centré, Alvar Aalto et l'humanisme de l'architecture, Mies van der Rohe, l'esthétique de la construction et le classicisme industriel, Louis Kahn, Form et design, la scène américaine et le pouvoir de la mécanisation, Philip Johnson: l'après-Mies et le classicisme éclectique, Eero Saarinen: l'après-Mies et le nouveau «baroquisme sculptural», l'ordre caché de la nature: organicisme et formes artistiques, nouveaux paradigmes: grilles modulaires et «mat-buildings», l'émergence du Team 10 et la fin des CIAM.",
      "Forme du contrôle":"Preuve d'examen écrit pour 100% de la note finale.",
      "Préparation pour":"Théorie de l'achitecture VI.",
      "Objectifs d'apprentissage":"Ce cours est la suite directe de Théorie de l'architecture IV. Il poursuit les mêmes interrogations concernant cette fois les développements et les inflexions de l'architecture après la Seconde Guerre mondiale. Les acquis du cours sont :[br/][br/][li]développer une culture architecturale,[br/][li]connaître les principes de la théorie architecturale de la période,[br/][li]comprendre l'évolution de la théorie architecturale en regard des changements sociaux, économiques et politiques,[br/][li]connaître l'oeuvre des maîtres de la période,[br/][li]identifier l'implication des théories dans la conception des oeuvres architecturales,[br/][li]formuler et argumenter une problématique théorique à partir d'une question posée,[br/][li]rechercher et sélectionner les informations nécessaires en plus de celles du polycopié,[br/][li]communiquer et présenter de manière claire et lisible le développement d'une question posée.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie de l'architecture V",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}