{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194454&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","342"],
    "title":"Learning from vernacular",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194454&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/101461",
      "name":"Frey Pierre"
    },{
      "url":"http://people.epfl.ch/147412",
      "name":"Hofmann Milo"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"English",
    "title":"Learning from vernacular",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/101461",
      "name":"Frey Pierre"
    },{
      "url":"http://people.epfl.ch/147412",
      "name":"Hofmann Milo"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"Le cours est donné en langue française.[br/][br/][br/]Groupe d'enseignement[br/][br/]- Pierre Frey, Historien de l'art, Professeur EPFL[br/]- Milo Hofmann, Architecte, Doctorant-assistant EPFL[br/][br/][br/]Conférenciers et experts externes[br/][br/]- Chercheurs du laboratoire CRAterre-ENSAG :[br/]Hubert Guillaud, Architecte[br/]Romain Anger, Ingénieur[br/]Michel Dayre, Géologue[br/]Annalisa Caimi, Architecte-doctorante[br/][br/]- Professionnel de la terre crue :[br/]Pascal Favre, Entrepreneur Maçon de l'entreprise Arbio de Lausanne",
      "Contenu":"Vernaculaire[br/]Pour Ivan Illich, vernaculaire est un terme technique emprunté au droit romain, où on le trouve depuis les premières stipulations jusqu'à la codification par Théodose. Il désigne l'inverse d'une marchandise : était vernaculaire tout ce qui était confectionné, tissé, élevé à la maison et destiné non à la vente mais à l'usage domestique.[br/][br/]Terre crue [br/]Afin de saisir les spécificités de la matière terre, ainsi que les enjeux, les potentialités et les limites de son utilisation, des interventions par des professionnels ainsi que par des chercheurs du laboratoire CRAterre-ENSAG (Centre International de la Construction en Terre - École Nationale Supérieure d'Architecture de Grenoble) permettront d'aborder la thématique sous des multiples points de vue. [br/][br/]Apprendre[br/]Le fonds d'architecture vernaculaire propriété de l'EPFL (http://learning-from-vernacular.epfl.ch) est un ensemble clos unique au monde de documentations et d'environ 700 maquettes de bâtiments d'habitation ou d'utilité qui constituent un échantillon d'une grande diversité de solutions spatiales, symboliques et constructives régissant, ou ayant régi, l'espace domestique et l'espace de travail de cultures vernaculaires sous tous les climats de la terre. ",
      "Forme du contrôle":"Les étudiants développent une recherche sur un sujet à leur choix, rédigent un rapport écrit et le présentent lors de la dernière session de cet Unité d'Enseignement.[br/]Le travail peut être effectué en groupes de maximum trois étudiants. ",
      "Objectifs d'apprentissage":"L'Unité d'Enseignement se propose de concentrer l'attention des étudiants sur les diverses relations des cultures vernaculaires à la terre crue. Par cette Unité d'Enseignement, nous proposons une exploration d'un matériau de construction qui non seulement est présent dans l'architecture vernaculaire des cinq continents, mais qui compose encore aujourd'hui l'habitat d'une très large partie de la population mondiale. Depuis des millénaires, la terre est extraite, travaillée et mise en ½uvre en une multitude de manières, profitant des caractéristiques spécifiques à la matière telle qu'elle est présente dans l'environnement naturel. À chaque terre sa technique, ce qui se concrétise dans des innombrables pratiques, solutions constructives et procédés de fabrication développés par les populations de façon à tirer le meilleur parti des ressources disponibles localement. Si ces pratiques vernaculaires des peuples sous toutes les latitudes ne présentent pas en elles-mêmes une réponse toujours appropriée à la situation actuelle, elles n'en contiennent pas moins un stock impressionnant de procédés exemplaires de la capacité des hommes à tirer parti de situations données.[br/][br/]L'objectif de l'Unité d'Enseignement est tout d'abord de familiariser les étudiants (architectes, ingénieurs civils et ingénieurs en environnement) avec ces cultures vernaculaires, de réunir, d'analyser et de critiquer la documentation disponible. L'idée de base est que la culture scientifique moderne ne dispose pas du monopole des savoirs et qu'il existe un intérêt prépondérant à considérer aussi les autres sources de connaissance."
    },
    "practical":null,
    "language":"English",
    "title":"Learning from vernacular - la terre crue",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}