{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=321157060&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","350"],
    "title":"City intervals: the urban challenge",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=321157060&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/196819",
      "name":"Chavinier Elsa"
    },{
      "url":"http://people.epfl.ch/103441",
      "name":"Rossi Luca"
    },{
      "url":"http://people.epfl.ch/117356",
      "name":"Ruzicka-Rossier Monique"
    },{
      "url":"http://people.epfl.ch/106674",
      "name":"Von Der Mühll Dominique"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"City intervals: the urban challenge",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/196819",
      "name":"Chavinier Elsa"
    },{
      "url":"http://people.epfl.ch/103441",
      "name":"Rossi Luca"
    },{
      "url":"http://people.epfl.ch/117356",
      "name":"Ruzicka-Rossier Monique"
    },{
      "url":"http://people.epfl.ch/106674",
      "name":"Von Der Mühll Dominique"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"FLes étudiants travailleront sur un territoire en frange de ville(s), tout proche du site des hautes écoles : le secteur autour de la Bourdonnette, appelé à une profonde mutation ces prochaines années en lien avec le projet Métamorphose.[br/]Les travaux s'élaborent en trois temps :[br/]Temps 1 - Observer, se questionner. Prise de connaissance des problématiques. Conférences et entretiens avec des acteurs concernés, lecture de documents, visites in situ.[br/]Temps 2 - Comprendre. Analyse du lieu en appui des hypothèses retenues. Les caractéristiques matérielles s'y trouvant seront répertoriés (par ex. structures et typologies urbaines, aménagements des espaces publics, mobiliers urbains, etc.). Les structures institutionnelles et organisationnelles seront identifiées (par ex. la structure administrative de la ville, le rôle du patrimoine, la place de la nature, les pratiques urbaines, la place des usagers comme \" habitants \" du (des) territoire(s) dans les processus de fabrication de la ville, etc.). Les dispositifs fonctionnels seront classifiés (par ex. infrastructures techniques concernant la mobilité, la sécurité, l'entretien, la gestion, etc.) Et les cohérences et les incohérences par rapport aux hypothèses du début seront resituées dans leur contexte.[br/]Temps 3 - Les prémisses d'un projet. Propositions de pistes d'intervention et préparation de la restitution finale.[br/]Les étudiants travaillent par groupes. Les domaines de l'urbanisation, de la mobilité et de l'environnement sont approchés. La dimension politique est également prise en compte. Les groupes seront confrontés au débat public : la présentation finale est faite en présence de représentants des autorités politiques et de l'administration de la Ville.[br/]Des séminaires intermédiaires à la charnière des phases permettent de mettre en commun des données collectées et des réflexions, d'identifier les enjeux et de définir les thèmes pertinents pour la phase de propositions. Divers apports théoriques sont dispensés au cours du semestre, par les enseignants responsables et des intervenants extérieurs invités. (Le programme détaillé est mis en ligne sur le site Chôros à partir de février 2013).",
      "Contenu":"Le contenu consiste à déchiffrer l'entre-deux des villes, comprendre le processus de fabrication de la ville, et esquisser des pistes d'intervention. Trois axes d'observation sont proposés comme fil rouge des réflexions :[br/]1. L'invisible et le visible. Existe-t-il des relations entre ce qui n'a pas de matérialité visible et ce qui en a ? C'est-à-dire peut-on par exemple établir un rapprochement entre la vie d'un quartier et le tracé des rues, entre les démarches institutionnelles et la localisation des équipements, entre les règles, les normes et les compositions urbaines ou les architectures, entre les statistiques et les configurations spatiales ?[br/]2. L'éphémère et le pérenne. Peut-on observer une synergie entre ce qui dure et ce qui ne dure pas ? C'est-à-dire peut-on identifier des interactions entre ce qui est fluide, les flux, et ce qui est solide, le bâti. Par flux, il faut autant comprendre les flux composés de piétons sortant des stations de transports publics ou des salles de spectacle, que ceux des voitures jaillissant des rampes de garages souterrains ; et il faut de même inclure les flux d'informations diffusées du téléphone portable à l'ordinateur, et aussi les flux des migrants cherchant du travail, ou ceux des populations étrangères trouvant asile. Par bâti, il faut entendre ce qui est édifié, ce qui fait « édifice », du bâtiment à l'ouvrage d'art, de la rue à la place, de la déchetterie à la station de traitement des eaux.[br/]3. Les liens et les ruptures. Quelles sont les manifestations spatiales qui peuvent être observées dans l'entre-deux-des-villes ? Couture ou déchirure ? Spécialisation ou généralisation ? Segment ou ensemble ? Espacement ou resserrement ? Eloignement ou rapprochement ? ",
      "Forme du contrôle":"L'évaluation se fait sur la base des éléments produits par les groupes aux différentes étapes de leurs travaux : matériel d'affichage et présentations intermédiaires, poster(s) final(s) présentant les pistes d'action proposées et explicitant les objectifs et le processus sur lesquels elles s'appuient.[br/]Le classement systématique des données et informations collectées, constituant une source d'information collective, et un carnet d'observation (individuel) sont deux instruments qui supporteront les dialogues tout au long du semestre. Faisant partie intégrante de la démarche, ils constitueront une pondération de l'évaluation.[br/]et un carnet d&#8217;observation (individuel) sont deux instruments qui supporteront les dialogues tout au long du semestre. Faisant partie intégrante de la démarche, ils constitueront une pondération de l&#8217;évaluation.[br/]",
      "Remarque":"L'unité d'enseignement a pour but de lier étroitement le processus de compréhension et d'action, l'analyse et le projet s'autoalimentent dans un dialogue entre acteurs. Dans cette perspective une grande attention sera portée à la prise de connaissance concernant le secteur de projet, par le biais de ressources documentaires (écrites et électroniques), mais aussi d'un travail d'observation sur le terrain et d'entretiens avec les différents acteurs concernés.[br/]aussi d'un travail d'observation sur le terrain et d'entretiens avec les différents acteurs concernés.",
      "Objectifs d'apprentissage":"L'unité d'enseignement vise à sensibiliser les futurs architectes et ingénieurs (GC, SIE) au processus de production d'espaces urbanisés dans l'entre-deux des villes. Cet entre-deux des villes est autant l'espace en frange des villes-centres que celui où l'urbanisation est qualifiée de suburbaine, périurbaine ou rurbaine. L'entre-deux-des-villes est une ville dont les amarres sont lâches voire rompues. Elle se promène avec ceux qui en forment sa substance, les hommes. Elle se glisse dans leurs mallettes, leurs portables, leurs iphones. La ville s'échappe du bâti et devient flux, relations entre les hommes, entre les objets, entre les hommes et les objets.[br/]L'objectif est d'observer, de se questionner et de comprendre en quoi les situations de l'entre-deux sont porteuses d'urbanité, en quoi les endroits \" entre quelque chose \" revêtent des potentiels ignorés où se fabrique la ville. Ainsi on s'attardera sur les cohérences et les incohérences par rapport à un système défini au préalable, on observera l'invisible et le visible, l'éphémère et le pérenne, les liens et les ruptures. Puis les étudiants feront émerger des pistes de projets possibles.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Entre-deux des villes : une urbanité à conquérir.... Comment ?",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}