{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=41379629&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","356"],
    "title":"Photography and Territory or the Observatory of the territory",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=41379629&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/115069",
      "name":"Landecy Jean-Michel"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Photography and Territory or the Observatory of the territory",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/115069",
      "name":"Landecy Jean-Michel"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Séminaires d'enseignements pratiques et programme[br/]Expérimentation de divers modes de représentation de la photographique à la vidéo.[br/][br/]. Réalisation d'une étude sur un site présélectionné.[br/][br/]. Prise en compte des techniques d'impression photographique[br/][br/]. Préparation d'un site internet de l'Observatoire du Territoire[br/][br/]",
      "Contenu":"Les points de vues [br/]Qu'est ce qu'un point de vue ?, Quelle est la limite de perception du territoire ?[br/]Comme la photographie aérienne définit-elle la mesure d'un territoire ?[br/][br/]L'usage du lieu[br/]Comment évolue la multiplicité d'usages qui donnent sens au territoire ?[br/]Comment enregistrer le rythme de vie des lieux urbains, de transcrire les mouvements et les flux ?[br/]La nature modifiée[br/]Qu'est ce qu'un paysage naturel ?[br/]Quelle est l'incidence d'un ouvrage d'art dans le territoire ?[br/]Comment représenter les mutations des périphéries urbaines ?[br/]La notion de temps dans la représentation[br/]Quelle est l'incidence de la vitesse dans la perception et la conception du Territoire ?[br/]Comment révéler un lieu par l'image filmée ? [br/][br/]La mise en place d'un observatoire implique une relation dans le temps. Le temps s'inscrit alors dans le processus de création, voir de destruction d'un site.[br/]Création d'une banque d'images[br/]Chaque exemple étudié et chaque site photographié sera répertorié, sous forme numérique et mis à la disposition de l'ensemble des laboratoires de recherche internes à l'ENAC.[br/]Programme[br/]Forme d'enseignement.[br/]A la fois théorique et pratique, il sera organisé sous forme de séminaires thématiques en \" Studio \" ou In Situ en collaboration avec des intervenants et enseignants extérieurs. [br/][br/]Exposés théoriques[br/]Eléments d'inventaire des grandes missions photographiques territoriales.[br/]Eléments d'analyse des méthodologies:[br/][br/]. L'exemple de la DATAR, Délégation à l'Aménagement du Territoire 1986[br/]. Alex Mac Lean, L'arpenteur du Ciel. 1998",
      "Forme du contrôle":"[br/]L'évaluation portera sur un travail de groupe (3 personnes) et le rendu de l'étude thématique d'un territoire en mutation et sa représentation photographique.[br/]",
      "Objectifs d'apprentissage":"Dans sa conception, l'aménagement du territoire fait appel à de multiples notions, d'usage, de paysage, d'héritage ou encore d'image. Dans sa programmation, il fait l'objet de multiples collaborations interdisciplinaires, comme autant d'expériences au service d'un même concept. [br/] [br/]Dans le décryptage de cette superposition d'expérimentations, notre regard se doit d'être le médium analytique de chaque contexte. Afin de maitriser, contrôler et programmer le développement de la grande échelle territoriale. [br/] [br/]Décrire, analyser et instruire, sont les 3 volontés nécessaires pour renouveler notre regard sur le territoire contemporain. Constituer une vision panoramique des transformations qui modifient l'Environnement Naturel et Construit, c'est découvrir la multiplicité, la diversité et la richesse du paysage architectural mais aussi disposer des balises qui serviront à orienter et organiser sa propre mutation. [br/]La mise en place de l'Observatoire du Territoire entend représenter ces transformations en prenant en compte 2 notions principales : le temps et le thème. Une double réflexion au service d'une méthodologie. Comme une série de \" coupes \" réalisées sur le territoire en mutation. [br/] [br/]Pour représenter la dimension effective des territoires habités et distendus, que les photos satellites montrent comme des nébuleuses sans limite, les cartes topographiques ne sont plus satisfaisantes. Celles-ci ne reconnaissent de condition urbaine que là ou le bâti est continu et contenu.  [br/]L'observatoire travaillera sur le territoire contemporain. La photographie s'impose comme outil d'analyse et de représentation. Par ce qu'elle s'inscrit dans l'espace de l'architecture et du territoire urbain avec une clarté et une instantanéité remarquables, intégrant les notions d'usage et de perception. [br/]À l'inverse de l'idée répandue selon laquelle l'inflation actuelle des images vide celles-ci de leur contenu et les banalise, on peut au contraire considérer que la création photographique développe de nouvelles façons de voir, de représenter et de comprendre les transformations du territoire. [br/] [br/]Le double objectif de l'Observatoire du territoire est une réflexion sur l'image comme sur les transformations du territoire contemporain. [br/]La photographie oriente notre regard vers une démarche analytique, en augmentant notre connaissance et notre capacité à concevoir l'évolution de l'espace urbain et du territoire.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Photographie et territoire ou l'observatoire du territoire",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}