{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=374415795&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","362"],
    "title":"Theories of urban design II",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=374415795&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100876",
      "name":"Cogato Lanza Elena"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"This course focuses on urbanism considered as a «design» discipline, as it is based on a technical description of a possible future. TU 2 deals with models, projects, techniques and tools of urban planning from the 18th century to present.[br/][br/]Knowledge outcomes: a good fundamental knowledge on the discipline, its major theoretical references and build examples.[br/][br/]Skills outcomes: Using the drawing as a critical tool and relating the visual language and the discourse at a theoretical aim, in the frame of two methodologies:[br/]1. Design criticism: Understanding the rationality that, in an urban project, connects scales, functional areas and built forms.[br/]2. Conceptualization: exact understanding of a theoretical text; formulating a theoretical statement on the basis of a set of projects.[br/]",
      "Content":"This course focuses on the effort, deployed during the twentieth century, to imagine a different city that is no longer characterized by the continuity of the built and by the presence of boundaries between city and countryside, natural and built. The open space plays a structural role and is considered as a major resource of the liveable city. Among the case studies: the American territorial grid, Broadacre City; [i]Stadtlandschaft[/i]; No-stop city; the city as an archipelago; the projects for [i]Grand Paris[/i] (2009). [br/][br/]The course will also address the role of gardens and parks as a field of innovation and experience for urbanism.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Theories of urban design II",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100876",
      "name":"Cogato Lanza Elena"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Bibliographie et matériel":"THUII/Reader, anthologie fournie en début de semestre.[br/]Lien : Moodle THUII.",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"Le cours se focalise sur l'effort, déployé au cours du XXe siècle, d'imaginer une ville différente, qui ne soit plus caractérisé par la [i]continuité[/i] du bâti et par la présence de [i]limites[/i] entre campagne et ville, naturel et construit. C'est à l'espace non construit que revient un rôle structurant, ainsi que celui de ressource première de la ville habitable. Parmi les cas d'étude : la grille territoriale américaine; Broadacre City; la ville-paysage; No-stop city; la ville-archipel; les projets pour le Grand Paris (2009).[br/][br/]Le cours traite également de l'art des jardins et du projet de parc comme domaines d'innovation et d'expérimentation pour le projet urbanistique.[br/]",
      "Forme du contrôle":"Un exercice à rendre au cours du semestre (40% de la note). Examen oral sur la base d'un deuxième exercice (60% de la note).[br/][br/]Critères d'évaluation:[br/][li]Clarté du point de vue théorique et pertinence du graphisme.[br/][li]Niveau d'approfondissement et richesse de la matière exploitée.[br/][li]Ouverture sur d'autres champs disciplinaires.[br/]",
      "Préparation pour":"Cours ex cathedra et séminaires.",
      "Objectifs d'apprentissage":"Le cours se concentre sur l'urbanisme comme «forme de projet», fondée sur la description technique d'un futur possible. Il traite des modèles, projets, techniques et outils de l'urbanisme dès le XVIIIe siècle à nos jours.[br/][br/]Objectifs de connaissance : acquérir une bonne connaissance de base de la discipline, de ses grands références théoriques et exemples réalisés.[br/][br/]Acquis de compétence : Utiliser le dessin comme instrument critique et articuler les deux langages du visuel et du discours dans un propos théorique, selon deux modalités :[br/]1. Critique du projet : Comprendre les logiques qui, dans un projet urbain (théorique ou réalisé) relient les échelles, les domaines fonctionnels et les formes construites.[br/]2. Conceptualisation : Comprendre exactement un texte théorique; formuler un propos théorique sur la base d'un ensemble de projets.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théories de l'urbanisme II",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}