{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898402727&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["AR","383"],
    "title":"City and Habitat : from housing to territory",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898402727&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/102121",
      "name":"Kaufmann Vincent"
    },{
      "url":"http://people.epfl.ch/168009",
      "name":"Pattaroni Luca Giovanni"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"The purpose of this course is to introduce students to the problematics and methods of urban sociology and architecture. It should allow them to acquire the skills and knowledge necessary to look at the challenges posed by the urbanization of society through the prism of sociology.[br/][br/][br/]The student will be able to:[br/][li]Describe the social and spatial transformation of the modern city.[br/][li]Know the major traditions to explain urban transformation.[br/][li]Understand the basics of contemporary lifestyles.[br/][li]Analyze the relationships between the built environment and lifestyles.[br/][li]Create original visuals that reflect the relationships between lifestyles and the built environment.[br/][li]Provide the sociological bases for an architectural project.[br/]",
      "Content":"Changes in urban and architectural forms are closely linked to changes in society and lifestyles. To better grasp this link, the course is divided into two parts.[br/][br/][li]In the first part we will study the birth of sociology in its relationship to the profound changes that marked the 19th century and the emergence of the modern city.[br/][li]The second part will focus on the development of modern changes in lifestyles and the questions questioning their implications on the urban and architectural forms inherent from the modern city.[br/][br/]An exercise will be dedicated to the empirical analysis of the link between the built environment and lifestyles.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"City and Habitat : from housing to territory",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/102121",
      "name":"Kaufmann Vincent"
    },{
      "url":"http://people.epfl.ch/168009",
      "name":"Pattaroni Luca Giovanni"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"Aucun.",
      "Bibliographie et matériel":"Polycopié + livre.",
      "Forme d'enseignement":"Cours ex-cathedra, exercice empirique.",
      "Contenu":"L'évolution des formes urbaines et architecturales est étroitement liée aux transformations de la société et des modes de vie. Afin de saisir ce lien étroit, le cours est divisé en deux parties.[br/][br/][li]Dans la première partie, nous étudierons la naissance de la sociologie dans son rapport aux transformations profondes qui ont marqué le XIXème siècle et l'avènement de la ville moderne.[br/][li]La deuxième partie portera sur la mise les transformations contemporaines des modes de vie et la mise en question qu'elles impliquent sur les formes urbaines et architecturales héritée de la ville moderne.[br/][br/]Un exercice sera consacré à l'analyse empirique du lien entre l'environnement construit et les modes de vie.",
      "Forme du contrôle":"Pour les connaissances et compétences de base : QCM à la fin du cours (50 % de la note finale).[br/]Pour les compétences « supérieures » : exercice de terrain évalué à la fin du semestre (50 % de la note finale).",
      "Objectifs d'apprentissage":"Ce cours a pour objectif d'initier les étudiants aux problématiques et aux méthodes de la sociologie urbaine et de l'architecture. Il doit leur permettre d'acquérir les compétences et les connaissances nécessaires pour porter un regard sociologique sur les défis posés par l'urbanisation de la société.[br/][br/]L'étudiant sera capable de :[br/][li]Décrire les transformations sociales et spatiales de la ville contemporaine[br/][li]Connaître les grandes traditions d'explication des transformations urbaines[br/][li]Comprendre les fondements des modes de vie contemporains[br/][li]Analyser les rapports entre l'environnement construit et les modes de vie[br/][li]Créer des visualisations originales pour rendre compte des rapports entre les modes de vie et l'environnement construit[br/][li]Poser les bases sociologiques d'un projet d'architecture.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Ville et habitat: du logement au territoire",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}