{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1586853953&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","402(d)"],
    "title":"Studio MA2 (Dietz)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1586853953&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    }],
    "lab":null,
    "credits":13,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"[i]Hyper-typologies[/i] is set in the context of CH16M2048, a research platform initiated by ALICE (see also alice.epfl.ch > research > ch16m2048). Students will engage in a research on typologies while interrogating the relationship of the body and human sensory perception in the production of urban spatial strategies. [br/]Feeding on the narratives developed in the first semester ([i]2048 - An Architectural Fiction[/i]), students will:[br/][li]Analyse a series of existing - historical and/or contemporary - typologies in terms of their socio-cultural context and spatial qualities.[br/][li]Transpose their studies and findings into new types of interaction spaces, according to the following premise: to reduce space consumption while augmenting spatial, social, economic and living qualities.[br/][li]Synthesize these new types into a project in order to challenge and potentially alter a chosen narrative vision inherited from the previous semester while increasing urban density and diversity.[br/][li]Produce an architectonic project set in urban conditions that accounts for the presence of the human body in its immediate surroundings, and thus provide an [i]architectonic vision[/i] for a socially and economically sustainable living environment, at a 40 year horizon.[br/][li]Implement their findings, the result of their analysis and their fictional narrative into a singular device, the Metamodel, which will act as a communication interface, providing a tangible artifact upon which to test and share scenarios.[br/]",
      "Content":"Hyper-typologies[br/]See MA1 - Dietz.[br/]",
      "Note":"More details can be found by visiting our website: [i]alice.epfl.ch > teaching > y4[/i]."
    },
    "practical":null,
    "language":"Français",
    "title":"Studio MA2 (Dietz)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    }],
    "lab":null,
    "credits":13,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"Des informations détaillées sont disponibles sur notre site : [i]alice.epfl.ch > enseignement > y4[/i].",
      "Prérequis":"Bachelor.",
      "Bibliographie et matériel":"Sera distribuée au début du semestre.",
      "Forme d'enseignement":"Atelier.",
      "Contenu":"Hyper-typologies.[br/]Voir MA1 - Dietz.[br/]",
      "Forme du contrôle":"Suivi continu, critiques intermédiaires (2) et jury final.",
      "Objectifs d'apprentissage":"[i]Hyper-typologies[/i] s'inscrit dans le cadre de CH16M2048, une plateforme de recherche initiée par ALICE (voir alice.epfl.ch > recherche > ch16m2048). Les étudiants s'engageront une recherche typologique couplée à une interrogation de la relation du corps et de la perception sensible à la production de stratégies spatiales et urbaines.[br/]S'appuyant sur les récits narratifs produits au premier semestre ([i]2048 - Une fiction architecturale[/i]), les étudiants devront : [br/][li]Analyser une série de typologies existantes - historiques et/ou contemporaines - du point de vue de leur contexte socio-culturel et des qualités spatiales qu'elles possèdent. [br/][li]Transposer les résultats de leur analyse dans l'élaboration de nouveaux types d'espaces d'interaction avec pour guide la prémisse suivante : réduire la consommation d'espace tout en proposant une qualité de vie et des conditions spatiales, sociales et économiques augmentées. [br/][li]Synthétiser ces nouveaux types pour former un projet cohérent, afin de questionner l'un des scénarios narratifs issus du précédent semestre avec pour objectif d'augmenter la densité et la diversité urbaine. [br/][li]Produire un projet architectural dans des conditions urbaines, partant de l'échelle du corps compris dans son environnement immédiat, et mettre en avant leur [i]vision architectonique[/i] pour un milieu de vie socialement et économiquement durable, à l'horizon temporel de 2048. [br/][li]Implémenter les données recueillies, leur analyse et les fragments narratifs dans un dispositif singulier, le Metamodel - interface de communication et artefact tangible permettant de tester et de mettre en commun les scénarios développés.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet MA2 (Dietz)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}