{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1578017320&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","401(f)"],
    "title":"Studio MA1 (Claus)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1578017320&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225185",
      "name":"Claus Felix"
    }],
    "lab":null,
    "credits":13,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"[b]Project IMMEUBLE ILOT to Paris[/b][br/]The design brief for the fall-semester will be for a compact Multi-functional building on a very specific site in Paris.[br/][br/]We will work in an open studio setting, each student individually responsible for the final design. Professor and assistants are available full-time for ad-hoc individual assistance. [br/]Bi-weekly formal critics are held where students have to present their progress in the various fields of the design (Site research, programmatic research, structural development, façade development with regards to both technological and aesthetic requirements etc.) Studio work is bi-lingual, critics are in English. Studio attendance is obligatory.[br/][br/]The elaboration on these quasi autonomous themes will enable the students to proceed in a relaxed yet concentrated manner, avoiding the pressure to produce \"architecture\". Eventually the integration of the aforementioned elements will lead to a synthesis in the project. A written report is part of the final presentation.[br/][br/]Main learning outcome will be to acquire a working attitude towards the brief, an attitude that allows to start working right away through the formulation of a wide variety of questions regarding the project. Students will experience the possibility to produce a maximum quality project in a disciplined and enjoyable manner.[br/][br/]Subsequent learning outcomes:[br/][br/][li]Write a scientific/technical report.[br/][li]Overcome initial problems and setbacks to work towards integrated solution.[br/][li]Multi-criterion analysis of design solutions subject to production conditions and restrictions.[br/][li]Formulate individual position in the face of irrational or possibly conflictions argumentation.[br/]"
    },
    "practical":null,
    "language":"English",
    "title":"Studio MA1 (Claus)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225185",
      "name":"Claus Felix"
    }],
    "lab":null,
    "credits":13,
    "semester":"Automne",
    "free_text":{
      "Objectifs d'apprentissage":"[b]Projet IMMEUBLE ILOT à Paris[/b][br/]Le sujet du semestre d'automne porte sur la conception d'un bâtiment multifonctionnel sur un site très spécifique à Paris.[br/][br/]Nous travaillerons avec un fonctionnement d'atelier ouvert, chaque étudiant individuellement responsable du projet final. Professeur et assistants seront disponible en permanence pour une assistance personnelle ad-hoc. [br/]Toutes les deux semaines auront lieu des critiques formelles où les étudiants devront présenter leur avancement dans les différents champs du projet (Analyse de site, recherche programmatique, principe structurel, conception de façade tant d'un point de vue technique qu'esthétique, etc.) L'atelier est bilingue, les critiques se tiennent en anglais. La présence à l'atelier est obligatoire.[br/][br/]L'élaboration de ces thèmes quasi-autonomes permettra aux étudiants d'avancer d'une façon à la fois détendue et concentrée, échappant ainsi à la pression de devoir produire de l'\"architecture\". Enfin, l'intégration de ces éléments entrainera une synthèse du projet. Un rapport écrit fera partie de la présentation finale.[br/][br/]À l'issue de cet atelier, l'objectif principal est d'acquérir une attitude de travail face au sujet, une attitude qui permet de se mettre immédiatement au travail par la formulation d'une large variétés de questions regardant le projet. Les étudiants auront la possibilité de produire un projet de qualité maximale de façon structurée et agréable.[br/][br/]Objectifs complémentaires :[br/][li]Écrire un rapport scientifique/technique.[br/][li]Dépasser les difficultés initiales et les contretemps pour travailler à une solution intégrée.[br/][li]Analyse à critères multiples des solutions de projet au regard des règlements et conditions de production.[br/][li]Formulation d'une prise de position individuelle face à des arguments irrationnels ou conflictuels.[br/][br/]"
    },
    "practical":null,
    "language":"English",
    "title":"Théorie et critique du projet MA1 (Claus)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}