{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1586850131&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","401(d)"],
    "title":"Studio MA1 (Dietz)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1586850131&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[["alice.epfl.ch","alice.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    }],
    "lab":null,
    "credits":13,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"According to its acronym, ALICE's main focus is space. Space constructed through artefacts and by the societies that produce them. Space as embodied experience.[br/]In the context of CH16M2048, a research platform initiated by ALICE, students will address the potential of \"architectural fiction\" as a projective tool and explore how fictional narratives can serve as programmatic grounds for the development of our collective built environment. [br/][br/]Students will:[br/][li]Analyse spatial artefacts in order to understand the relationship between human constructs (buildings, cities) and their production in society.[br/][li]Acquire basic techniques of cartography as projective, analytical and organisational tools.[br/][li]Invent, formulate and compose narrative fragments (through text and image), transpose these in a physical setting and construct a [i]scenographic space[/i], the central aim being to convey a [i]prospective vision[/i] for social cohabitation in Switzerland by the year 2048.[br/][li]Implement their findings, the result of their analysis and their fictional narrative into a singular device, the Metamodel, which will act as a communication interface, providing a tangible artifact upon which to test and share scenarios. ",
      "Content":"[i][b]2048: An Architectural Fiction[/b][/i][br/]This ALICE studio is conducted in parallel with the LABA master studio in the context of the CH16M2048 research project (see also: [i]alice.epfl.ch > research > ch16m2048). CH16M2048[/i] envisions a Switzerland with 16 million inhabitants by 2048 - a population only slightly larger than the one resulting from extrapolation of the demographic development of the Swiss population in the past three years.  [br/]In the fall semester of 2012 (1st semester) entitled 2048 - [i]An Architectural Fictio[/i]n, we will use imagination, scientific analysis and the potential of the visionary in order to produce a narrative and its [i]constructed[/i] setting.[br/]The second semester, [i]Hyper-typologies[/i], is based on research on typologies and feeding on the narratives developed in the first semester. It will interrogate the relationship of the body and human sensory perception in the production of urban spatial strategies.[br/]Based on the former findings, the fall semester of 2013 [i]Circle Lines[/i] will focus on the conception of architectural, urban or territorial apparatuses for creating new forms of urban cohabitation, in a sustainable perspective at the scale of the territory.[br/]ALICE offers the studio in a three semesters cycle. Students can enter the studio at any semester and pursue their studies within this framework for one or two semesters. A yearly implication is however strongly encouraged. The maximum number of students admitted is 10.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio MA1 (Dietz)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["alice.epfl.ch","alice.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    }],
    "lab":null,
    "credits":13,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Atelier.",
      "Contenu":"[b]2048 : Une fiction architecturale[/b][br/]Mené dans le cadre de CH16M2048 (voir aussi : [i]alice.epfl.ch > recherche > ch16m2048[/i]), et en parallèle à celui offert par le LABA, cet atelier s'ancre dans une vision de la Suisse comptant 16 millions d'habitants en 2048, une projection à peine plus élevée que celle suggérée par les extrapolations des trois dernières années concernant le développement démographique de la population Suisse.[br/]Au cours du semestre d'automne 2012 (1er semestre), intitulé 2048 - [i]Une fiction architecturale[/i], nous mettrons à profit imagination, analyse scientifique et le potentiel visionnaire de chacun afin de produire un récit narratif et son déploiement [i]construit[/i].[br/][i]Hyper-typologies[/i] (2ème semestre) consistera en une investigation axée sur la typologie. Prenant appui sur les récits narratifs du premier semestre, il s'agira d'interroger la relation du corps et de la perception sensible à la production de stratégies spatiales.[br/]Le semestre d'automne 2013 (3ème semestre) intitulé [i]Circle Lines[/i] mettra a profit les résultats précédents et abordera la conception de dispositifs architecturaux, urbains et territoriaux afin de créer de nouvelles formes de cohabitation urbaine, dans une perspective durable et à l'échelle du territoire.[br/]ALICE propose cet atelier selon un cycle de trois semestres. Les étudiants peuvent rejoindre l'atelier à n'importe quel semestre, et y poursuivre leurs études sur un ou deux semestres. Une participation sur une période d'une année est cependant fortement encouragée. Un maximum de 10 étudiants par semestre est admis.",
      "Forme du contrôle":"Suivi continu, critiques intermédiaires (2) et jury final.",
      "Bibliographie et matériel":"Sera distribué au début du semestre.",
      "Objectifs d'apprentissage":"Comme son acronyme le suggère, l'espace est au centre des préoccupations du laboratoire ALICE. Dans le contexte de CH16M2048, une plateforme de recherche initiée par ALICE, les étudiants aborderont la «fiction architecturale» en tant qu'outil de projet et exploreront comment le récit narratif peut servir de base programmatique au développement de notre environnement bâti. [br/]Les étudiants devront :[br/][li]Analyser une série d'artefacts spatiaux afin de comprendre la relation entre les constructions humaines (édifices, villes) et leur production dans un contexte de société.[br/][li]Acquérir les techniques de base de la cartographie (savoir dessiner et construire une carte) comme autant d'outils de projection, d'analyse et d'organisation.[br/][li]Inventer, mettre en forme et composer des fragments narratifs (par le biais de textes et d'images), transposer ces derniers dans une spatialité et construire un [i]espace scénographique[/i] avec pour objectif principal de mettre en forme, par une [i]vision prospective[/i] de cohabitation, ce que pourrait être la Suisse en 2048.[br/][li]Implémenter les données recueillies, leur analyse et les fragments narratifs dans un dispositif singulier, le Metamodel - interface de communication et artefact tangible permettant de tester et de mettre en commun les scénarios développés."
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet MA1 (Dietz)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}