{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1578017248&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","401(h)"],
    "title":"Studio MA1 (Hubmann & Vass)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1578017248&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225188",
      "name":"Hubmann Erich"
    },{
      "url":"http://people.epfl.ch/225187",
      "name":"Vass Andreas"
    }],
    "lab":null,
    "credits":13,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"[b]Preservation, rehabilitation and construction in an existing urbanized context[/b][br/][li]Individual observation and comprehension of a given context in integrality on site. Develop techniques to draw and communicate the observations in a powerful way.[br/][li]To understand the historic value of a built urban tissue and landscape through multidimensional analyses as an integral part of the project.[br/][li]To initiate a project by estimating the existing context, understanding the relation between architecture and the city and controlling the different scales of the existing and of the project.[br/][li]To render with legibility and rigor a concept and solution of the project by the production of models and graphic outputs.[br/][li]To lead its capacities to an integral architectural syntheses.[br/][br/]",
      "Content":"Under the title \"monuments and traces\" the studio aims to the learning of the observation, the analyses and the transformation of existing situations in the urban and landscape contexts. This capacity should be developed specifically in relationship with elements of the heritage that often provoke confrontational positions: Either by their stunning presence as monument, or by their physical absence almost completely lost in memory. [br/][br/]Starting from the construction in and with the existing we will experiment the (re)construction of the existing. The symbolic dimension and the designation of architecture to form a background for daily life will be put in relation in the project. "
    },
    "practical":null,
    "language":"English",
    "title":"Studio MA1 (Hubmann & Vass)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/225188",
      "name":"Hubmann Erich"
    },{
      "url":"http://people.epfl.ch/225187",
      "name":"Vass Andreas"
    }],
    "lab":null,
    "credits":13,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"[li]Vif intérêt pour la complexité de l'existant à l'échelle urbaine et paysagère.[br/][li]Capacités de synthèse, rigueur en projet et en représentation architecturale.[br/]",
      "Bibliographie et matériel":"Voir dossier annexé.",
      "Forme d'enseignement":"Lecture, visite du site / voyage d'étude, apports d'experts, cours théoriques, travail d'analyse et de projet, révisions et critiques.",
      "Contenu":"L'atelier vise, sous le titre de « monuments et traces », à l'apprentissage de l'observation, analyse et transformation de situations existantes dans des contextes urbains et paysagers. Cette capacité sera à acquérir spécifiquement en relation avec des éléments du patrimoine qui provoquent des prises de position souvent conflictuelles, soit à travers leur présence comme monuments inéluctables, soit à travers leur presque complète absence physique et leur condition amnésique. [br/][br/]Partant de la construction dans et avec l'existant s'expérimentera la (ré-)construction de l'existant. La dimension symbolique et la détermination de l'architecture à former le fond pour la vie quotidienne seront mises en relation dans le projet.",
      "Forme du contrôle":"Révisions régulières, rendus intermédiaires et final.",
      "Préparation pour":"Projet de master et activité professionnelle.",
      "Objectifs d'apprentissage":"[b]Sauvegarde, réhabilitation et construction dans un milieu construit existant[/b][br/][li]Observation individuelle de situations concrètes données; apprendre à transmettre ces annotations de manière claire et performante.[br/][li]Prendre conscience de la valeur du patrimoine bâti, urbain et paysager à travers l'analyse à plusieurs échelles comme partie intégrante du projet.[br/][li]Approcher le projet comme valorisation de l'existant en compréhension de la relation entre architecture et ville et avec contrôle des différentes échelles de l'existant et du projet.[br/][li]Représenter de manière lisible et rigoureuse des analyses, concepts et solutions du projet en forme de maquettes et produits graphiques.[br/][li]Reconduire ces capacités dans une synthèse architecturale intégrale.[br/][br/]"
    },
    "practical":null,
    "language":"English",
    "title":"Théorie et critique du projet MA1 (Hubmann & Vass)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}