{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1578017327&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","401(g)"],
    "title":"Studio MA1 (Gueissaz)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1578017327&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105324",
      "name":"Gueissaz Philippe"
    }],
    "lab":null,
    "credits":13,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"To acquire and develop basic knowledge of city forms and housing types stemming from the history of modernity and contemporary architecture.[br/]To analyse relationships between the built form and use of the buildings by reviewing housing layouts, how rooms are separated and grouped and façade outlooks. [br/]To classify activities in both individual and collective housing and explain, by analysing typological changes, the shifts in tolerance levels between these activities.[br/]To design the project as the construction of critical thinking to explain the reasons behind the form, from permanence to use-induced changes.[br/]To build the project as a patient search for architectural form to meet contemporary housing requirements, up to its materialization and expression on a 1/50 scale.[br/]",
      "Content":"The semester project will make up a pan of city on the small scale of a site in French-speaking Switzerland, to enable several interpretations of the form to be given to collective housing (urban form, type and image).[br/]It will serve to develop knowledge about housing through site visits and analysis of built examples. It will seek to address the housing problem through the project design process (site review, programme assessment, use of references, project idea, etc.).[br/]This is an individual project whereas example analysis will be conducted in parallel in groups of 2-3 students.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Studio MA1 (Gueissaz)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105324",
      "name":"Gueissaz Philippe"
    }],
    "lab":null,
    "credits":13,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Cours théoriques, visite et études d'exemples, présentations et séminaires sur le logement Collectif, critiques à la table et critiques d'atelier.[br/]",
      "Contenu":"Le projet du semestre constituera un morceau de ville, à la petite échelle d'un site en suisse romande qui permettra plusieurs interprétations de la forme à donner au logement collectif (forme urbaine, type et image). [br/]Il permettra de développer des connaissances sur le logement par la visite et l'analyse d'exemples construits. Il cherchera à répondre au problème du logement à travers la démarche d'un projet (lecture du site, mesure du programme, utilisation de références, idée de projet).[br/]Ce projet est un travail individuel alors que l'analyse d'exemples se fera en parallèle, par groupes de 2-3 étudiants.[br/]",
      "Forme du contrôle":"20% Analyse d'exemples: contenu et présentation.[br/]30% Contrôle continu: conception du projet.[br/]50% Jury final: présentation critique du projet.[br/]",
      "Objectifs d'apprentissage":"Acquérir et développer les connaissances de base sur les formes de villes et les types de l'habitation appartenant à l'histoire de la modernité et à l'architecture contemporaine.[br/]Analyser les relations entre forme construite et usage, à travers la disposition des maisons, la séparation et le groupement des pièces, l'expression des façades. [br/]Classer les activités du logement, individuelles et collectives, et expliquer par l'analyse des modifications typologiques, le glissement des seuils de tolérance entre ces activités.[br/]Concevoir le projet comme la construction d'une pensée critique qui explicite les raisons de la forme, entre permanence et modification dues à l'usage. [br/]Construire le projet comme recherche patiente de la forme architecturale pour l'usage contemporain de l'habitation, jusque dans sa matérialisation et son expression à l'échelle du 1/50.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Théorie et critique du projet MA1 (Gueissaz)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":4,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}