{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348698790&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","410"],
    "title":"Visual arts and architecture II",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348698790&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/206746",
      "name":"Sacconi Maria Gabriella"
    }],
    "lab":null,
    "credits":3,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"At the end of the course Visual Arts and Architecture I the student will know how to:[br/][br/][li]Identify, describe and name the constituent elements of works of art.[br/][li]Identify the historical context of the works (artistic movement, group or genre).[br/][li]Analyse and understand the issues involved in the writings of artists so as to detect the major points.[br/][li]Analyse and understand the issues involved in the critical texts relating to the works, artistic genres or historical movements so as to detect the major points.[br/][li]Develop a pertinent theoretical link between works and critical texts.[br/][li]Enhance the body of work provided through personal research.[br/]",
      "Content":"The course Visual Arts and Architecture II will address the following general themes: the site and the monument.[br/][br/]These two motifs were central in the debate on sculptural practice and its public dimension in the 20th century. We will dwell on works that figure today in the movements (or attitudes) of the enlarged space of sculpture: [i]In Situ, Site Specific, Earthworks and Land Art[/i]. We will see how the works integrate, amplify or articulate their relation to the natural, constructed, historical, social or institutional context."
    },
    "practical":null,
    "language":"Français",
    "title":"Visual arts and architecture II",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/206746",
      "name":"Sacconi Maria Gabriella"
    }],
    "lab":null,
    "credits":3,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Aucun.",
      "Bibliographie et matériel":"Bibliographie et textes critiques sur moodle.epfl (art et architecture II).",
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"Le cours Arts visuels et Architecture II abordera les motifs généraux suivants : le site et le monument.[br/][br/]Ces deux motifs furent centraux dans le débat sur la pratique sculpturale et sa dimension publique au 20ème siècle. Nous marquerons des arrêts sur des oeuvres inscrites aujourd'hui dans les mouvements (ou les attitudes) de l'espace élargi de la sculpture : [i]In Situ, Site Specific, Earthworks et Land Art[/i]. Nous verrons comment les oeuvres intègrent, amplifient ou articulent leur rapport au contexte naturel, bâti, historique, social ou institutionnel.[br/]",
      "Forme du contrôle":"Examen écrit fin de semestre.",
      "Objectifs d'apprentissage":"A l'issue du cours Arts visuels et Architecture II l'étudiant saura :[br/][br/][li]Identifier, décrire et nommer les éléments constitutifs des oeuvres d'art.[br/][li]Identifier le contexte historique des oeuvres (mouvement, groupe ou genre artistique).[br/][li]Analyser et saisir les enjeux des écrits des artistes afin d'en déduire les lignes de force.[br/][li]Analyser et saisir les enjeux des textes critiques en lien avec les oeuvres, les genres artistiques ou les mouvements historiques afin d'en déduire les lignes de force.[br/][li]Elaborer un lien théorique pertinent entre oeuvres et textes critiques.[br/][li]Augmenter le corpus donné par des recherches personnelles.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Arts visuels et architecture II",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}