{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348698847&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","419"],
    "title":"Visual arts and architecture I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348698847&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/206746",
      "name":"Sacconi Maria Gabriella"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"At the end of the course Visual Arts and Architecture I the student will know how to:[br/][li]Identify, describe and name the constituent elements of works of art.[br/][li]Identify the historical context of the works (artistic movement, group or genre).[br/][li]Analyse and understand the issues involved in the writings of artists so as to detect the major points.[br/][li]Analyse and understand the issues involved in the critical texts relating to the works, artistic genres or historical movements so as to detect the major points.[br/][li]Develop a pertinent theoretical link between works and critical texts.[br/][li]Enhance the body of work provided through personal research.[br/]",
      "Content":"The course Visual Arts and Architecture I will consider works of art and exhibitions that have marked their contribution to the avant-garde movements of the 20th century in a break with current practice. It will focus on modern works that have anticipated the event qualities of the exhibition as well as on today's critical relation between exhibition and event.[br/][br/]When the «exposure» becomes an inseparable element of the «implementation», it is possible to identify new strategies in terms of space, time and medium. We will also examine exhibitions of which the artists have been the curators or those whose curators have suggested new cultural paradigms.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Visual arts and architecture I",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/206746",
      "name":"Sacconi Maria Gabriella"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"Aucun.",
      "Bibliographie et matériel":"Bibliographie et textes critiques sur moodle.epfl (art et architecture I).",
      "Mots clés":"Arts visuels, mise en oeuvre, espace public.",
      "Forme d'enseignement":"Cours ex-cathedra.",
      "Contenu":"Le cours Arts visuels et Architecture I considérera des oeuvres d'art et des expositions lorsque celles-ci ont marqué, par un geste de rupture, leur contribution aux mouvements d'avant-garde au 20ème siècle. Il mettra l'accent sur des oeuvres modernes qui ont su préfigurer la dimension événementielle de l'exposition ainsi que sur la relation aujourd'hui incontournable entre exposition et événement.[br/][br/]Lorsque la « mise en vue » devient un élément indissociable de la «mise en oeuvre», il est possible d'identifier des stratégies nouvelles en termes d'espace, de temps ou encore de médium. Nous nous arrêterons également sur des expositions dont les artistes ont été les commissaires ou celles dont les commissaires ont su proposer de nouveaux paradigmes culturels.[br/]",
      "Forme du contrôle":"Examen écrit fin de semestre.",
      "Objectifs d'apprentissage":"A l'issue du cours Arts visuels et Architecture I, l'étudiant saura :[br/][br/][li]Identifier, décrire et nommer les éléments constitutifs des oeuvres d'art.[br/][li]Identifier le contexte historique des oeuvres des artistes afin d'en déduire les lignes de force.[br/][li]Analyser et saisir les enjeux des textes critiques en lien avec les oeuvres, les genres artistiques ou les mouvements historiques afin d'en déduire les lignes de force.[br/][li]Elaborer un lien théorique pertinent entre oeuvres et textes critiques.[br/][li]Augmenter le corpus donné par des recherches personnelles.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Arts visuels et architecture I",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}