{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348621857&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","413"],
    "title":"UE H : Graphy I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348621857&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/104996",
      "name":"Duboux Charles"
    },{
      "url":"http://people.epfl.ch/183544",
      "name":"Metraux Raynald"
    },{
      "url":"http://people.epfl.ch/106786",
      "name":"Zufferey Marie-Pierre"
    }],
    "lab":null,
    "credits":6,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"With this course you will:[br/][li]Discover and experiment multiple techniques of graphic tools to present and represent architecture,[br/][li]Exercise the major skill of communicating and expressing yourself (through drawing in its widest sense),[br/][li]By developing bodily skills and cultural knowledge at the root of creativity - through repeated practice of eye/hand/brain connections, through a reflection on the history and theories of representation and by searching for inventive solutions. [br/]",
      "Content":"The course is structured around contributions regarding the history and theory of representation as well as practical to experiment, as specifically as possible and in a spirit of mixed media, several architectural representation techniques such as e.g. drawing, color, engraving in relief (on wood, plastic, linoleum), embossing, intaglio engraving (engraving, dry-point, etching or aquatint), stone engraving and drawing (lithography), screen printing, photography and computer graphics. [br/][br/]In autumn 2012, in partnership with the Cultural Affairs Department of Lausanne University, the Graphic Expression UE will be devoted to stage design: the play \"[i]Opus incertum[/i]\" will be performed in 2013 on the stage of [i]La Grange de Dorigny[/i], where a selection of practical works completed during the course will be exhibited in February and March. This will provide an occasion to experiment a technique of engraving in relief, an intaglio engraving technique, a lithograph and a stone engraving or cutting. [br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE H : Graphy I",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-88074-844-9&amp;con_lng=ENG\" target=\"blank\">Le dessin comme langage / Charles Duboux</a>\". Year:2009. ISBN:978-2-88074-844-9</li></ul>",
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/104996",
      "name":"Duboux Charles"
    },{
      "url":"http://people.epfl.ch/183544",
      "name":"Metraux Raynald"
    },{
      "url":"http://people.epfl.ch/106786",
      "name":"Zufferey Marie-Pierre"
    }],
    "lab":null,
    "credits":6,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Cours. Travaux pratiques.",
      "Contenu":"Le cours est structuré entre plusieurs apports d'histoire et théorie de la représentation et des travaux pratiques où sont expérimentées au mieux de leurs spécificités et dans un esprit de médias mixtes plusieurs techniques de représentation de l'architecture comme par exemple : les techniques de dessin, de la couleur, la gravure en relief (sur bois, plastique, linoléum), le gaufrage, la gravure en creux (comme le burin, la pointe-sèche, l'eau-forte ou l'aquatinte), la gravure et le dessin sur pierre (lithographie), la sérigraphie, la photographie et l'infographie.[br/][br/]En automne 2012, en partenariat avec les affaires culturelles de l'Université de Lausanne, l'UE Graphie aura pour thème une scénographie : la pièce \"[i]Opus incertum[/i]\" sera jouée en 2013 à la grange de Dorigny où sera exposé aux mois de février et mars un choix de travaux pratiques réalisés durant le cours. Pour l'occasion seront expérimentées une technique de gravure en relief, une technique de gravure en creux, une lithographie et une gravure ou taille de la pierre.[br/]",
      "Forme du contrôle":"Evaluation formative non notée : à la demande et en tout temps des travaux pratiques.[br/]Evaluation certificative notée : sur les travaux pratiques réalisés et une défense orale en fin de cours.[br/]Note : 60% travaux pratiques, 40 % oral.[br/]",
      "Bibliographie et matériel":"Duboux Charles, [i]Le dessin comme langage[/i], Lausanne, PPUR, 2009, pp. 117-119.",
      "Objectifs d'apprentissage":"[li]découvrir et expérimenter la polytechnie des moyens graphiques de présentation et représentation de l'architecture,[br/][li]exercer la compétence principale de communiquer et s'exprimer (par le dessin pris dans son sens large),[br/][li]en développant des capacités corporelles et des connaissances culturelles gage de créativité : par une pratique répétée exerçant les relations oeil, main, cerveau; par une réflexion sur l'histoire et les théories de la représentation; par la recherche de solutions inventives.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE H : Graphie I",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-88074-844-9&amp;con_lng=FRE\" target=\"blank\">Le dessin comme langage / Charles Duboux</a>\". Année:2009. ISBN:978-2-88074-844-9</li></ul>",
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  }
}