{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=24174884&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","424"],
    "title":"History of architecture VIII",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=24174884&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229919",
      "name":"Maniaque Caroline"
    }],
    "lab":null,
    "credits":3,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"[b]From professionalism to the counterculture: the 'American model' and its European reception after 1950[/b][br/][br/]The course aims to introduce students to a post war architectural history from the point of view of transatlantic exchanges that range from constructional techniques to the spread of information. The course will enable students to understand how the agents of such communication operate (study trips, university courses, professional journals, etc.) and to analyze their consequences on architectural education and practice. The main centers of architectural education in the USA will be studied, as well as the discourses underpinning their educational programs. [br/][br/]The aim is to follow the intellectual journeys of certain European architects between 1950 and 1970. This will also require an understanding of how these American institutions welcomed European architects and what the issues were. What roles did governments play in these bi-lateral exchanges? What roles did the architectural journals play in the spreading of architectural practices? The analysis of printed materials - text and image - will be required to grasp the mechanisms of communication and reception of architectural ideas. The teaching will focus both on professional architecture and alternative practices. ",
      "Content":"Professional and popular architectural cultures in America and the reception of these cultures in Europe. On the professional side, we will look at the impact of architects like Wright, Neutra, Mies, Gropius, Saarinen, Kahn and Moore. We will also look at how Bernard Rudofsky, Bruce Goff, Buckminster Fuller, Steve Baer, Sim van der Ryn and others were perceived in Europe."
    },
    "practical":null,
    "language":"Français",
    "title":"History of architecture VIII",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229919",
      "name":"Maniaque Caroline"
    }],
    "lab":null,
    "credits":3,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Cours ex cathedra.",
      "Contenu":"Culture architecturale savante et culture architecturale populaire et alternative en Amérique et réception de ces cultures en Europe. On verra comment Wright, Neutra, Mies, Gropius, Saarinen, Kahn, Moore d'une part,  et d'autre part,  Bernard Rudofsky, Bruce Goff, Buckminster Fuller, Steve Baer, Sim van der Ryn, entre autres, ont été perçus en Europe.",
      "Forme du contrôle":"Examen oral de fin de semestre.",
      "Bibliographie et matériel":"Banham, Reyner, [i]A Concrete Atlantis: U.S. Industrial Buildings and European Architecture[/i], 1900-1925, Cambridge (Mass.), MIT Press, 1986.[br/]Cody, Jeffrey W., [i]Exporting American Architecture, 1870-2000[/i], Londres, Routledge, 2002.[br/]Cohen, Jean-Louis, [i]Scènes de la vie future : les architectes européens et la tentation de l'Amérique 1893-1960[/i], Paris, Flammarion/Montréal, Centre Canadien d'architecture, 1995.[br/]De Grazia, Victoria, [i]Irresistible Empire : America's Advance Through Twentieth-Century Europe[/i], Cambridge (Mass.), Belknap Press of Harvard University Press, 2005.[br/]Fraser, Murray, et Kerr, Joe, [i]Architecture and the \"special Relatsionship\": the American Influence on Post-War British Architecture[/i], Londres-New York, Routeldge, 2007.[br/]Ibelings, Hans, [i]Americanism : Dutsch Architecture and the Transatlantic Model[/i], Rotterdam, NAI Publishers, 1997.[br/]",
      "Objectifs d'apprentissage":"[b]De la culture savante à la culture alternative : le « modèle » nord-américain et sa réception européenne après 1950 [/b][br/][br/]Le cours vise à introduire les étudiants à une histoire de l'architecture de l'après seconde guerre mondiale, vue à partir des circulations transatlantiques, tant en terme de techniques constructives qu'en terme de diffusion d'information. Le cours vise à fournir les instruments pour comprendre les mécanismes des échanges (voyages d'étude, cycle universitaire, revues professionnelles, etc.) et en analyser les conséquences sur l'éducation de l'architecte et sur les pratiques. On pourra connaître les centres principaux de l'enseignement de l'architecture en Amérique du Nord et les discours sous-jacents à ces programmes.[br/][br/] [br/]L'objectif est de suivre les parcours physiques et intellectuels des architectes européens des années 1950 à 1970. On dégagera ainsi les objectifs des institutions facilitant l'accueil des européens et on observera les mécanismes d'échanges croisés. Quels rôles vont jouer les gouvernements dans ces échanges bilatéraux ? Quels rôles vont avoir les revues d'architecture pour la diffusion des pratiques architecturales ?  Il s'agira d'analyser des documents imprimés -textes et images- pour comprendre le mécanisme de la diffusion des idées architecturales. Une autre visée de l'enseignement porte à s'intéresser à l'architecture dite savante autant qu'à l'architecture 'alternative'. "
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de l'architecture VIII",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}