{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=837370792&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","420"],
    "title":"UE C: Architecture and Archeology",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=837370792&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/171020",
      "name":"Barone Maria Chiara"
    },{
      "url":"http://people.epfl.ch/113297",
      "name":"Ortelli Luca"
    }],
    "lab":null,
    "credits":6,
    "semester":null,
    "free_text":{
      "Learning outcomes":"[b]The Roman city of Aventicum (Avenches). Preservation and exploitation of the finds; design of an archaeological park.[/b][br/][br/]The course aims to stimulate and promote the interest in the issues regarding the relationships between architecture and archaeology, and it strengthens the ability to realize a suitable architectural intervention in an archaeological context. Basing both on the theory and on a series of examples, the course will provide the instruments to define the guidelines for an architectural project in an archaeological site. The goal is to explore the objectives and the modalities of the implementation of an archaeological park in the Roman city of Aventicum (Avenches). Several types of interventions (museographic, in the restoration, in the protection of the excavations) may also be included in the overall project.[br/][br/]The student will be able to: [br/][br/]Propose a suitable architectural intervention in an archaeological context and verify its feasibility;[br/]Write a report and present the project;[br/]Explore the objectives and the modalities of the implementation of the archaeological project;[br/]Co-ordinate the different propositions inside the same archaeological site;[br/]Face the problems concerning the relation between architecture and archaeology.[br/]",
      "Content":"[li]Presentation of the general issues regarding the relationship between architecture and archeology;[br/][li]Explanation and discussion of exemplary projects realized in an archaeological context;[br/][li]Presentation of the site of the Roman city of Aventicum (Avenches) and study of the framework of the project;[br/][li]Hypothesis of intervention finalized to preserve and exploit the finds in Aventicum and to design the archaeological park.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE C: Architecture and Archeology",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/171020",
      "name":"Barone Maria Chiara"
    },{
      "url":"http://people.epfl.ch/113297",
      "name":"Ortelli Luca"
    }],
    "lab":null,
    "credits":6,
    "semester":null,
    "free_text":{
      "Contenu":"[li]Présentation des problématiques générales du rapport entre architecture et archéologie;[br/][li]Illustration et discussion de projets exemplaires réalisés en contexte archéologique;[br/][li]Présentation du site de la ville romaine d'Aventicum (Avenches) et encadrement du projet;[br/][li]Hypothèse d'intervention finalisée à conserver et mettre en valeur les vestiges d'Aventicum et à aménager un parc archéologique.[br/]",
      "Bibliographie et matériel":"Bursian C., [i]Aventicum Helvetiorum[/i], Zurich, 1867. [br/]Secrétan E., [i]Aventicum, son passé et ses ruines[/i], Lausanne, 1896 (1919[sup]3[/sup]). [br/]Dunant E., [i]Guide illustré du Musée d'Avenches[/i], Genève, 1900. [br/]Schwarz G. Th., [i]Die Kaiserstadt Aventicum[/i], Bern/München, 1964. [br/]Bögli H., «[i]Aventicum[/i]. Zum Stand der Forschung», [i]Bonner Jahrbücher[/i] 172, 1972, 175-184.[br/]Frei-Stolba R., «Die römische Schweiz: Ausgewählte staats- und verwaltungsrechtliche Probleme im Frühprinzipat», in: [i]Aufstieg und Niedergang der römischen Welt[/i] II, 5, 1, Berlin/New York, 1976, 384-403. [br/]Bögli H., [i]Aventicum. La ville romaine et le Musée (Guides archéol. de la Suisse 19[/i]), Avenches, 1996[sup]3[/sup].[br/]Flutsch L., «[i]Aventicum[/i] et l'Helvétie romaine»,[i] Dossiers d'archéologie [/i]333 (Neuchâtel. Le Laténium. Parc et musée d'archéologie), mai-juin 2009, 62-69. [br/]de Pury-Gysel A., «[i]Aventicum[/i] (Avenches), Capital of the [i]Helvetii[/i]: A History of Research» , 1985-2010. Part I. Early Roman [i]Aventicum[/i] and its Origins», [i]Journal of Roman Archaeology[/i] 24, 2011.1, 7-46. [br/][br/]",
      "Objectifs d'apprentissage":"[b]La ville romaine d'Aventicum (Avenches). Conservation et mise en valeur des vestiges; aménagement d'un parc archéologique[/b][br/][br/]L'Unité d'enseignement vise à stimuler et promouvoir l'intérêt pour les problématiques relatives au rapport entre architecture et archéologie ainsi que la capacité d'intervenir de façon appropriée dans un contexte archéologique. A partir d'une base théorique et d'une série d'exemples, l'Unité d'enseignement fournira les instruments pour définir les lignes directrices d'un projet d'architecture à l'intérieur d'un site archéologique. Le but est d'explorer les objectifs et les modalités de réalisation d'un parc archéologique dans la ville romaine d'Aventicum (Avenches). Plusieurs types d'interventions (muséographiques, de restauration, de protection des fouilles) pourront également être incluses dans le projet d'ensemble.[br/][br/]L'étudiant sera capable de[br/][br/]Proposer une intervention architecturale dans un site archéologique et en vérifier la faisabilité;[br/]Documenter et communiquer le projet;[br/]Explorer les objectifs et les modalités de réalisation du projet; [br/]Coordonner les différentes propositions à l'intérieure du même site archéologique;[br/]Se confronter aux problématiques relatives aux rapports entre architecture et archéologie. [br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE C : Architecture et archéologie",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  }
}