{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=837377856&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","431"],
    "title":"Construction and sustainability VII",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=837377856&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[["www.tsam.epfl.ch","www.tsam.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/161950",
      "name":"Graf Franz"
    },{
      "url":"http://people.epfl.ch/171093",
      "name":"Marino Giulia"
    },{
      "url":"http://people.epfl.ch/104348",
      "name":"Zurbrügg Peter"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"The course has two aims. To begin with, it will trace the evolution of the constructional systems characteristic of C20th architecture, dealing with key notions such as new materials, industrialisation of the building sector and how it transformed the process of building, and the artificial control of building services and comfort. This multidisciplinary knowledge calls for both historical research and detailed consideration of materials technology and construction practice as well as economic and environmental aspects.[br/][br/]Critical-historical research and material analysis, in terms of the specific constructional identity of C20 architecture, demand ad hoc preservation strategies, drawing on specific types of expertise . Creating design tools - for both theory and practice - that take account of the particular issues surrounding modern heritage conservation, is the second major objective of the course.[br/][br/]Recent interventions to modern and contemporary built heritage, picked out as representative examples for study, are examined from documentation gathered during the semester. The student should be able to clearly identify the heritage values of objects (architectural value, technical value, social value, etc.), engage with the challenges posed by the conservation project, and give an assessment of the proposed interventions.",
      "Content":"The course series will incorporate a theoretical introduction to the history of construction technology and conservation project design.[br/][br/]Relations between materiality and heritage value in both exceptional and more mundane buildings will also be analysed, alongside restoration or adaptation of twentieth-century buildings and an introduction to nineteenth-century and rural heritage.[br/][br/]There will be an introduction to research methods and sources for monograph studies to enable participants to achieve the standard of analytical work required for successful completion.[br/]The course will also feature one or more visits to interesting sites.[br/][br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Construction and sustainability VII",
    "recitation":{
      "week_hours":1,
      "weeks":12
    },
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["www.tsam.epfl.ch","www.tsam.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/161950",
      "name":"Graf Franz"
    },{
      "url":"http://people.epfl.ch/171093",
      "name":"Marino Giulia"
    },{
      "url":"http://people.epfl.ch/104348",
      "name":"Zurbrügg Peter"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Bibliographie et matériel":"Graf F., Delemontey Y. (dir.), [i]L'architecture industrialisée du XXe siècle et ses problématiques de sauvegarde[/i], Lausanne, Presses polytechniques et universitaires romandes, 2012. Graf F., Marino G. (dir.),[i] La cité du Lignon 1963-1971 - étude architecturale et stratégies d'intervention[/i], cahier hors série de la revue Patrimoine et architecture, Gollion, Infolio, 2012. Graf F., Albani F. (dir.), [i]The Glass in the 20th Century Architecture : Preservation and Restoration[/i], Mendrisio, Mendrisio Academy Press, 2011. Marino G., [i]Un Monument historique controversé : la Caisse d'Allocations Familiales du XVe arr. à Paris - 1953-2008[/i], Éditions Picard, Paris 2009. Graf F., « Quelle histoire pour le projet de sauvegarde ? Pour une histoire matérielle du bâti moderne et contemporain », [i]Patrimoine et architecture[/i], n. 10-11, pages 40 - 46, Direction du Patrimoine et des Sites, DAEL, Genève, Canton de Genève, 2001.",
      "Mots clés":"Sauvegarde, patrimoine du XXe siècle, confort et énergie, techniques de construction, valeur patrimoniale.",
      "Forme d'enseignement":"Présentation et analyse critique d'une intervention dans un patrimoine identifié. Travail en groupe de 2 ou 3 étudiants. Présentation orale sur la base de la documentation recueillie pendant le semestre (plans, photographies, entretiens, dessins, etc.).",
      "Contenu":"La série de cours sera constituée d'une introduction théorique sur l'histoire des techniques constructives et le projet de sauvegarde. [br/][br/]Ensuite seront analysées les relations entre la matérialité et la valeur patrimoniale des bâtiments exceptionnels ou ordinaires, le bâti du XX siècle et sa restauration et/ou transformation ainsi qu'une introduction au patrimoine du XIX siècle et au patrimoine rural.[br/][br/]Une introduction aux méthodes et sources de l'étude monographique sera organisée de manière mener le travail d'analyse requis pour le contrôle.[br/]Une ou plusieurs visites de chantiers remarquables sont prévues.",
      "Forme du contrôle":"Examen sous forme de jury lors d'une présentation des travaux à l'ensemble des étudiants.",
      "Objectifs d'apprentissage":"Le cours répond à un double objectif. Il s'agit en premier lieu de retracer l'évolution des systèmes constructifs qui ont marqué l'architecture du XXe siècle, en abordant notions clé comme les nouveaux matériaux, les transformations du chantier moderne par l'introduction de procédés industrialisés, ou encore les dispositifs du contrôle artificiel du confort. Cette connaissance - multidisciplinaire - convoque aussi bien la réflexion historique que les techniques des matériaux et de leur mise en oeuvre, ainsi que les données économiques et environnementales. [br/][br/]L'histoire critique et l'analyse matérielle du bâti du XXe siècle, par sa spécificité constructive, oblige à développer des stratégies de sauvegarde ad hoc, étudiées avec un savoir faire spécifique. La mise en place d'outils de projet - théoriques et opérationnels - prenant en compte les enjeux du patrimoine moderne, constitue le deuxième objectif du cours.[br/][br/]Des interventions récentes sur le patrimoine bâti moderne et contemporain, choisies par leur caractère représentatif, seront analysées à partir de la documentation rassemblée pendant le semestre. L'étudiant devra être en mesure d'identifier clairement la valeur patrimoniale des objets (architecturale, technique, sociale, etc.), saisir les enjeux du projet de sauvegarde et se prononcer sur les interventions proposées."
    },
    "practical":null,
    "language":"Français",
    "title":"Construction et durabilité VII",
    "recitation":{
      "week_hours":1,
      "weeks":12
    },
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}