{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1494716829&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","440"],
    "title":"UE K : Architecture and Sustainability : performance studies",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1494716829&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/103938",
      "name":"Andersen Marilyne"
    },{
      "url":"http://people.epfl.ch/176663",
      "name":"Attia Shady Galal Mohamed"
    },{
      "url":"http://people.epfl.ch/108031",
      "name":"Bolomey Dan-Alexis"
    },{
      "url":"http://people.epfl.ch/126378",
      "name":"Lufkin Sophie"
    },{
      "url":"http://people.epfl.ch/103324",
      "name":"Rey Emmanuel"
    }],
    "lab":null,
    "credits":6,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"This course articulates itself around a detailed design and analysis exercise of the climate-responsiveness and energy-efficiency of a building's envelope. This exercise resorts to several assessment methods, of which the students will have to master the principles and use, with a particular emphasis on a range of simulation tools of variable complexity. The students will be able to integrate several environmental criteria together with performance objectives and the theories behind a resource-efficient and sustainable structure in the design process of a building's façade. They will thus be asked to explore different ways of modeling and assessing performance within this integration context. Emphasis will notably be placed on energy and response to climate, on occupant visual and thermal comfort and on the adequate use of materials and sustainable construction technologies.",
      "Content":"The course is organized around an in-depth design and analysis process conducted by teams of students. Starting from an existing plan and from functional as well as performance objectives, the students are asked to re-think a building's envelope according to a sequence of design stages (design, study, drawing, simulation). This sequence allows them to apply bio-climatic concepts and provide a more specific critical view on a building - and in particular on its performance and envelope. [br/][br/]Topics that are particularly emphasized include: [br/][li]Climate-responsive strategies[br/][li]Energy-efficiency[br/][li]Sustainable Façade Technologies[br/][li]Lighting, Heating, Ventilation[br/][li]Human Comfort.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE K : Architecture and Sustainability : performance studies",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/103938",
      "name":"Andersen Marilyne"
    },{
      "url":"http://people.epfl.ch/176663",
      "name":"Attia Shady Galal Mohamed"
    },{
      "url":"http://people.epfl.ch/108031",
      "name":"Bolomey Dan-Alexis"
    },{
      "url":"http://people.epfl.ch/126378",
      "name":"Lufkin Sophie"
    },{
      "url":"http://people.epfl.ch/103324",
      "name":"Rey Emmanuel"
    }],
    "lab":null,
    "credits":6,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Cours théorique. Exercices. Séminaires. Travaux de groupe (conception et évaluation/analyse d'un projet de façade à vocation bio-climatique). Ce cours est enseigné de manière conjointe avec le programme doctoral EDAR (orientation IDEAS, voir http://ideas.epfl.ch) et se positionne dans ce contexte comme la suite d'un premier module d'analyse de la durabilité en architecture dans une perspective de recherche (cours EDAR \"Architecture et durabilité: approches critiques\", semestre d'automne).",
      "Contenu":"Ce cours s'organise autour d'un processus de conception et d'analyse approfondie, réalisé par les étudiants en travail d'équipe. En se basant sur un plan existant et sur des objectifs à la fois fonctionnels et de performance, les étudiants sont amenés à repenser l'enveloppe d'un bâtiment selon une séquence d'étapes (conception, étude, dessin, simulation). Cette séquence leur permet d'appliquer des concepts bio-climatiques et de durabilité ainsi que de porter un regard critique plus spécifique sur un bâtiment - et en particulier sur ses perfomances et son enveloppe. [br/][br/]Les sujets étudiés en particulier sont :[br/][li]Les stratégies de réponse au climat[br/][li]L'efficacité énergétique[br/][li]Les technologies de façade durable[br/][li]L'éclairage, le chauffage et la ventilation[br/][li]Le confort des occupants.[br/]",
      "Forme du contrôle":"Critiques à la table (30% de la note).  Préparation et présentation orale d'un dossier de synthèse (rendu final, 70% de la note).",
      "Objectifs d'apprentissage":"Ce cours s'articule autour d'un exercice de conception et d'analyse détaillée de l'adaptabilité climatique et de l'efficacité énergétique de l'enveloppe d'un bâtiment. Cet exercice fait appel à plusieurs méthodes d'évaluation dont les étudiants devront maîtriser les principes et l'utilisation, avec un accent particulier mis sur une gamme d'outils informatiques de complexité variable. Les étudiants devront être à même d'intégrer plusieurs critères environnementaux, des objectifs de performance ainsi que les concepts inhérents à un bâtiment durable dans un processus de conception d'une façade. Ils seront ainsi amenés à explorer différentes approches de modélisation et d'évaluation de performance dans cette intégration. L'accent sera notamment mis sur l'énergétique et la réponse au climat, le confort visuel et thermique des occupants, et sur l'utilisation adéquate de matériaux et de technologies durables de la construction.  "
    },
    "practical":null,
    "language":"Français",
    "title":"UE K : Architecture et durabilité : études de performances",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  }
}