{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1777227&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","458"],
    "title":"City and mobility",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1777227&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-DEV-TER",
    "program":"AR",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/102121",
      "name":"Kaufmann Vincent"
    },{
      "url":"http://people.epfl.ch/169469",
      "name":"Louvet Nicolas"
    }],
    "lab":null,
    "credits":3,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"In the past two decades, urban mobility has changed considerably. The number of leisure trips has risen while the percentage of work-related trips has dropped. At the same time, new forms of mobilities have developed, such as multiple dwellings, long-distance commuting, urban tourism and excursionism. These changes have been simultaneous with phenomena like urban sprawl and fragmentation.[br/][br/]In this context, mobility is a challenge for urban transportation engineering and regional development, especially urban, as regulating it requires a new understanding of the transportation demand.  [br/]This course targets three main objectives:[br/]1) to describe the recent changes in urban mobility in Europe,[br/]2) To understand how the city, region and mobility co-construct one another,[br/]3) To assess the potential for regulating mobility based on supply (in terms of infrastructures and services) and in particular of causing a modal shift from the automobile to other modes of transportation. [br/][br/]It thus shows students the interrelationships between the city and mobility and between urban spaces and travel flows while offering them a renewed vision of transportation and its impact on areas and lifestyles. ",
      "Content":"The sessions will be organized in two parts: 1) a theoretical and conceptual presentation of recent changes in mobility, and 2) the presentation of research or studies on the session theme. This dual positioning offers students stable conceptual content and at the same time allows them to get a better handle on the research currently being done.[br/][br/]The sessions will deal with issues of defining mobility, measuring tools and knowledge of mobility and movement, renewed approaches in terms of modal choice, the links between mobility and urban lifestyles, and finally public action in the area of mobility.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"City and mobility",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-88074-769-5&amp;con_lng=ENG\" target=\"blank\">Les paradoxes de la mobilité : bouger, s'enraciner / Vincent Kaufmann</a>\". Year:2008. ISBN:978-2-88074-769-5</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-84446-228-2&amp;con_lng=ENG\" target=\"blank\">Mobilité sans racines : plus loin, plus vite... plus mobiles / sous la dir. de Stéphanie Vincent-Geslin ... [et al.]</a>\". Year:2012. ISBN:978-2-84446-228-2</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/102121",
      "name":"Kaufmann Vincent"
    },{
      "url":"http://people.epfl.ch/169469",
      "name":"Louvet Nicolas"
    }],
    "lab":null,
    "credits":3,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Bonne connaissance du Français.",
      "Bibliographie et matériel":"[b]Lectures obligatoires[/b]. [br/]Kaufmann Vincent, [i]Les paradoxes de la mobilité[/i], Lausanne : Presses Polytechniques et Universitaires Romandes, 2008.[br/]Vincent-Geslin Stéphanie et Kaufmann Vincent (dir.), [i]Mobilité sans racine[/i], Paris : Descartes et Cie, 2012.",
      "Forme d'enseignement":"Cours ex-cathedra, exercice empirique.",
      "Contenu":"Les séances s'organisent en deux temps : (1) une présentation théorique et conceptuelle des transformations récentes en matière de mobilité et, (2) la présentation d'une recherche ou étude portant sur la thématique de la séance. Ce double positionnement permet ainsi aux étudiants d'accéder à un contenu conceptuel stabilisé et d'appréhender la «recherche en train de se faire». [br/][br/]Les séances abordent des questions de définition de la mobilité, des outils de mesure et de connaissance de la mobilité et des déplacements, des approches renouvelées en matière de choix modal, les liens entre mobilité et modes de vie urbains, et enfin l'action publique dans le domaine de la mobilité. ",
      "Forme du contrôle":"Epreuve écrite en fin de semestre sur un sujet de réflexion et d'analyse mettant en relation plusieurs thèmes abordés lors des séances. [br/]Une séance d'exercice collective en cours au milieu du semestre permet aux étudiants de s'entrainer au format d'analyse demandé lors de l'examen écrit. Selon le travail fourni lors de cette séance, un bonus/malus est appliqué sur la note de l'examen final. ",
      "Objectifs d'apprentissage":"Ces vingt dernières années, la mobilité urbaine a beaucoup changé. Le nombre de déplacements de loisirs a augmenté tandis que la part des déplacements pour motif travail a diminué. Dans le même temps, de nouvelles formes de mobilités se sont développées, comme la multirésidentialité, la pendularité de longue distance, le tourisme urbain et l'excursionnisme. Ces changements ont été concomitants de transformations urbaines comme l'étalement urbain ou la fragmentation.[br/][br/]Dans ce contexte, la mobilité est un enjeu pour l'ingénierie des transports urbains et le développement territorial, en particulier urbain: sa régulation nécessite une appréhension nouvelle de la demande de transport.[br/]Ce cours vise alors trois objectifs principaux : [br/](1) décrire les évolutions récentes de la mobilité urbaine en Europe, [br/](2) comprendre comment se coconstruisent la ville, le territoire et la mobilité. [br/](3) évaluer les possibilités de régulation de la mobilité par l'offre (en termes d'infrastructures et de services), et en particulier les possibilités de susciter des reports modaux de l'automobile vers d'autres moyens de transport.[br/][br/]Il montre ainsi aux étudiants les interrelations entre la ville et la mobilité, l'espace urbain et les flux de déplacements, tout en leur offrant une vision renouvelée du transport et de son impact sur le territoire et les modes de vie. "
    },
    "practical":null,
    "language":"Français",
    "title":"Ville et mobilité",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-88074-769-5&amp;con_lng=FRE\" target=\"blank\">Les paradoxes de la mobilité : bouger, s'enraciner / Vincent Kaufmann</a>\". Année:2008. ISBN:978-2-88074-769-5</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-84446-228-2&amp;con_lng=FRE\" target=\"blank\">Mobilité sans racines : plus loin, plus vite... plus mobiles / sous la dir. de Stéphanie Vincent-Geslin ... [et al.]</a>\". Année:2012. ISBN:978-2-84446-228-2</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}