{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348701447&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["AR","456"],
    "title":"Urbanism in Asia",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348701447&ww_x_anneeAcad=2012-2013&ww_i_section=942293&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"AR",
    "program":"AR",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[["http://choros.epfl.ch/","http://choros.epfl.ch/"]],
    "instructors":[{
      "url":"http://people.epfl.ch/117356",
      "name":"Ruzicka-Rossier Monique"
    }],
    "lab":null,
    "credits":3,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"[li]Use other references than European ones to understand « cities».[br/][li]Explain resemblances and differences in urban practices, and in building the city.[br/][li]Name and use new concepts to qualify cities. [br/][li]Relate the phenomenon of globalization with the production of cities.[br/][li]Build a questioning on cities, and express it orally, then write it with a personal development.[br/][li]Persist in understanding what seams so different and put away a priori assumption.[br/]",
      "Content":"[li]Theoretical tools allowing to build a reflection on the links between the globalization and the production of cities. [br/][li]Reflection on the world cities, the globalized spaces and the stakes bound to their production and their appearance.[br/][li]Theoretical tools to collect other references, other concepts on town planning, by comparison with the European town planning.[br/][li]Concrete examples illustrating urban practices and different spatial planning's actions.[br/][li]Analysis of the production and the circulation of urban models.[br/][li]Exploration of urban themes: built environment, diversity, public places, multiculturalism, housing environment and practices of the city.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Urbanism in Asia",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://choros.epfl.ch/","http://choros.epfl.ch/"]],
    "instructors":[{
      "url":"http://people.epfl.ch/117356",
      "name":"Ruzicka-Rossier Monique"
    }],
    "lab":null,
    "credits":3,
    "semester":"Printemps",
    "free_text":{
      "Bibliographie et matériel":"Distribuée en cours.",
      "Mots clés":"Mondialisation, pratiques urbaines, circulation des modèles d'urbanisme.",
      "Forme d'enseignement":"Cours ex-cathedra, et présentations orales et débats sur des thèmes spécifiques traités par les étudiants.",
      "Contenu":"[li]Outils théoriques permettant de construire une réflexion sur les liens entre la mondialisation et la production des villes. [br/][li]Réflexion sur les villes mondiales, les espaces mondialisés et les enjeux liés à leur production et leur apparition.[br/][li]Outils théoriques pour collectionner d'autres références, et récolter d'autres concepts sur l'urbanisme, en comparaison de l'urbanisme européen.[br/][li]Exemples concrets illustrant des pratiques urbaines et des actions de planification spatiale différentes.[br/][li]Analyse de la production et de la circulation de modèles urbains.[br/][li]Exploration de thèmes urbains : environnement bâti, diversité, espaces publics, multiculturalisme, habitat et pratiques de la ville.",
      "Forme du contrôle":"1. Présentation orale (max. 10 min.) sur l'un des sujets proposés par groupe de trois à quatre étudiants. L'évaluation porte sur la qualité de la présentation, le respect du temps imposé, la capacité des étudiants à faire des liens avec le cours et développer un regard critique ainsi que leur faculté à mener une discussion avec le public. (25% de la note)[br/]2. Un écrit individuel à préparer et à rendre (max. 5 pages) à la fin du semestre portant sur le sujet présenté en classe et mis en perspective avec les concepts traités dans le cours. (75 % de la note). [br/][i]L'évaluation respecte six critères[/i] : [br/][li]Capacité de synthèse (savoir aller à l'essentiel).[br/][li]Faculté à aborder un problème de manière structurée et interdisciplinaire et à se poser des questions.[br/][li]Facilité à développer une critique et rigueur dans l'argumentation.[br/][li]Capacité à faire des liens avec les sujets traités dans le cours et à manier des concepts.[br/][li]Apport personnel de l'étudiant et originalité.[br/][li]Qualité formelle du texte, des références et de la bibliographie.",
      "Préparation pour":"Projet de master en Asie.",
      "Objectifs d'apprentissage":"[li]Utiliser d'autres références que celles des villes européennes pour comprendre la «ville».[br/][li]Expliquer les ressemblances, les différences dans les pratiques urbaines, et dans la fabrication de la ville. [br/][li]Nommer et utiliser de nouveaux concepts pour qualifier les villes.[br/][li]Mettre en relation le phénomène de la mondialisation avec la production des villes.[br/][li]Construire un questionnement et l'exprimer oralement, puis écrire une réflexion personnelle sur un thème lié à des villes en Asie.[br/][li]Persévérer dans la compréhension et éliminer progressivement les a-prioris."
    },
    "practical":null,
    "language":"Français",
    "title":"Urbanisme en Asie",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}