{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=23813560&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","465"],
    "title":"Urban habitat and developement",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=23813560&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-DEV-TER",
    "program":"AR",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/104576",
      "name":"Bolay Jean-Claude"
    },{
      "url":"http://people.epfl.ch/100810",
      "name":"Chenal Jérôme"
    },{
      "url":"http://people.epfl.ch/106052",
      "name":"Pedrazzini Yves"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"The objective of the course is to identify current stakes, the role of the professionals and the inhabitants in the building of the contemporary city.[br/]The student will be able to:[br/]1 - Acquire general knowledge regarding development in general, sustainable development and urban development in particular.[br/]2 - Be familiar with the main urbanization trends in the world and their impact on emerging and developing countries. [br/]3 - Identify the principal social actors of urban development and place them in a spatial context.[br/]4 - Understand the impact of the urbanization of the world in terms of governance, sectorial management, public space, habitat and the fight against poverty.[br/]5 - Analyze the political stakes of the planning models from the point of view of the inhabitants, the investors and the States. [br/]6 - Differentiate the models of urbanization and specify their ideological significance.[br/]7 - Pin down the role of urban cultures and their protagonists in the building of the so-called cities « of the South ».[br/]9 - Carry out a group study by gathering information and writing a paper, using primary or secondary sources, on a case of informal urbanization - slum, bidonville, favela, etc. - somewhere in the world, in a critical perspective on urban development.[br/]",
      "Content":"The course tackles the problems mentioned above both from a conceptual and applied angle, by comparing the theoretical contributions of the urban thinkers of the countries of the South and the actions carried out in the field by the different actors in the form of policies, development projects and alternative initiatives.[br/]Mixing lectures on theory and experiences in the field related by the teachers and their guests, the course aims to bring to the fore the production processes of the urban habitat, as well as the distinctive dynamics of development in a built environment, in all their complexity. The analysis of these social and territorial processes, which are means of transforming the city's space, is in keeping with a perspective of sustainable urban development, as much in the North as in the South. [br/][br/]In both the lectures and the work required of the students, we focus our attention on the habitat of the poor (precarious habitat, bidonville) in order to bring to the fore the causes of this phenomenon, its urban and architectural characteristics, its consequences in terms of the deterioration of living conditions on an environmental, social and economic level, but also the attempts at replies which are brought, by the inhabitants themselves, in an independent manner or organized at the community level, as well as by public institutions and international cooperation bodies.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Urban habitat and developement",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/104576",
      "name":"Bolay Jean-Claude"
    },{
      "url":"http://people.epfl.ch/100810",
      "name":"Chenal Jérôme"
    },{
      "url":"http://people.epfl.ch/106052",
      "name":"Pedrazzini Yves"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Cours, conférences de chercheurs invités. Travail en groupe.",
      "Contenu":"Le cours se déroule sur un plan conceptuel et appliqué, en mettant en regard les apports théoriques des penseurs de l'urbain et les actions menées sur le terrain par les différents acteurs sous formes de politiques, de projets de développements et d'initiatives alternatives.[br/]Mêlant cours théoriques et expériences de terrain, il vise à mettre en évidence les processus de production de l'habitat urbain, ainsi que les dynamiques propres du développement en milieu construit, dans toute leur complexité.[br/]Notre attention se focalisera sur l'habitat des pauvres (habitat précaire, bidonvilles), de manière à mettre en évidence les causes de ce phénomène, ses caractéristiques urbanistiques et architecturales, ses conséquences en termes de détérioration des conditions de vie au plan environnemental, social et économique, mais également les tentatives de réponses qui sont apportées, par les habitants eux-mêmes.",
      "Forme du contrôle":"Contrôle avec examen oral en groupe à partir d'un rapport de synthèse écrit portant sur un cas d'habitat informel urbain, remis préalablement aux enseignants. Rendus intermédiaires sans notation.[br/][i]Pondération dans lévaluation[/i] :[br/]Rédaction par groupe d'un mémoire de synthèse portant sur une étude de cas et intégrant les acquis du cours : 60%[br/]Défense par groupe de ce mémoire en examen oral : 40%[br/]Présentation intermédiaire par groupe : 0%.",
      "Bibliographie et matériel":"Distribuée au début du cours.",
      "Objectifs d'apprentissage":"L'objectif du cours est d'identifier les enjeux actuels, le rôle des professionnels et des habitants dans la fabrication de la ville contemporaine.[br/][i]L'étudiant sera capable de[/i] :[br/]1 - Acquérir des connaissances sur le développement en général et sur le développement urbain durable en particulier.[br/]2 - Connaître les tendances majeures de l'urbanisation dans le monde et leur impact dans les pays émergents et en développement.[br/]3 - Identifier les principaux acteurs sociaux du développement urbain et les contextualiser spatialement.[br/]4 - Comprendre l'impact de l'urbanisation du monde en termes de gouvernance, de gestion sectorielle, d'espaces publics, d'habitat et de lutte contre la pauvreté.[br/]5 - Analyser les enjeux politiques des modèles de planification du point de vue des habitants, des bailleurs de fonds et des Etats.[br/]6 - Différencier les modèles d'urbanisation et préciser leur signification idéologique.[br/]7 - Situer le rôle des cultures urbaines et de leurs protagonistes dans la fabrication des villes dites « du Sud ».[br/]9 - Mener une étude en groupe  en recueillant des informations et rédiger à partir de sources primaires ou secondaires un mémoire sur un cas d'urbanisation informelle - slum, bidonville, favela etc. - quelque part dans le monde, dans une perspective critique."
    },
    "practical":null,
    "language":"Français",
    "title":"Habitat et développement urbain",
    "recitation":null,
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}