{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1777162&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","466"],
    "title":"UE D : Territory and society",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1777162&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-DEV-TER",
    "program":"AR",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105991",
      "name":"Noschis Kaj"
    },{
      "url":"http://people.epfl.ch/106052",
      "name":"Pedrazzini Yves"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":6,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The student will be able to:[br/][li]formulate problematic and relevant hypotheses in order to grasp the relationship between territory and society;[br/][li]develop enquiries on uses and users of public spaces;[br/][li]analyse public spaces in an architectural and urban perspective;[br/][li]make interviews with planning and intervening actors as well as with users of public spaces;[br/][li]collect systematic data on public spaces and their users;[br/][li]choose appropriate methods of research in order to test the formulated hypotheses;[br/][li]analyse qualitatively and quantitatively the collected systematic data;[br/][li]formulate spatial proposals based on the analysis of obtained results.[br/]",
      "Content":"The Teaching unit \"Territory and society\" aims to familiarize architects with comprehensive human sciences methods and to give them prospective.[br/]Tools to analyse the impacts of formal change on activities, frequenting users and images of places. This Teaching unit develops in particular thinking on the user of the built environment and conveys students to explore ways of integrating such thinking into a project. To study this problematic we will examine different user categories and their interactions in urban space.[br/]The Teaching unit will be devoted, to the study of public spaces of the city centre of a Swiss town and to understand to what extent considerations on different user categories have had a part in planning such spaces. Study work will be devoted to observation and enquiries on the existing practices and to reflections on the place of the user in urban environments. Particular attention will be devoted to the relations between different generations of users in urban public spaces. Students will be asked to develop a research problematic and to provide answers to it through field work.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE D : Territory and society",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/105991",
      "name":"Noschis Kaj"
    },{
      "url":"http://people.epfl.ch/106052",
      "name":"Pedrazzini Yves"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":6,
    "semester":"Printemps",
    "free_text":{
      "Bibliographie et matériel":"Distribuée au début du cours. [br/]",
      "Mots clés":"Territoire, société, espace public, usager, intergénérationnel.",
      "Forme d'enseignement":"Cours, séminaires, visites, conférences. Exercices sur le terrain. Travail en groupe.",
      "Contenu":"L'unité d'enseignement « Territoire et Société » a pour objectif de familiariser l'étudiant avec les méthodes d'observations compréhensives des sciences humaines et lui fournir des outils prospectifs pour analyser les impacts du changement formel sur les activités, la fréquentation et l'image des lieux.[br/]L'UE entend développer une réflexion sur l'usager et convie les étudiants à s'interroger sur la manière d'intégrer cette réflexion au projet. Pour aborder cette problématique, l'étude porte sur  différentes catégories d'usagers et leurs interactions dans l'espace urbain.[br/]L'UE est consacrée à l'analyse des espaces publics du centre ville d'une ville suisse et à comprendre dans quelle mesure il a été tenu compte des usagers, toutes catégories confondues,  dans l'aménagement de ces espaces. Une attention particulière est apportée aux relations intergénérationnelles dans les espaces publics urbains.[br/]Il s'agit d'un travail d'observation et d'enquête sur les pratiques existantes et de réflexion sur la place de l'usager dans la ville. Il est demandé aux étudiants de développer une problématique de recherche et de l'aborder à partir d'une enquête de terrain.",
      "Forme du contrôle":"Contrôle et évaluation continue avec examen oral à partir d'un rapport de synthèse sur l'ensemble de l'activité de l'UE.[br/]Pondération dans l'évaluation :[br/]Présentation par groupe des résultats d'une journée « d'immersion » : 20%[br/]Lectures et présentation critique individuelle de textes : 10%[br/]Présentation intermédiaire par groupe : 20%[br/]Rapport écrit final par groupe : 30%[br/]Présentation finale par groupe : 20%.[br/]",
      "Objectifs d'apprentissage":"[i]L'étudiant sera capable de[/i] :[br/][li]formuler une problématique et des hypothèses pertinentes pour saisir les rapports entre territoire et société;[br/][li]mener des enquêtes sur les usages et usagers d'espaces publics;[br/][li]analyser dans une perspective architecturale et urbanistique des espaces publics;[br/][li]conduire  des interviews avec des concepteurs, usagers et intervenants des espaces publics;[br/][li]recueillir des données systématiques sur les espaces publics et leurs usagers;[br/][li]choisir des méthodes appropriées pour la vérification des hypothèses formulées;[br/][li]analyser qualitativement et quantitativement les données systématiques recueillies;[br/][li]faire des propositions spatiales tenant compte de l'analyse des résultats d'enquêtes."
    },
    "practical":null,
    "language":"Français",
    "title":"UE D : Territoire et société",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  }
}