{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=23815258&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","471"],
    "title":"UE J : Territory and landscape",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=23815258&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-DEV-TER",
    "program":"AR",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100876",
      "name":"Cogato Lanza Elena"
    },{
      "url":"http://people.epfl.ch/129608",
      "name":"Farra Bassel"
    },{
      "url":"http://people.epfl.ch/230824",
      "name":"Verde Alberto"
    }],
    "lab":null,
    "credits":6,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"TU J introduces the architecture students to urban and territorial design, combining description and design concept.[br/]Global learning outcome: developing a densification strategy.[br/][br/]Detailed learning outcomes:[br/][li]Description and analysis: adjusting the gaze (what and how to observe according to a certain degree of reduction) and the representation (how to formulate an adequate visual restitution, from the scale and graphic style points of view);[br/][li]Creation: articulating spatial principles, programs and quantity;[br/][li]Description, analysis and creation: relating them to a conceptual topic.[br/]",
      "Content":"In the frame of the agglomeration plan for Lausanne and Morges (PALM), the TU J will address two peculiar topics of contemporary urbanism: the imperative of improving urban density and the ambition for dwelling in and belonging to a place with peculiar characters.[br/][br/]The semester will be structured by three exercises: a large description/analysis about the agglomeration; the definition of a design concept for a limited area; the assembly of all students' design concepts. TU J will give us the opportunity to deepen our more general research upon the relevant unity of measuring and framing, in order to define an articulation between the territorial and the proximity scales."
    },
    "practical":null,
    "language":"Français",
    "title":"UE J : Territory and landscape",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/100876",
      "name":"Cogato Lanza Elena"
    },{
      "url":"http://people.epfl.ch/129608",
      "name":"Farra Bassel"
    },{
      "url":"http://people.epfl.ch/230824",
      "name":"Verde Alberto"
    }],
    "lab":null,
    "credits":6,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Cours, séminaires, workshop.",
      "Contenu":"En s'inscrivant dans le contexte du projet d'agglomération Lausanne Morges (PALM), l'UE J aborde deux problématiques sensibles de l'urbanisme contemporain : l'impératif de la «densification» et l'aspiration à habiter dans un lieu doté de caractères spécifiques.[br/][br/]Trois exercices scandent le semestre : un vaste exercice de description portant sur l'ensemble de l'agglomération; une esquisse projectuelle sur une partie précisément délimitée; un exercice d'assemblage de projets. L'occasion se donnera d'approfondir une recherche plus vaste, entreprise par les enseignants, sur les unités de mesures et de «cadrages» pertinents afin de fonder une articulation entre des échelles extrêmes, l'échelle territoriale et l'échelle de la proximité.[br/]",
      "Forme du contrôle":"Contrôle continu et présentation finale.[br/]La note finale considère l'ensemble des rendus; la qualité des présentations orales; la participation à la dynamique collective d'intelligence du territoire, de projet et de conceptualisation.[br/]",
      "Bibliographie et matériel":"Donnée en début de semestre. Moodle UE J.",
      "Objectifs d'apprentissage":"L'UE J initie les étudiants au projet de la grande échelle.[br/]Objectif global : développer une stratégie de densification.[br/][br/]Objectifs détaillés :[br/][li]En phase de description et d'analyse : opérer un réglage du «regard» (quoi observer; selon quel degré de simplification l'appréhender) et de la représentation (restitution visuelle adéquate du point de vue de l'échelle et du style graphique).[br/][li]En phase d'esquisse projectuelle (conception) : articuler principes spatiaux, programmes et quantités (métriques et de densité).[br/][li]Dans les deux phases, formuler et développer une interrogation conceptuelle.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"UE J : Territoire et paysage",
    "recitation":{
      "week_hours":2,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":12
    }
  }
}