{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348700183&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=fr",
    "code":["AR","477"],
    "title":"Understanding and Re-Conceiving the Urban",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=348700183&ww_x_anneeAcad=2012-2013&ww_i_section=84482889&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-DEV-TER",
    "program":"AR",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"[li]To provide engineers and architects knowledge allowing them to rise key questions on cities and linked territories.[br/][br/][li]Get trained to bring out what is invisible or ignored, i.e. identify situations that do not seem to pose problems when elsewhere dysfunctions are observed. [br/][br/][li]Comprehending cities as technical systems whose manufacture is the responsibility of their inhabitants; and learning to build projects together.  [br/]",
      "Content":"To introduce cities and urbanized areas through their physical, functional and political components and through their financial dimension:[br/][br/][li]To understand mechanisms of spatial and social fragmentation and segregation, and their impacts on built and natural environments.[br/][li]To understand the multiplicity of functions composing the city.[br/][li]To understand political issues and financial mechanisms.[br/][br/]To address, through two seminars, plural notions of spatial and territorial project and the role of citizen participation.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Understanding and Re-Conceiving the Urban",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Cours pas donné en 2012-2013.[/b][br/][br/]",
      "Bibliographie et matériel":"Sélection d'ouvrages.",
      "Forme d'enseignement":"Exposés et études de cas.",
      "Contenu":"Introduire la ville et les aires urbanisées à travers leurs composantes physique, fonctionnelle, politique et leurs dimensions financières :[br/][br/][li]Comprendre les mécanismes de fragmentation et ségrégation spatiales et sociales, et leurs impacts sur les milieux bâti et naturel.[br/][li]Comprendre la multiplicité des fonctions qui composent la ville. [br/][li]Comprendre les enjeux politiques et la place des mécanismes financiers. [br/][br/]Aborder à travers deux séminaires les notions plurielles du projet spatial et territorial et la place de la participation citoyenne.[br/][br/]",
      "Forme du contrôle":"Travaux écrits et présentations.",
      "Préparation pour":"Mineur en développement territorial et urbanisme.",
      "Objectifs d'apprentissage":"[li]Apporter aux ingénieurs et architectes des connaissances leur permettant de poser les bonnes questions sur la ville et les territoires liés. [br/][br/][li]S'exercer à faire émerger ce qui est invisible, voire ignoré, c'est à dire identifier les situations qui semblent ne pas poser de problèmes alors  qu'ailleurs s'observent des dysfonctionnements.[br/][br/][li]Comprendre la ville comme un système technique dont la fabrique est du ressort des habitants, et apprendre à construire ensemble des projets.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Comprendre la ville et concevoir le projet",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":12
    }
  }
}