{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1597627638&ww_x_anneeAcad=2012-2013&ww_i_section=18351702&ww_i_niveau=&ww_c_langue=fr",
    "code":["BIO","665"],
    "title":"Hot Topics in Cancer Research I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1597627638&ww_x_anneeAcad=2012-2013&ww_i_section=18351702&ww_i_niveau=&ww_c_langue=en",
    "section":"EDMS",
    "program":"EDMS",
    "plan":"edoc"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/",
      "name":"Various lecturers (see below)"
    }],
    "lab":null,
    "credits":3,
    "semester":null,
    "free_text":{
      "Learning outcomes":"(1) To expose PhD students to cutting-edge research in the field of Cancer Research through attendance of lectures given by world-leading distinguished scientists in the field.[br/](2) To introduce PhD students to state-of-the art interdisciplinary appoaches of modern cancer biology and train them to critically analyze original scientific articles by participation in a \"journal club\"comprising in-depth discussion of assigned papers by the students under the guidance of SV Professors and/or the invited lecturers.[br/](3) To offer PhD students the opportunity to personally meet distinguished cancer researchers to get career advice, discuss ethical and economic implication of cancer research, as well as current and future trends in biology. [br/]",
      "Content":"Cancer is the leading cause of death in western countries. Cancer Biology aims at uncovering the molecular mechanisms that cause cell transformation, understanding the biology of tumor cell growth and metastasis, as well as strategies for the treatment of cancer patients. Cancer biology thereby brings together multiple scientific disciplines, including cell- and molecular biology, biochemistry, pharmacology and various disciplines of medicine. We have recently established the 'John and Lola Grace Distinguished Cancer Lecture Series' and we have been able to attract world-leading cancer researchers to come to EPFL. All invitees have been competitively selected based on scientific excellence and impact of the research on improvement of care for cancer patients. The invitees for the next year include two Nobel Laureates (Prof. Michael Bishop and Prof. David Baltimore) and several winners of other important scientific prizes.[br/]The PhD students attending this course will meet the day before the Distinguished Cancer Lecture Series with the speaker and/or an ISREC Faculty member to get an introduction to the particular field of the lecturer and discuss 2-3 high-impact key publications of the speakers' field (2 hours). The students will then attend the lecture of the distinguished speaker (1 hour) and will afterwards have the exclusive opportunity to discuss open issues from the lecture, ethical and economical implications, as well as to get a unique insight into critical career decisions of the lecturer and get personal advice on the students' own career planning (1 hour) [br/]"
    },
    "practical":null,
    "language":"English",
    "title":"Hot Topics in Cancer Research I",
    "recitation":{
      "total_hours":28
    },
    "exam_form":"Oral presentation",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "total_hours":28
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/",
      "name":"Various lecturers (see below)"
    }],
    "lab":null,
    "credits":3,
    "semester":null,
    "free_text":{
      
    },
    "practical":null,
    "language":"English",
    "title":"Hot Topics in Cancer Research I",
    "recitation":{
      "total_hours":28
    },
    "exam_form":"Exposé",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "total_hours":28
    }
  }
}