{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773677&ww_x_anneeAcad=2012-2013&ww_i_section=246696&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["CH","231"],
    "title":"Organic functions and reactions I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1773677&ww_x_anneeAcad=2012-2013&ww_i_section=246696&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"CGC",
    "program":"CGC",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://scgc.epfl.ch/telechargement_cours_chimie","http://scgc.epfl.ch/telechargement_cours_chimie"]],
    "instructors":[{
      "url":"http://people.epfl.ch/206332",
      "name":"Zhu Jieping"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"Discovery of new reactions of prime importance in organic chemistry. Methods of synthesis. Models to interpret the relative stability of anions and cations. Methods for the calculations of thermodynamic and kinetic parameters. Bond energies as fundamental parameters to apprenhend chemical reactivity.[br/]",
      "Content":"Acid / base exchanges. Evaluation of pKa values. Electrostatics, relative stability of anions, solvent effects. Separation of organic compounds through extraction with aqueous active solutions.[br/]Synthesis and retro-synthesis of simple organic compounds (review of reactions and functional conversions presented during the first year). Transformations of simple functions, mechanisms. Starting materials for aliphatic chemistry.[br/]Chemistry of benzene and derivatives. Synthesis of polyfunctional compounds, retro-synthesis. Diazo compounds. Aromatic electrophilic and nucleophilic substitutions. Electrostatics applied to rationalize substituent effects on the relative stability of carbocations. Hammett correlations. Reactions under kinetic or thermodynamic control. Birch reduction, oxidations, ortho-metalation.[br/]Chemical systems that are stable equilibriums. Standard heat and entropy of reaction. Thermodynamic statistics. Standard heats of formation, NIST tables and their use, additivity rules ([i]Benson-Buss[/i]), ring strain ([i]Bayer, Pitzer, Dunitz-Schomaker[/i]), conformation and flexibility of cycloalkanes. Gauche effects, allylic strain, anomeric effects. Electronegativity and absolute hardness, ionization energies, electron affinities, Standard homolytic dissociation enthalpies, heats of formation of radicals, relative stability of radicals, simple reaction involving radicals. Activation parameters ([i]Arrhenius, Eyring[/i], reaction rate laws, energy barriers, activation entropy, what free activation enthalpy for a reaction to occur in one hour at room temperature). Heats of formation of unstable intermediates such as enols, diradicals ([i]Bergman[/i] rearrangement), cyclization and condensation entropies. Entropy as a synthetic tool. The chemistry of wine and wine ageing. Competition between nucleophilic substitution and elimination (mechanism spectra), medium effects, catalysis.[br/]The chemistry of carbonyl compounds. Part I: Methods of preparation and nucleophilic additions (hydrates, acetals, thioacetals, cyanhydrins, imines, [i]Barbier, Grignard, Reformatzky, Perkin, Darzens, Tollens, Wittig, Wittig-Horner-Emmons, Peterson, Thorpe, Julia[/i]. Umpolung of aldehydes : Benzoin , [i]Seebach, Stetter[/i]. Esterification, amidification (mech.) and their catalysis."
    },
    "practical":null,
    "language":"Français",
    "title":"Organic functions and reactions I",
    "recitation":{
      "week_hours":1,
      "weeks":14
    },
    "exam_form":"Written",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-8041-2620-X&amp;con_lng=ENG\" target=\"blank\">Chimie organique : méthodes et modèles / Pierre Vogel; préf. de Jean-Marie Lehn</a>\". Year:1998. ISBN:2-8041-2620-X</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://scgc.epfl.ch/telechargement_cours_chimie","http://scgc.epfl.ch/telechargement_cours_chimie"]],
    "instructors":[{
      "url":"http://people.epfl.ch/206332",
      "name":"Zhu Jieping"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"Le cours nécessite les connaissances de: \"Atomes, ion, molécules et fonctions I et II\"; \"Chimie générale\"",
      "Bibliographie et matériel":"\"Chimie Organique\" Peter Vollhardt et Pierre Vogel, DeBoeck-Université, Paris, 1997",
      "Forme d'enseignement":"Cours ex-cathedra, exercices en classe et à la maison, avec rendus",
      "Contenu":"Les échanges acide/base, prédiction des pKa des composés organiques. Modèles de l'électrostatique pour les effets de substituant sur les anions. Effets de solvant. Séparation par extraction au moyen de phases aqueuses actives.[br/]Synthèse et rétro-synthèse de composés organiques simples (revue des réactions présentées en première année). Transformations fonctionnelles simples, mécanismes. Quelle matière première pour la chimie aliphatique ?[br/]La chimie du benzène et de ses dérivés. Synthèses de composés polysubstitués, rétro-synthèses. Colorants azoïques. Les substitutions électrophiles et nucléophiles aromatiques. Application de l'électrostatique aux effets de substituant sur la stabilité relative des carbocations. Corrélations de Hammett. Contrôle cinétique, contrôle thermodynamique. Reduction selon Birch. Oxydations. Métalation en ortho.[br/]Les systèmes chimiques en équilibres stables : enthalpie et entropie de réaction. Statistique thermodynamique. Chaleurs de formation, tables NIST et leur exploitation, règles d'additivité ([i]Benson-Buss[/i]). Conformations et flexibilité des cycloalcanes et leur tension de cycle ([i]Baeyer, Pitzer, Dunitz-Schomaker[/i]). Effets gauches, tensions allyliques, effets anomères, aromaticité, Electronégativité et dureté absolue, energies d'ionisation, affinités électroniques. Enthalpies de dissociations homolytiques, enthalpies de formation des radicaux, effets des substituants sur la stabilité des radicaux, exemples de réactions radicalaires. Paramètres d'activation. Enthalpies de formation des intermédiaires instables comme les énols, les diradicaux. entropie de cyclisation, de condensation, entropie comme outil pour la synthèse, vieillissement du vin. Compétition entre substitution nucléophile et élimination (spectres de mécanismes), catalyse.[br/]La chimie des composés carbonylés . Part. I Méthodes de préparation et additions nucléophiles (hydrates, acétals, thioacétals, cyanhydrines, imines, [i]Barbier, Grignard, Reformatzky, Perkin, Darzens, Tollens, Wittig, Wittig-Horner-Emmons, Peterson, Thorpe, Julia[/i]. Umpolung d'aldéhydes : benzoine , [i]Seebach, Stetter[/i]. Estérification, amidification (méch.) et leur catalyseur.",
      "Forme du contrôle":"Ecrit, rendus d'exercices",
      "Préparation pour":"\"Fonctions et réactions organiques II\", \"Physical organic chemistry\", \"Synthèse asymétrique\"",
      "Objectifs d'apprentissage":"Découvertes de nouvelles réactions de première importance en chimie organique. Méthodes de synthèse. Modèles pour rationaliser la stabilité relative d'anions, cations et radicaux. Méthodes pour le calcul des paramètres thermochimiques et cinétiques. Energies des liaisons, paramètres fondamentaux pour la compréhension de la réactivité chimique. "
    },
    "practical":null,
    "language":"Français",
    "title":"Fonctions et réactions organiques I",
    "recitation":{
      "week_hours":1,
      "weeks":14
    },
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-8041-2620-X&amp;con_lng=FRE\" target=\"blank\">Chimie organique : méthodes et modèles / Pierre Vogel; préf. de Jean-Marie Lehn</a>\". Année:1998. ISBN:2-8041-2620-X</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}