{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194448&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["CIVIL","368"],
    "title":"Design and construct the imaginary",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194448&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"GC",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/192199",
      "name":"de Bussierre d'Ortenberg Arnauld Saint-Clair"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Design and construct the imaginary",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/192199",
      "name":"de Bussierre d'Ortenberg Arnauld Saint-Clair"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"3 - Forme pédagogique [br/]- Cours théoriques [br/][br/]Les 11 thèmes précédemment mentionnés feront l'objet de cours théoriques sur la base suivante : [br/]Thèmes relatifs aux généralités sur la question de l'imaginaire: 6 heures de cours [br/]Ils sont au nombre de 3 et chacun d'eux fera l'objet d'un cours théorique de 2 heures soit : [br/]- L'imaginaire : structures anthropologiques de l'imaginaire. (2 heures). [br/]- De l'imaginaire à la [br/]rationalité : les mécanismes d'une réflexion. (2 heures). [br/]- L'imaginaire et la pensée scientifique ou la mise en place des processus techniques en devenir. (2 heures). [br/][br/]Thèmes relatifs à l'espace et aux lieux de l'imaginaire : 8 heures de cours [br/]Ils sont au nombre de 4 et chacun d'eux fera l'objet d'un cours théorique de 2 heures soit : [br/]- Les compositions de l'espace [br/]Formes et typologies des lieux de l'imaginaire. (2 heures). [br/]- Ruines sacrées, ruines industrielles : de la non fonctionnalité à l'établissement du projet imaginaire. (2 heures). [br/]- L'imaginaire et le milieu construit : l'imaginaire en tant que facteur conceptuel dans les domaines de l'architectures et des ouvrages d'art. (2 heures). [br/][br/]Thèmes relatifs à la ville imaginaire : 4 heures de cours [br/]- Villes imaginaires et cités utopiques: deux conceptions antinomiques [br/]- Les origines des villes imaginaires et leurs compositions urbaines. (2 heures). [br/]- Les origines des cités utopiques et leurs compositions sociales. (2 heures). [br/][br/]Thèmes relatifs aux paysages imaginaires : 2 heures de cours [br/]- Les paysages de l'imaginaire ou les utopies de la nature. (2 heures). [br/]Thèmes relatif à la représentation de l'imaginaire : 4 heures de cours [br/]- Image et imaginaire : une représentation passéiste ou futuriste. (2 heures). [br/][br/]- Archétypes, allégories, représentations symboliques etc... ou comment l'imaginaire doit-il s'affranchir de ces écueils pour être un instrument de conception et générateur innovation technique. (2 heures). [br/][br/]- Mise en pratique sur un projet dirigé [br/][br/]Des groupes de travail de trois étudiants seront constitués. Chaque groupe comprendra des étudiants provenant de chaque section. Puis les groupes seront invités à faire un mini projet avec le choix de deux sites : [br/]Le quartier du Flon à Lausanne [br/]Le site de l'EPFL [br/]Ce mini projet devra mettre l'accent sur 4 points : [br/]1. Analyse contextuelle du site [br/]2. Esprit de création [br/]3. Concept du projet où le caractère imaginaire tant sur le plan de son insertion, de son architecture que celui de son inventivité structurelle, devra être comme un manifeste [br/]4. Capacité à ramener l'imaginaire à la rationalité sans le trahir.[br/][br/]",
      "Contenu":"1 - Introduction : [br/][br/]Tour à tour «Folle du logis» (Blaise Pascal), «maîtresse d'erreur et de fausseté» (René Descartes), la question de l'Imaginaire est encore aujourd'hui, considérée comme une transgression majeure dans le processus de la pensée et de la conceptualisation. Elle cadre mal avec les catégories de la Modernité et de la rationalité... Et pourtant ! L'imaginaire s'impose comme un ensemble de signes et de figures, d'objets de pensée, dont la portée, la cohérence et l'efficacité peuvent varier, dont les limites et la dynamique sont sans cesse à redéfinir, mais qui s'inscrit indéniablement au coeur de notre rapport à la culture, au monde et à l'histoire. Notre position sur la question de l'imaginaire au risque de choquer certains, sous entend qu'il n'y a pas d'autonomie de la rationalité.[br/][br/]2 - Les thèmes traités dans cette Unité ENAC : [br/][br/]Seront abordés dans cette unité d'enseignement les 11 thèmes suivants : [br/]- L'imaginaire : structures anthropologiques de l'imaginaire. [br/]- De l'imaginaire à la rationalité : les mécanismes [br/]d'une réflexion. [br/]- Les compositions de l'espace imaginaire. [br/]- Formes et typologies des lieux de l'imaginaire. [br/]- Ruines sacrées, ruines industrielles : de la non fonctionnalité à l'établissement du projet imaginaires. [br/]- L'imaginaire et la pensée scientifique ou la mise en place des processus techniques en devenir [br/]- Image et imaginaire : une représentation passéiste ou futuriste. [br/]- L'imaginaire et le milieu construit : l'imaginaire en tant que facteur conceptuel dans les domaines de l'architectures et des ouvrages d'art [br/]- Les paysages de l'imaginaire ou les utopies de la nature [br/]- Villes imaginaires et cités utopiques: deux conceptions antinomiques [br/]- Archétypes, allégories, représentations symboliques etc... ou comment l'imaginaire doit-il s'affranchir de ces écueils pour être un instrument de conception et générateur innovation technique [br/][br/] [br/]",
      "Forme du contrôle":" 4 - Mode de contrôle des connaissances. [br/]A la fin du semestre une séance sera consacrée à la présentation de chaque projet devant l'ensemble des étudiants et du groupe d'enseignants encadrant cette Unité ENAC. Chaque groupe aura 20 minutes pour présenter son projet et devra répondre aux questions du jury. Par ailleurs chaque équipe est invitée à faire partie du jury à tour de rôle[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Concevoir et construire l'imaginaire",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}