{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=824225311&ww_x_anneeAcad=2012-2013&ww_i_section=942953&ww_i_niveau=&ww_c_langue=fr",
    "code":["CIVIL","103"],
    "title":"Geology",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=824225311&ww_x_anneeAcad=2012-2013&ww_i_section=942953&ww_i_niveau=&ww_c_langue=en",
    "section":"SIE",
    "program":"GC",
    "plan":"prop"
  },
  "en":{
    "coefficient":1.0,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/178512",
      "name":"Baumgartner Lukas"
    },{
      "url":"http://people.epfl.ch/220185",
      "name":"Meibom Anders"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"The activities of the civil and the environmental engineers are in constant interaction with the earth environment. The course of geology gives to the students an academic view of geosciences and the bases necessary to a well integrated engineering in the context of our planet. The main objective are : -Knowing the geological methods and the geodynamic processes which lead to genesis, deformation and weathering of surficial deposits and rocks. -Studying the nature of the main geological substrates and their properties. -Understanding how the geological conditions influence the activities of the engineer, how they can facilitate them, how they can complicate them. -Making students aware of the external geodynamic evolutions and their consequences on the environment, the geomorphology, the landforms and the territory.[br/][br/]",
      "Content":"[b]Introduction:[/b] History of geological sciences and their utility for engineers. [b]Planetary geology:[/b] The Earth in the Universe, contributions of planetary geology to the comprehension of the Earth and the processes which are occuring on it. [b]History of the Earth:[/b] Evolution of the Earth and of life, dating methods. [b]Geophysics:[/b] Seismology, gravimetry, magnetism, use of the geothermal energy. [b]Constitutive minerals of rocks:[/b] Crystalline structures, main geochemical classes, identification of the most common minerals. [b]Magmatism:[/b] tectonic plates, ridge -hot points -orogenic magmatism, corresponding rocks and their properties (plutonic and volcanic rocks), risks related to the volcanic eruptions. [b]Water Cycle:[/b] different kinds of water on Earth, Hydrologic cycle, the atmosphere, surface water, groundwater, water resources. [b]Continental Environment:[/b] Processes of erosion and deposition, geomorphology, landslides and rock falls, lakes, palustrine, glacial and desert environments. [b]Marine environment:[/b] Coastal and abyssal sedimentation processes, biogenic and evaporitic sediments. Interactions between earth sciences and life sciences. [b]Diagenesis:[/b] Processes of transformation of sediments in rocks (compaction, cementation, light mineralogical modifications), geology of fossil fuel. [b]Metamorphism:[/b] Solid recrystallization of rocks, regional -contact -and dynamo-metamorphism, corresponding rocks and their properties. [b]Tectonics:[/b] Stress and strain in rocks, brittle deformations (diaclasis, fractures), ductile deformations (folds). [b]Rocks weathering:[/b] Phenomena leading to weathering (mechanical, chemical, mineralogical), rocks sensitive to alteration, consequences for engineers, recommendations.[br/][br/][br/][br/][br/]",
      "Type of teaching":"Participatory teaching",
      "Form of examination":"Continuous control (20 %), written exam 180 min. (80 %)"
    },
    "practical":null,
    "language":"Français",
    "title":"Geology",
    "recitation":null,
    "exam_form":"Written",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-0-415-46165-8&amp;con_lng=ENG\" target=\"blank\">Geology : basics for engineers / Aurèle Parriaux</a>\". Year:2009. ISBN:978-0-415-46165-8</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-88074-810-4&amp;con_lng=ENG\" target=\"blank\">Géologie : bases pour l'ingénieur / Aurèle Parriaux</a>\". Year:2009. ISBN:978-2-88074-810-4</li></ul>",
    "lecture":{
      "week_hours":4,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":1.0,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/178512",
      "name":"Baumgartner Lukas"
    },{
      "url":"http://people.epfl.ch/220185",
      "name":"Meibom Anders"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Enseignement participatif",
      "Contenu":"[b]Introduction:[/b] Comment est née la géologie et en quoi elle sert à l'ingénieur. [b]Géologie planétaire:[/b] place de la Terre dans l'univers, apports de la géologie planétaire à la compréhension de la terre et des processus qui s'y déroulent. [b]Histoire de la terre:[/b] évolution de la terre et de la vie, méthodes de datation. [b]Géophysique du globe:[/b] sismologie (étude des tremblements de terre), gravimétrie, magnétisme, géothermie (utilisation de l'énergie géothermique). [b]Minéraux constitutifs des roches:[/b] structures cristallines, grandes classes géochimiques, détermination des minéraux les plus courants. [b]Magmatisme:[/b] dérive des plaques, magmatismes de ride, intraplaque et orogénique, roches correspondantes et leurs propriétés (roches plutoniques et volcaniques), risques liés aux éruptions volcaniques. [br/][b]Cycle de l'eau:[/b] formes de l'eau sur la Terre, bilan hydrique, l'atmosphère, les eaux de surface, les eaux souterraines, ressources en eau. [b]Milieu continental:[/b] processus d'érosion et de dépôt, géomorphologie, environnements versants (glissements de terrain et éboulements), lacustre, palustre, glaciaire et désertique. [b]Milieu marin:[/b] processus sédimentaires de marge continentale et de haute mer, sédiments détritiques, biogènes et hydrochimiques. Interactions entre sciences de la Terre et sciences de la vie. [b]Diagenèse:[/b] processus de transformation des sédiments en roches (compaction, cimentation, modifications minéralogiques légères), géologie des combustibles fossiles. [b]Métamorphisme:[/b] recristallisation solide des roches, métamorphisme régional, de contact et dynamométamorphisme, roches correspondantes et leurs propriétés. [b]Tectonique:[/b] contraintes dans les roches, déformations cassantes (diaclases, failles), déformations ductiles (plis, nappes tectoniques). [b]Altération des roches:[/b] phénomènes conduisant à l'altération (physiques, chimiques, minéralogiques), roches sensibles à l'altération, conséquences pour l'ingénieur, recommandations.",
      "Forme du contrôle":"Contrôle continu (20%), examen écrit 180 min.(80%)",
      "Bibliographie et matériel":"Livre \"Géologie : bases pour ingénieurs\", A. Parriaux, PPUR 2009[br/]Book \"Geology: Basics for Engineers\", A. Parriaux, CRC Press 2009",
      "Objectifs d'apprentissage":"Les ingénieurs civils et en environnement exercent leurs activités en constante interaction avec l'environnement Terre. Le cours de géologie donne aux étudiants une culture universitaire en géosciences et les bases nécessaires à une ingénierie bien intégrée dans le contexte de notre planète. Le cours vise notamment : -à faire connaître les méthodes géologiques et les processus géodynamiques qui conduisent à la genèse, la déformation et l'altération des terrains meubles et des roches, -à étudier la nature des principaux substrats géologiques ainsi que leurs propriétés, -à faire comprendre comment les conditions géologiques influencent les activités de l'ingénieur, comment elles peuvent les faciliter, comment elles peuvent les compliquer, -à sensibiliser les étudiants aux évolutions géodynamiques externes et à leurs effets sur l'environnement, la géomorphologie, le paysage et le territoire."
    },
    "practical":null,
    "language":"Français",
    "title":"Géologie",
    "recitation":null,
    "exam_form":"Ecrit",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-0-415-46165-8&amp;con_lng=FRE\" target=\"blank\">Geology : basics for engineers / Aurèle Parriaux</a>\". Année:2009. ISBN:978-0-415-46165-8</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-2-88074-810-4&amp;con_lng=FRE\" target=\"blank\">Géologie : bases pour l'ingénieur / Aurèle Parriaux</a>\". Année:2009. ISBN:978-2-88074-810-4</li></ul>",
    "lecture":{
      "week_hours":4,
      "weeks":14
    }
  }
}