{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=195442527&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["CIVIL","262"],
    "title":"Management of territories affected by natural hazards in mountain areas",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=195442527&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"GC",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/114728",
      "name":"Labiouse Vincent"
    },{
      "url":"http://people.epfl.ch/117356",
      "name":"Ruzicka-Rossier Monique"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Management of territories affected by natural hazards in mountain areas",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/114728",
      "name":"Labiouse Vincent"
    },{
      "url":"http://people.epfl.ch/117356",
      "name":"Ruzicka-Rossier Monique"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Les étudiants intéressés à ce thème formeront des groupes de trois à quatre personnes, qui comprendront idéalement un ou deux architectes, un ingénieur GC et un ingénieur SIE. [br/]En cas de déséquilibre dans les effectifs, chaque groupe devra au moins comprendre 1 GC ou 1 SIE. [br/]Tout le travail de terrain se fera par groupes séparés (les groupes travaillant sur des sites communs ne conduiront pas les investigations conjointement). [br/]Chaque groupe établira son propre plan d'action pour les relevés de terrain et la préparation des tâches à accomplir. [br/]Des points de contact avec les encadrants seront cependant planifiés sur le terrain. [br/]Au terme de la semaine, chaque groupe effectuera une présentation orale (le vendredi) et rédigera un rapport (à rendre ultérieurement).[br/][br/]",
      "Contenu":"Après un jour de cours, d'exercices et d'acquisition de données SIG à l'EPFL, les étudiants passeront quatre jours dans le Val de Bagnes, [br/]où se situent les phénomènes et sites à étudier : [br/]1. avalanches de neige sur le village de Verbier ; [br/]2. laves torrentielles du Merdenson à Cries (commune de Vollèges) ; [br/]3. chutes de blocs sur un hameau situé au-dessus de Lourtier. [br/]Dans un premier temps, les trois sites d'étude seront visités par l'ensemble des étudiants. [br/]Pour chacun d'entre eux, les phénomènes et enjeux seront introduits. [br/]Dans ce cadre, les étudiants auront l'occasion de rencontrer des responsables locaux des communes de Bagnes et de Vollèges (e.g. municipaux, architecte communal, protection civile) [br/]ainsi que des représentants des bureaux d'études chargés de l'analyse des dangers naturels sur le Val de Bagnes. [br/]Ensuite, des groupes seront constitués et répartis sur les 3 sites d'étude. [br/]Ils analyseront les caractéristiques, les impacts et les effets sur la gestion du territoire des dangers naturels considérés et préciseront les options d'aménagement et/ou de protection possibles. [br/]Le jeudi après-midi et le vendredi seront consacrés à la préparation et à la présentation d'exposés synthétisant leur travail.[br/][br/]",
      "Forme du contrôle":"[br/]Lors de la présentation du vendredi après-midi, chaque étudiant contribuera à une des parties de l'exposé de son groupe. [br/]Les exposés sont illustrés par Powerpoint. [br/]A cet effet, chaque groupe devra disposer d'un appareil photo numérique et d'un ordinateur portable lors des travaux de terrain. [br/]Un rapport final par groupe, résumant les résultats acquis et les propositions faites, sera rédigé et remis (rendu 1 ou 2 semaines après la semaine ENAC).[br/]",
      "Objectifs d'apprentissage":"Cette semaine, en prise directe avec la réalité du territoire et avec les divers dangers naturels qui affectent les zones de montagne et leur développement,[br/]vise à sensibiliser les étudiants des trois sections aux nécessités d'identification et de gestion des risques induits par les avalanches, les chutes de blocs et les laves torrentielles. [br/]Elle doit conduire les étudiants à une analyse de l'organisation spatiale des territoires affectés et à des propositions concrètes pour prendre en compte ces dangers dans l'aménagement local.[br/][br/]"
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Gestion des territoires affectés par des dangers naturels en zone de montagne",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  }
}