{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1358515467&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["ENV","269"],
    "title":"Sustainable development in the design of a residential area in Château d'Oex",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1358515467&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"SIE",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/133834",
      "name":"Buttler Alexandre"
    },{
      "url":"http://people.epfl.ch/172717",
      "name":"Graf Bernard"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Sustainable development in the design of a residential area in Château d'Oex",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/133834",
      "name":"Buttler Alexandre"
    },{
      "url":"http://people.epfl.ch/172717",
      "name":"Graf Bernard"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"L'enseignement se fait sous forme d'exposés de spécialistes, de conférences, de visites et de relevés de terrain, de travail en groupe et de présentation. Les étudiants travaillent par groupes mixtes d'étudiants ingénieurs et d'architectes de 4 personnes. Le nombre d'étudiants est limité à 20 au max. [br/]Le programme de la semaine se fait à raison de 2 jours à l'EPFL et de 3 jours à Château-d'Oex. Les étudiant(e)s logeront deux nuits sur place à Château-d'Oex. [br/][br/] ",
      "Contenu":"Les étudiants sont placés devant un cas de figure pratique qui touche de plus en plus nos régions. Les buts pédagogiques de la semaine sont les suivants: -Apprendre \"à lire\" une région et à intégrer l'ensemble des facteurs nécessaires à la réalisation d'une étude pluridisciplinaire. -Etablir une synthèse des différents paramètres économiques, environnementaux et architecturaux d'une région. -effectuer des relevés architecturaux et paysagers. -Imaginer un scénario de développement d'un quartier résidentiel et évaluer ses impacts en matière de développement durable. -Etablir un poster de présentation A0: analyse et idées fortes du concept développé. -Présenter et défendre oralement dans un temps imparti le concept et ses éléments en matière de développement durable [br/][br/] ",
      "Forme du contrôle":"A la fin de la semaine, chaque groupe rend un poster A0 présentant leur projet de développement d'un quartier et le présente oralement. La réflexion ayant servi à l'établissement du projet doit être clairement explicitée. L'évaluation du travail est fondée sur les critères suivants: [br/]-30 % travail sur le terrain (organisation du travail de groupe, esquisses, sens pratique); -30 % poster (contenu, graphisme, présentation); -40% présentation orale du poster et discussion. Les travaux se font par groupe de 4 étudiants, mais le premier critère permet une évaluation individuelle. [br/]",
      "Objectifs d'apprentissage":"Avec les changements climatiques et la demande croissante de logements, les régions alpines et préalpines, doivent faire face à de nombreux défis: diminution de l'enneigement, augmentation des dangers naturels, évolution et mitage du paysage, concentration des activités économiques vers des centres, développement important de la construction de chalets et appartements de vacances, etc. Or une question se pose: comment une région de montagne à l'image de Château-d'Oex peut-elle poursuivre son développement économique et touristique tout en respectant l'environnement naturel et construit ? Les possibilités de développement sont conditionnées par de nombreux paramètres dont il est nécessaire de tenir compte: -Dangers naturels: avalanches, glissements de terrain, inondation, lave torrentielle, ... -Infrastructure de transport et de protection: routes, ponts, paravalanches, correction de torrents,... -Mobilité -Architecture entre tradition et innovation ... -Réchauffement climatique et évolution du paysage -Politique énergétique -Economie régionale et tourisme C'est dans ce contexte que les étudiants vont être amenés à analyser différents paramètres et à établir un bilan global de la région de Château-d'Oex. Ils devront ensuite proposer une variante de développement d'un quartier résidentiel en tenant compte des critères du développement durable. [br/][br/] "
    },
    "practical":{
      "total_hours":41
    },
    "language":"Français",
    "title":"Le développement durable dans la conception d'un quartier résidentiel à Château d'Oex",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  }
}