{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1400346043&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["ENV","275"],
    "title":"Sustainable Development of city and landscape of DAVOS considering aspects of building infrastructure, energy production and natural hazards in its natural Alpine environment",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1400346043&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"SIE",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/148669",
      "name":"Ancey Christophe"
    },{
      "url":"http://people.epfl.ch/103938",
      "name":"Andersen Marilyne"
    },{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    },{
      "url":"http://people.epfl.ch/168453",
      "name":"Huwald Wolf Hendrik"
    },{
      "url":"http://people.epfl.ch/167659",
      "name":"Lehning Michael"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    },{
      "url":"http://people.epfl.ch/161444",
      "name":"van der Woude Wynd"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":{
      "total_hours":41
    },
    "language":"English",
    "title":"Sustainable Development of city and landscape of DAVOS considering aspects of building infrastructure, energy production and natural hazards in its natural Alpine environment",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/148669",
      "name":"Ancey Christophe"
    },{
      "url":"http://people.epfl.ch/103938",
      "name":"Andersen Marilyne"
    },{
      "url":"http://people.epfl.ch/173997",
      "name":"Dietz Dieter"
    },{
      "url":"http://people.epfl.ch/168453",
      "name":"Huwald Wolf Hendrik"
    },{
      "url":"http://people.epfl.ch/167659",
      "name":"Lehning Michael"
    },{
      "url":"http://people.epfl.ch/156272",
      "name":"Tirone Chabert Barbara"
    },{
      "url":"http://people.epfl.ch/161444",
      "name":"van der Woude Wynd"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"[br/]Groupe d'enseignement de la SE - en spécifiant les noms, prénoms et statuts (employé interne EPFL, externe, assistant, autre)[br/]1) Michael Lehning, Professor and Director CRYOS, intern[br/]2) Christophe Ancey, Professor and Director LHE, intern[br/]3) Marilyne Anderson, Professor and Director LIPID, intern[br/]4) Dieter Dietz, Professor and Director ALICE, intern[br/]5) Hendrik Huwald, Scientist EFLUM, intern[br/]6) Van der Woude Wynd, Architect ALICE, intern[br/]7) Betty Sovilla, Scientist SLF, extern[br/]8) Nicholas Dawes, Scientist SLF, extern[br/]9) Stefan Horender, Scientist SLF, extern[br/]10) Technical Staff SLF, extern[br/]",
      "Contenu":"[br/]The content of the week will be structured in three phases :[br/]1) Introduction to the current status of architecture, natural hazards protection and energy production in Davos[br/]\t\t1.1 : Visit sun tracker and SLF building for photovoltaic energy production[br/]\t\t1.2 : Davos lake and local hydropower production[br/]\t\t1.3 : Klosters flood protection reservoir and avalanche deflection dam[br/]\t\t1.4 : Avalanche protection constructions[br/]\t\t1.5 : Davos building laws and Davos flat roof versus Chalet constructions[br/]\t\t1.6 : SLF cold wind tunnel for studies on wind energy production[br/]\t\t1.7 : Natural snow distribution versus snow farming and artificial snow production[br/][br/][br/][br/][br/]2) Establishment of a concept of energy-autonomous and safe infrastructure in Davos[br/]\tThe students work together in groups and address a specific problem of development in the landscape of Davos. The focus in on multi-use functionality and sustainability with respect to materials and energy consumption during construction and over the whole lifetime. Examples include :[br/]\ti) Renovation of existing infrastructure by improving insolation and better use of light effects for comfort and energy optimazation (passive heating through windows)[br/]\tii) Establishment or renovation of avalanche protection construction with a contempory use as basis for solar panels (photovaltaic).[br/]\tiii) Optimazation project of hydropower production in the landscape Davos[br/]\tiv) Snow management in the landscape of Davos between snow farming, artificial snow production and relocation[br/][br/][br/]3) Building of a model[br/]\tBased on the concept developed under point 2), the groups develop a model or mock-up demonstrating the idea and as a first feasibility study. Simplified versions of the model are allowed. The model can be a numerical model, a GIS model (e.g. for hydropower potential studies) or (most likely) a real object such as a house or any other infrastructure. An example may be the construction of a mountain pass and the study of the speed-up effect in the SLF wind tunnel. A second example is the building of a mock-up for a Davos house and testing in the cold labs its energy efficiency under diverse climate conditions. For the work, the students have access to the SLF infrastructure such as the workshop, the cold labs or the wind tunnel. [br/]",
      "Objectifs d'apprentissage":"The semaine ENAC at DAVOS offers a true interdisciplinary learning experience, in which aspects of landscape development are jointly looked at from the perspectives of natural hazards and civil engineering, architecture and important factors of the natural environment. The main objectives are the following :[br/]\t1) The students learn about the complex interactions of society, infrastructure and environment in a touristic town planted in a comparatively pristine mountain environment.[br/]\t2) The students develop a managable project concept given the limited amount of time and resources[br/]\t3) From the concept, the students design an own development case, in which the diverse aspects of the theme are represented.[br/]\t4) The students learn to justify their approach and to defend it it front of their colleagues.[br/]"
    },
    "practical":{
      "total_hours":41
    },
    "language":"English",
    "title":"Sustainable Development of city and landscape of DAVOS considering aspects of building infrastructure, energy production and natural hazards in its natural Alpine environment",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "total_hours":10
    },
    "library_recommends":null,
    "lecture":null
  }
}