{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194470&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["ENV","364"],
    "title":"Environmental entrepreneuship course",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639194470&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"SIE",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/121849",
      "name":"Holliger Christof"
    },{
      "url":"http://people.epfl.ch/145400",
      "name":"Vogt Marc"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Environmental entrepreneuship course",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/121849",
      "name":"Holliger Christof"
    },{
      "url":"http://people.epfl.ch/145400",
      "name":"Vogt Marc"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Forme d'enseignement :[br/]Fondé sur une démarche interactive, cet enseignement s'appuie sur des cours théoriques complémentés par des intervenants, ainsi que des ateliers liés à une interface web novatrice.[br/][br/]Contributions des étudiants:[br/]Le cours  est construit de manière à ce que les étudiants interagissent et collaborent entre eux, et possiblement avec des acteurs de terrain (industriels, administrations, législateurs, etc.) pour faire émerger des solutions efficaces à des problèmes concrets.  Pour cela, les étudiants seront amenés à contribuer à une plateforme wiki dédiée au cours, mais aussi à évaluer les contributions de leurs pairs et selon les exigences fixées par l'enseignant, selon le principe de peer-review scientifique. Toutes les actions (contributions & évaluations)  sur cette plateforme sont enregistrées en vue de l'évaluation du travail final. Par souci de transparence et pour une meilleure évaluation, toutes les contributions sont évidemment accessibles comme un bien collectif à tous les étudiants prenant part au cours.[br/][br/]",
      "Forme du contrôle":" Résultat attendu et notation :[br/]A la fin du cours, les étudiants font une présentation d'une idée de business sous forme d'un rapport de projet pouvant, par la suite, être développé tout au long du cursus académique de l'étudiant (dans notre cas l'ENAC). L'idée est de pousser l'étudiant à développer plus en profondeur son projet en participant aux divers programmes au sein de l'EPFL, permettant de créer une entreprise ou une autre forme d'organisation adaptée à la réalisation du projet.[br/][br/]La notation du cours sera basée sur 3 axes qui sont :[br/]-\tLa participation et la collaboration au contenu des projets (qualité et quantité du contenu, fréquence d'interactivité avec d'autres projets, etc...)  [br/]-\tLa qualité des projets finaux évaluée selon des critères spécifiques (i.e. structure, pertinence du sujet, lisibilité, qualité de la solution)[br/]-\tLa présentation orale du projet (originalité, contenu, structure, etc...)[br/]Derrière ces trois axes, l'idée est de pouvoir, d'une part, donner une note sur tout le processus de la création des projets et non pas seulement sur la qualité des projets fournis en fin de cours, de l'autre, noter l'interactivité et la collaboration avec d'autres agents afin de mesurer l'esprit d'entreprenariat et d'innovation.[br/][br/]",
      "Objectifs d'apprentissage":"Introduction :[br/]Apprendre à entreprendre. Bon nombre d'étudiants viennent à l'EPFL pour faire des études d'ingénieur, et ainsi se préparer à contribuer à l'amélioration de la société dans la discipline de leur choix. Pour cela, le monde a besoin d'ingénieurs et de chercheurs capables d'identifier des problèmes, de les résoudre, et de mettre en ½uvre des solutions soutenables à travers des méthodes entrepreneuriales adaptées. En prenant comme cas concret la nécessité d'une société plus respectueuse de son environnement et l'émergence d'une économie verte à grande échelle, ce cours est pour les étudiants un parcours initiatique au monde entrepreneurial qui vise à leur faire découvrir et expérimenter les étapes clés allant de la recherche et l'identification d'un problème, de l'innovation à la créativité nécessaires à l'émergence de solutions et de l'interaction sociale couplé au développement de l'intelligence collective pour les concrétiser. Il traite aussi du cadre opérationnel nécessaire pour mettre en ½uvre ces dernières au travers d'une start-up, d'une fondation ou toute autre forme d'organisation adaptée à la réalisation du projet, sans toutefois aller dans le même niveau de détail que les cours de business plans déjà délivrés durant le cursus universitaire à l'EPFL (e.g. VentureLab). [br/][br/]Objectifs du cours: [br/]Ce cours couvre les étapes précédant l'élaboration d'un business model et d'un business plan. Il permet de développer une approche intuitive et pragmatique, afin de stimuler la fibre entrepreneuriale des étudiants, en reconnaissant que l'identification correcte d'un problème pratique est la condition nécessaire - mais pas suffisante - de toute entreprise à succès. Pour cela, les étudiants doivent aussi développer une culture du partage et de la confrontation constructive (peer-review) essentielle au mûrissement d'idées, de problèmes et de solutions possibles. Ces points sont développés tout au long du cours et seront focalisés sur les thématiques et cursus liés à l'ENAC. [br/][br/]Les objectifs du cours pour les étudiants sont :[br/]-\tAvoir une vue d'ensemble du marché économique lié au domaine de l'environnement dans le monde, et plus[br/]\tparticulièrement en Suisse.[br/]-\tIdentifier les problèmes environnementaux, et concevoir des solutions durables et économiquement rentables, qui[br/]\tpourront finalement se concrétiser à travers une idée de business.[br/]-\tComprendre les processus d'innovation permettant d'élaborer une idée de business. [br/]-\tAcquérir les compétences entrepreneuriales permettant de concrétiser une idée de business. [br/]-\tDéfinir la pertinence de l'idée de business par rapport aux besoins du marché.[br/]-\tAcquérir une approche pluridisciplinaire et favoriser le partage de connaissances et compétences. [br/]-\tSavoir utiliser les modèles et outils mis à disposition pour structurer son projet et savoir trouver les informations [br/]\ty relatives.[br/]-\tPouvoir présenter son idée de business à des tiers.[br/][br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Cours d'entreprenariat environnemental",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}