{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=41373004&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["ENV","362"],
    "title":"Urban neighborhoods, infrastructures and sustainable development",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=41373004&ww_x_anneeAcad=2012-2013&ww_i_section=69034007&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"ENAC",
    "program":"GC",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/106368",
      "name":"Scartezzini Jean-Louis"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Urban neighborhoods, infrastructures and sustainable development",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://enac.epfl.ch/page-25475.html","http://enac.epfl.ch/page-25475.html"]],
    "instructors":[{
      "url":"http://people.epfl.ch/106368",
      "name":"Scartezzini Jean-Louis"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"L'unité d'enseignement bénéficiera de l'expérience d'un bureau d'architecture[br/]de grande renommée internationale :[br/]Rogers Stirk Harbour + Partners[br/]L'objet d'étude de l'édition du printemps 2013 portera sur l'aménagement d'un site particulier au coeur de la ville de Lausanne: le quartier du Vallon. Ce quartier,[br/]qui au XIXe siècle abritait des bains liés à une source ferrugineuse, fait l'objet d'une remise en valeur de la part de la Municipalité. Une démarche participative a eu lieu en 2010, afin de cerner les attentes des habitants; la concrétisation d'un plan directeur pourrait voir le jour bientôt.[br/]Le projet de l'UEE 03 comprend la réalisation d'unéco-quartier avec des activités mixtes, une zone delogements sur l'ancien site d'incinération, une maisonde quartier, des commerces. L'intégration de « l'eau »dans le quartier, souhait issue de la démarche participative, sera pris en compte au travers la proposition des aménagements urbains et d'une piscine.",
      "Contenu":"Contenu[br/]La planification des quartiers urbains implique des décisions importantes qui ont un impact sur le développement durable. La consommation de ressources non renouvelables par un bâtiment est ainsi influencée par la disponibilité des ressources naturelles qui dépendent à leur tour de la proximité d'autres bâtiments. Des synergies peuvent être obtenues entre ces derniers (la chaleur expulsée par un bâtiment peur servir de source pour un autre) et entre ressources (énergie dérivée des déchets). La planification urbaine influence également l'habitat naturel et l'organisation des transports et de la circulation à l'intérieur des quartiers et vers l'extérieur.[br/]Les économies d'échelle améliorent la viabilité des énergies renouvelables et des technologies efficientes en énergie (cogénération).[br/]Cette Unité d'Enseignement ENAC vise à présenter ces nouvelles notions ainsi que leur mise en oeuvre lors de la planification durable de quartiers urbains. Un nouvel outil de modélisation numérique (Citysim) sera également utilisé dans ce cadre.[br/]Thématiques :[br/]Principes du développement urbain durable[br/]Conception et planification urbaine[br/]Gestion des eaux[br/]Ecologie du paysage[br/]Réduction des besoins en énergie[br/]Transport urbain[br/]Stockage et approvisionnement en énergie[br/]Gestion des matériaux et des déchets[br/]",
      "Forme du contrôle":"Le travail pratique consiste en l'élaboration d'un plan de quartier selon les principes du développement durable et à son approfondissement dans le cadre d'un travail de groupe interdisciplinaire. Chaque groupe choisira l'un des thèmes traités pendant le cours et remettra un rapport final qui illustre à la fois la démarche du projet et l'approfondissement du thème choisi.[br/]L'évaluation se fera sur la base de comptes-rendus présentés lors des séminaires et de la présentation du rapport final.[br/][br/]Enseignants[br/]Responsables : Jean-Louis Scartezzini, professeur[br/](LESO-PB), Dr. Jérôme Kaempf, physicien, adjoint[br/]scientifique (LESO-PB), Dr. Paola Tosolini, architecte[br/](LESO-PB) // André Gilles Dumont, professeur[br/](LAVOC), David Hofstetter, ingénieur (LAVOC),[br/]Christian Ludwig, professeur (SSIE), Dr. Géraldine[br/]Bullinger biologiste (ECOS), Dr. Luca Rossi ingenieur (ECOL)[br/][br/]Experts externes:[br/]Rogers Stirk Harbour + Partners, Londres[br/]Anouk Paltani Baumann, architecte-urbaniste[br/]responsable projet « Revalorisation du quartier du Vallon », Ville de Lausanne[br/]Christophe Gnaegi, TRIBU architecture[br/][br/]Coordination: Dr. Paola Tosolini (LESO-PB)",
      "Objectifs d'apprentissage":"Connaître les principes de la planification urbaine durable[br/]Etre à même de développer un projet de quartier urbain compte tenu des enjeux du développement durable[br/]Savoir intégrer les différentes composantes de la planification urbaine durable (conception architecturale des bâtiments, infrastructures de transport, aménagements hydrauliques et écosystèmes anthropisés)[br/]Se familiariser avec les outils de modélisation numérique en vue d'optimiser la durabilité des quartiers urbains"
    },
    "practical":null,
    "language":"Français",
    "title":"Quartiers urbains, infrastructures et aménagements durables",
    "recitation":{
      "week_hours":3,
      "weeks":12
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":12
    }
  }
}