{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=652076651&ww_x_anneeAcad=2012-2013&ww_i_section=942953&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["ENV","597"],
    "title":"Engineering internship credited with Project master (master in Environmental sciences and engineering)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=652076651&ww_x_anneeAcad=2012-2013&ww_i_section=942953&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SIE",
    "program":"SIE",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126096",
      "name":"Profs divers *"
    },{
      "url":"http://people.epfl.ch/106401",
      "name":"Schwitzguebel Jean-Paul"
    }],
    "lab":null,
    "credits":null,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"All students enrolled in the SIE Masters Program from autumn 2011 have to do an Engineering Internship outside the academic world for a period lasting at least 8 weeks. The internship has to be done between the end of the successful Bachelor cycle and the beginning of the Master project.[br/]Internships aim to give the students the opportunity to immerse into the professional world, and to familiarize with different aspects of the working life. They should also allow the students to put their theoretical knowledge into practice and to develop the interpersonal skills necessary for their career. [br/][br/]",
      "Content":"Internship must be carried out in Switzerland or abroad, in a private company or public administration; environmental engineering study offices, consulting firms; private or public R&D institutes; industrial or tertiary sector; NGOs, private or public institutions for the protection of environment; etc.[br/]The student has the responsibility to choose the topic and place of his internship, on the basis of his personal contacts or of the propositions made by companies and accepted by the SIE program.[br/]",
      "Form of examination":"The student is supervised and evaluated by a member of the company and an ENAC internal teacher. At the end of the internship, the student must write a technical and/or scientific report, assessed by the company internship supervisor and the ENAC internal teacher, who will decide if the student passed or failed. No mark is given for the internship, but student has to pass both the Engineering Internship and the Master Project to gain the 30 ECTS credits allocated to the last semester of the Master cycle."
    },
    "practical":{
      "total_hours":320
    },
    "language":"Français",
    "title":"Engineering internship credited with Project master (master in Environmental sciences and engineering)",
    "recitation":null,
    "exam_form":"Term paper",
    "project":null,
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/126096",
      "name":"Profs divers *"
    },{
      "url":"http://people.epfl.ch/106401",
      "name":"Schwitzguebel Jean-Paul"
    }],
    "lab":null,
    "credits":null,
    "semester":"Automne",
    "free_text":{
      "Contenu":"Le stage doit s'effectuer en entreprise, en Suisse ou à l'étranger: bureau d'études, de conseil et d'ingénierie; industrie ou secteur tertiaire; ONG ou office de l'environnement; institut de recherche public ou privé ne délivrant pas de diplôme universitaire; service public ou administration; etc.[br/]Le choix de l'entreprise et du stage est laissé à l'étudiant, sur la base de contacts personnels ou des offres de stage proposées par les entreprises et validées par la Section SIE.[br/]",
      "Forme du contrôle":"L'étudiant en stage est suivi et évalué par un enseignant de l'ENAC (Tuteur de stage) et par un Maître de stage dans l'entreprise. Le travail réalisé fait l'objet d'un rapport technique et/ou scientifique qui est évalué par le Maître de stage et par le Tuteur de stage, qui décide si l'étudiant a réussi ou échoué.[br/]Aucune note n'est attribuée, mais l'étudiant doit avoir réussi son Stage d'ingénieur et son Projet de Master pour obtenir les 30 crédits ECTS attribués au dernier semestre du cycle Master.[br/]",
      "Objectifs d'apprentissage":"Un Stage d'ingénieur d'une durée minimale de 8 semaines, hors du domaine académique, est obligatoire pour tous les étudiants commençant leur cycle Master dès le semestre d'automne 2011. [br/]Il doit être accompli entre la fin du cycle Bachelor, qui doit être réussi, et le début du Projet de Master. Le stage a pour objectifs l'immersion de l'étudiant dans le monde professionnel, sa sensibilisation au travail en équipe, sa familiarisation aux processus de l'entreprise et aux exigences de la profession d'ingénieur en environnement. L'étudiant testera ainsi ses compétences et mettra en pratique ses connaissances théoriques.[br/]"
    },
    "practical":{
      "total_hours":320
    },
    "language":"Français",
    "title":"Stage d'ingénieur crédité avec le PDM (master en Sciences et ingénierie de l'environnement)",
    "recitation":null,
    "exam_form":"Mémoire",
    "project":null,
    "library_recommends":null,
    "lecture":null
  }
}