{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215248&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=fr",
    "code":["HUM","116"],
    "title":"History of sciences and contemporary inheritances",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215248&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"prop"
  },
  "en":{
    "coefficient":0.5,
    "links":[["https://documents.epfl.ch/groups/s/sh/shs1-histoire/public","https://documents.epfl.ch/groups/s/sh/shs1-histoire/public"]],
    "instructors":[{
      "url":"http://people.epfl.ch/229220",
      "name":"Glardon Philippe"
    }],
    "lab":null,
    "credits":null,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"History of sciences and contemporary inheritances",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":0.5,
    "links":[["https://documents.epfl.ch/groups/s/sh/shs1-histoire/public","https://documents.epfl.ch/groups/s/sh/shs1-histoire/public"]],
    "instructors":[{
      "url":"http://people.epfl.ch/229220",
      "name":"Glardon Philippe"
    }],
    "lab":null,
    "credits":null,
    "semester":"Automne",
    "free_text":{
      "Remarque":"Le cours est donné ex cathedra avec un support Powerpoint. Des plages de réflexion et d'échange sont prévues en cours de semestre ainsi qu'un répétitoire pour préparer à l'examen.[br/][br/]Cet enseignement est ouvert à toute personne curieuse de connaître les origines de la science moderne pour mieux comprendre les problèmes actuels auxquels elle est confrontée. Il s'adresse plus particulièrement aux étudiants-e-s que leur formation amènera à gérer les défis sociaux, politiques et écologiques posés par les sciences de la vie et les questions environnementales, ainsi qu'à ceux qu'intéresse l'histoire de la géologie et des sciences naturelles.[br/][br/]Langues possibles d'échange avec les étudiants : français, allemand, anglais.[br/][br/][b]Enseignant(s)[/b] :[br/]Philippe Glardon, coordinateur (Ecole de biologie, UNIL), intervenants extérieurs.",
      "Bibliographie et matériel":"Plan détaillé, références bibliographiques (livres, articles, sites web), dossier de cours en pdf déposés sur MyEpfl (lien ci-dessous).",
      "Mots clés":"Histoire des sciences - histoire des mentalités - histoire naturelle - sciences naturelles et société - histoire de la notion d'environnement - écologie - vulgarisation scientifique.",
      "Forme d'enseignement":"Ex-cathedra. Intervenants externes. Discussion.",
      "Contenu":"[b]Sciences et sociétés d'hier et d'aujourd'hui : continuité ? tensions ? ruptures? Regard et réponses de l'histoire des sciences[/b][br/][br/]Le but général du cours est d'acquérir un bagage théorique en histoire des sciences et, par là, les outils pour conduire une réflexion sur les enjeux de la science moderne et ses rapports complexes et parfois ambigus avec la société, en particulier autour des questions environnementales.[br/][br/]Le cours se divise en trois parties :[br/]1. Présentation de l'évolution de l'histoire des sciences et de quelques concepts fondamentaux de cette discipline.[br/]2. Présentation du développement de la science moderne à travers l'exemple de la connaissance de l'histoire de la terre.[br/]3. Analyse historique des relations entre la science et la société au travers de la notion d'environnement en Suisse et dans le monde.",
      "Forme du contrôle":"QCM en semestre (avec textes et documents de référence dans le dossier d'examen mis à disposition le jour de l'évaluation).",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/][li]Maîtriser quelques notions théoriques autour de l'histoire des sciences et de son évolution.[br/][li]Situer dans le temps quelques grands noms et étapes du développement de la science.[br/][li]Identifier des thématiques de l'histoire des idées scientifiques dans des textes ou des documents-sources.[br/][li]Analyser les idées-forces d'un texte ou d'un document-source et les mettre en lien avec les thématiques vues au cours.[br/][li]Etablir des liens entre les problématiques scientifiques actuelles, leur origine et leurs enjeux sociaux, politiques et économiques.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire des sciences et héritages contemporains",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}