{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215866&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=fr",
    "code":["HUM","115"],
    "title":"Current economic issues and theories",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215866&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"prop"
  },
  "en":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/190153",
      "name":"Bendahan Samuel"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Current economic issues and theories",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/190153",
      "name":"Bendahan Samuel"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"Coordinateur : Samuel Bendahan[br/]Enseignants : Samuel Bendahan (EPFL), divers intervenants issus de la pratique et du terrain, ainsi que des enseignants de plusieurs disciplines académiques.",
      "Bibliographie et matériel":"Sera annoncé ultérieurement. Le matériel principal sera une série d'articles de journaux issus de l'actualité qui seront discutés en classe. ",
      "Mots clés":"Economie - finance - management - comptabilité - politique - environnement - société - leadership",
      "Forme d'enseignement":"Cours ex cathedra et intervention (cf. contenu du cours)",
      "Contenu":"[b]Une approche critique et scientifique de l'actualité marquée par les enjeux économiques et sociaux[/b][br/][br/]L'objectif principal du cours est de donner les outils pour comprendre et analyser de façon critique l'actualité, particulièrement sur les questions économiques. Le cours comporte trois types d'interventions : des interventions théoriques, des présentations et discussion autour de l'actualité, ainsi que des interventions externes de personnes liées à la pratique.[br/][br/][u]Théorie[/u] : Les interventions théoriques viseront à donner aux étudiant-e-s les outils pour comprendre l'actualité économique dans les domaines suivants :[br/]- Marchés financiers, instruments financiers, bourse.[br/]- Fonctionnement et création d'entreprises, entrepreneuriat.[br/]- Politiques économique, économie nationale et internationale.[br/]- Systèmes sociaux et de santé, service public, état.[br/]- Organisations internationales, ONG, gouvernance publique multilatérale, géopolitique.[br/][br/][u]Actualité[/u] : Le contenu des sessions basées sur l'actualité sera déterminé en fonction de celle-ci, mais utiliseront les outils théoriques présentés. Si le cours avait eu lieu en 2011, les thématiques suivantes auraient pu être abordées :[br/]- La crise du franc fort, et l'impact sur la Suisse et les autres pays des crises monétaires[br/]- Les crises des dettes publiques[br/]- La sortie du nucléaire et l'avenir énergétique[br/]- Les licenciements et délocalisations et la promotion économique[br/]- Les élections fédérales et au Conseil Fédéral[br/]- Les révolutions et le « printemps arabe »[br/]- La création et la croissance des entreprises innovantes (avec comme exemples Apple, Facebook, Google, etc...)[br/]- Les grands leaders économiques et politiques[br/]- La « fraude » dans le domaine économique[br/][br/][u]Interventions externes[/u] : Le but de ces interventions est de donner une vision de la pratique dans différents domaines économiques discutés (Marché, Ecologie, Energie, Systèmes, Etat, etc...), avec des prestations de personnes issues de la pratique (chefs d'entreprise ou praticiens, politiciens de différents bords, etc...) [br/][br/][u]Plan du cours[/u] :[br/]Le plan exact sera développé en fonction de l'actualité. Les sessions théoriques et les interventions extérieures seront annoncées ultérieurement.[br/]",
      "Forme du contrôle":"QCM en semestre",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/]- Comprendre l'actualité économique[br/]- Comprendre les mécanismes majeurs des récentes crises économiques[br/]- Connaître le marché du travail et comprendre le rôle qu'ils/elles pourront y avoir[br/]- Comprendre le système économique actuel[br/]- Savoir comment se passe la création d'entreprise[br/]- Connaitre les grands enjeux énergétiques et écologiques contemporains, notamment du point de vue économique[br/]- Comprendre et avoir un avis sur la politique internationale et les institutions internationales[br/]- Comprendre le système de santé suisse et la logique des systèmes de santé[br/]- Comprendre et avoir un avis sur différents éléments d'actualité survenus pendant la période de cours et discutés en classe[br/]- Comprendre en profondeur les enjeux derrière une série d'éléments d'actualité qui se seront passé durant le semestre[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Actualité et théories économiques",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}