{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898384212&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=fr",
    "code":["HUM","104"],
    "title":"Knowledge from every angle",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=898384212&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"prop"
  },
  "en":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/185819",
      "name":"Preissmann Delphine"
    }],
    "lab":null,
    "credits":null,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Knowledge from every angle",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/185819",
      "name":"Preissmann Delphine"
    }],
    "lab":null,
    "credits":null,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Coordinatrice :[/b][br/]Delphine Preissmann (Institut de psychologie, UNIL)[br/][br/][b][i]Enseignants :[/b][/i][br/]Aude Billard (LASA, EPFL), Alain Clémence (Institut des sciences sociales, UNIL), Fabrice Clément (Centre de Sciences Cognitives, UNINE), Jacques Lévy (ENAC, EPFL), Lucienne Peiry (Collection de l'Art Brut), Francesco Panese (CDH, EPFL - ISCM, UNIL), Delphine Preissmann (Institut de psychologie, UNIL).",
      "Bibliographie et matériel":"Références données pendant le cours.",
      "Mots clés":"Connaissance - Histoire - Psychologie - Culture - Cognition - Tests - Apprentissage.",
      "Forme d'enseignement":"Présentations ex-cathedra. Discussions. Répétitoire pour préparer à l'examen.",
      "Contenu":"[b]Dimensions historiques, sociales et psychologiques de la connaissance[/b][br/][br/]Les professions d'ingénieur et de chercheur sont liées à la production de connaissances. Cet enseignement apporte une réflexion sur les nombreuses questions soulevées par la nature et la variété de ces connaissances, qu'elles soient générales ou scientifiques, en mobilisant différentes approches disciplinaires: histoire, psychologie, sociologie, neurosciences. Ces différentes disciplines sont invitées à rendre compte de la multiplicité des processus de connaissance dans leurs manifestations quotidiennes, sociales, scientifiques et artistiques.[br/][br/]La première partie du cours est consacrée à un cadrage de la question de la connaissance selon des perspectives historique, psychologique et anthropologique. [br/]La deuxième partie aborde des champs d'applications particuliers, comme la connaissance artistique ou sociale, le lien entre connaissance humaine et habileté technique, ou encore l'interaction avec des robots.",
      "Forme du contrôle":"QCM en semestre",
      "Objectifs d'apprentissage":"Après avoir suivi ce cours, l'étudiant-e doit être capable de :[br/][li]Identifier les différences et les similitudes entre les connaissances scientifiques et de sens commun.[br/][li]Situer la production des connaissances et leurs usages en fonction des contextes historiques, sociaux, anthropologiques et psychologiques.[br/][li]Décrire les processus cognitifs à l'oeuvre dans les activités de connaissance et les biais qui peuvent être présents dans la recherche scientifique.[br/][li]Etablir des liens entre des processus généraux et des champs particuliers de diverses formes de connaissance touchant tant la science que les compétences sociales ou artistiques."
    },
    "practical":null,
    "language":"Français",
    "title":"La connaissance dans tous ses états",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}