{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=405237425&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=fr",
    "code":["HUM","106"],
    "title":"Brain, mind and society",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=405237425&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"prop"
  },
  "en":{
    "coefficient":0.5,
    "links":[["http://moodle.epfl.ch/course/view.php?id=11141.","http://moodle.epfl.ch/course/view.php?id=11141."]],
    "instructors":[{
      "url":"http://people.epfl.ch/210326",
      "name":"Bovet Emilie"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Brain, mind and society",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":0.5,
    "links":[["http://moodle.epfl.ch/course/view.php?id=11141.","http://moodle.epfl.ch/course/view.php?id=11141."]],
    "instructors":[{
      "url":"http://people.epfl.ch/210326",
      "name":"Bovet Emilie"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"Cet enseignement s'adresse particulièrement aux étudiants-e-s de Sciences de la vie et plus largement à celles et ceux qui sont intéressé-e-s par les recherches sur le cerveau.[br/][br/]Langues possibles d'échange avec les étudiant-e-s : français, anglais, espagnol [br/][br/][b]Coordinatrice[/b]: Emilie Bovet[br/][b]Enseignant(s)[/b] :[br/]Vincent Barras (Institut universitaire d'histoire de la médecine et de la santé publique/UNIL), Emilie Bovet (Institut des sciences sociales/ UNIL), Fabrice Clément (Sciences de l'information et de la communication/UNINE), Francesco Panese (Collège des humanités/EPFL, Institut des sciences sociales/ UNIL), Delphine Preissmann (Institut de psychologie et département de psychiatrie/ UNIL), Christian Sachse (Section de philosophie/ UNIL).  [br/]",
      "Bibliographie et matériel":"Beaulieu, Anne (2002) « Images are not the (only) truth: iconoclasm, visual knowledge and experimentation in brain mapping », Science, Technology and Human Values, Vol. 21(1) 53-86.[br/]Ehrenberg, Alain (2004). « Le sujet cérébral », ESPRIT, 130-155.[br/]Panese, Francesco (2009). « The neural basis of what ? Discontents in defining \"human nature\" », Front. Hum. Neurosci. 3:41. doi: 10.3389/neuro.09.041.2009 [br/]Vidal, Fernando (2005). « Le sujet cérébral, une esquisse historique et conceptuelle », PSN: psychiatrie, sciences humaines, neurosciences, 3,11, pp. 37-47. En ligne: www.brainhood.net/onlinetexts/PSN.pdf[br/]Conférence de Catherine Vidal \"Le cerveau a-t-il un sexe\" : http://www.ibbtev.be/?Video-Le-cerveau-a-t-il-un-sexe.[br/][br/]Les diapositives des interventions, l'introduction aux différentes thématiques ainsi que les articles dont la lecture est recommandée sont disponibles en ligne. ",
      "Mots clés":"Sciences du cerveau - reconfigurations sociales - interdisciplinarité - neurosciences sociales",
      "Forme d'enseignement":"Des enseignant-e-s de différents domaines (sociologie et histoire des sciences, psychiatrie, philosophie, psychologie) interviennent sur cinq thématiques spécifiques (cf plan du cours). ",
      "Contenu":"[b]Comment les neurosciences reconfigurent nos comportements et nos pratiques[/b][br/][br/]Les objectifs généraux du cours sont :[br/]- Poser les principaux jalons de l'histoire scientifique et culturelle de la compréhension du cerveau.[br/]- Analyser des thématiques spécifiques liées aux recherches, aux débats et parfois aux controverses sur les causes cérébrales des actions humaines.[br/]- Comprendre comment l'étude neuroscientifique des relations entre cerveau et esprit reconfigure des éléments traditionnellement étudiés par d'autres disciplines : comportement sociaux ; individualité et singularité des sujets humains ; jugement moral et libre-arbitre ; maladie mentale.[br/]- Aborder de manière complémentaire les grands enjeux liés aux différentes manières de concevoir le rapport entre le social, le psychologique et le physique.[br/][br/]Depuis bientôt deux décennies, les neurosciences connaissent un essor toujours plus important. Désormais, leurs domaines de recherche s'étendent également aux fonctions supérieures liées aux activités complexes des sujets humains (cognition, émotions, comportements). Ce faisant, les neurosciences interrogent, voire remettent en question, nos conceptions ou nos opinions, parfois bien ancrées, sur le genre de créatures que nous sommes et sur nos raisons d'agir. Ce cours a pour objectif de donner les outils nécessaires à la mise en perspective des enjeux que suscite cette remise en question par les neurosciences de nos manières usuelles de penser l'esprit et les actions humaines. Il vise également à établir un dialogue constructif entre les sciences humaines et sociales et les neurosciences, grâce à l'intervention de professionnel-le-s provenant de différentes disciplines concernées par l'essor des sciences du cerveau. [br/]",
      "Forme du contrôle":"QCM en semestre (modalités précisées en cours)",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/]- Contextualiser l'émergence des neurosciences grâce à l'étude historique des recherches sur le cerveau.[br/]- Mettre en perspective les enjeux que suscite la remise en question par les neurosciences de nos manières usuelles de penser l'esprit et les actions humaines.[br/]- Comprendre la nécessité d'établir un dialogue constructif et pertinent entre les sciences humaines et sociales et les neurosciences dans l'étude des comportements sociaux. [br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Cerveau, esprit et société",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}