{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215967&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=fr",
    "code":["HUM","117"],
    "title":"Health, populations and society",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215967&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"prop"
  },
  "en":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/231435",
      "name":"Vader John-Paul"
    }],
    "lab":null,
    "credits":null,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Health, populations and society",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":0.5,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/231435",
      "name":"Vader John-Paul"
    }],
    "lab":null,
    "credits":null,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"[b]Enseignant(s) [/b]: John Paul Vader et des cadres académiques de l'Institut universitaire de médecine sociale et préventive de l'UNIL.",
      "Mots clés":"Santé publique - médecine sociale - populations - inégalités - démographie - épidémiologie - déterminants - études d'impact - technologies.",
      "Forme d'enseignement":"Cours ex-cathedra avec intervenants externes et supports divers.[br/]",
      "Contenu":"[b]Les grandes mutations et défis contemporains [/b][br/][br/]La santé des individus et des populations est à la base du bon fonctionnement de toute société. Les ingénieurs et chercheurs de domaines variés interviennent à leur manière dans le domaine.[br/]Ce cours examinera les déterminants de la santé des individus et des populations, sous l'angle de la santé publique, à savoir des efforts systématiques, organisés par la société pour influer sur ces déterminants afin de préserver, améliorer ou rétablir la santé.[br/]On y aborde en particulier les grandes modifications au niveau des populations qui ont un impact considérable sur l'organisation de la société (vieillissement, migrations, épidémies) ainsi que d'autres éléments de la société qui ont un impact - plus ou moins grand - sur la santé.[br/]Ce cours est conçu pour permettre à l'étudiant-e de comprendre les interactions multiples entre la santé et la société. Il pourra en tenir compte ultérieurement dans sa vie professionnelle, par exemple dans l'évaluation des nouvelles technologies pour préserver, améliorer ou rétablir la santé, ou dans l'évaluation de l'impact sur la santé de toute innovation au sens large du terme.[br/]Les thèmes suivants seront abordés :[br/][br/][i]Démographie et épidémiologie[/i][br/]- Introduction à l'épidémiologie et à la démographie, vieillissement et santé, maladies infectieuses, maladies chroniques, migrations.[br/][br/][i]Déterminants de la santé[/i][br/]- Environnement physique: eau, air habitat, urbanisme, chaîne alimentaire.[br/]- Environnement social : déterminants sociaux, richesses, éducation, mode de vie.[br/]- Nutrition et activité physique : alcool, sexe, biologie et génétique.[br/][br/][i]Organisation du système de santé[/i][br/]- Economie et protection de la santé.[br/]- Politique, évaluation technologique, étude d'impact.[br/]",
      "Forme du contrôle":"QCM en fin de semestre.",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/][li]Comprendre l'impact de la société, son organisation, ses caractéristiques et ses inégalités, sur la santé.[br/][li]Identifier les déterminants de la santé des individus et les populations et les possibilités d'influer sur eux.[br/][li]Rendre compte des principes et des bases méthodologiques de l'épidémiologie, de la démographie, de l'évaluation des technologies dans le domaine de la santé.[br/][li]Situer et décrire les enjeux des modifications du paysage épidémiologique et démographique pour l'organisation du système de santé et de la société en générale.[br/][li]Identifier et décrire les principales interactions entre santé et société."
    },
    "practical":null,
    "language":"Français",
    "title":"Santé, populations et société",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}