{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249353044&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","206"],
    "title":"Industrial design I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249353044&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218337",
      "name":"Bürgisser Olivier"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Industrial design I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218337",
      "name":"Bürgisser Olivier"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Les étudiant-e-s développent leurs projets de façon individuelle ou en groupe et bénéficient de critiques hebdomadaires pour les orienter dans les différentes étapes de conception. Ils sont conseillés sur les questions formelles, conceptuelles ou esthétiques mais aussi sur les questions plus techniques, liées à la représentation graphique et la réalisation de maquettes. L'enseignement est essentiellement pratique. Il est accompagné de cours théoriques qui posent les bases méthodologiques du projet de design industriel tout en constituant un corpus référentiel historique et contemporain par la présentation de réalisations en rapport avec le projet développé.",
      "Contenu":"Le cours propose d'expérimenter les spécificités du design industriel en confrontant les étudiant-e-s à la création d'un objet qui sera développé tout au long du semestre. Celui-ci consiste à élaborer une assise originale et singulière, tout en utilisant des matériaux simples et des techniques de mise en oeuvre élémentaires. La première partie du semestre sera consacrée à une phase de recherche, durant laquelle seront déterminés le contexte d'utilisation et les matériaux. La seconde partie du semestre sera consacrée au dessin de l'assise, à la mise au point des détails techniques et à la réalisation d'une maquette grandeur nature.",
      "Forme du contrôle":"Les projets réalisés font l'objet d'une d'une défense orale au terme du semestre, en présence du professeur et d'un expert.",
      "Remarque":"[b]Enseignant:[/b][br/]Olivier Bürgisser, professeur (ECAL)[br/][br/][red]Le cours se déroule à l'ECAL Renens.[/red][br/]L'entrée est la même que celle des locaux de l'EPFL-ECAL LAB qui se situe à l'opposé de l'entrée principale de l'ECAL. Accès en traversant le petit parking situé à l'arrière du bâtiment qui donne sur l'avenue du vingt-quatre janvier. Les salles de cours sont au deuxième étage.[br/][br/]Pour toute question pratique concernant cet enseignement, contacter le responsable SHS à l'ECAL, M. Deodaat Tevaearai (deodaat.tevaearai@ecal.ch).",
      "Objectifs d'apprentissage":"Au terme du cours l'étudiant-e sera capable de :[br/]- problématiser la création d'un objet sur la base de concepts simples et cohérents, [br/]- réfléchir en trois dimensions et communiquer ses idées au moyen des outils graphiques traditionnels, esquisses, plans, coupes et perspectives,[br/]- vérifier ses propositions par le travail en maquette."
    },
    "practical":null,
    "language":"Français",
    "title":"Design industriel I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}