{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580217054&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","252"],
    "title":"Elites and power",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580217054&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229439",
      "name":"Ginalski Stéphanie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Elites and power",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229439",
      "name":"Ginalski Stéphanie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"[b]Enseignante[/b] :[br/]Stéphanie Ginalski (IEPI, Faculté des SSP, UNIL)",
      "Bibliographie et matériel":"Les références bibliographiques seront communiquées lors de la première séance et mises en ligne sur la page moodle du cours",
      "Mots clés":"Elites, pouvoir, économie, politique, Suisse.",
      "Forme d'enseignement":"Ce cours-séminaire consiste en une série de séances d'enseignement théorique, un travail de recherche effectué par les étudiants et une discussion commune des résultats obtenus.",
      "Contenu":"[b]Les élites économiques et politiques suisses au 20e siècle [/b] [br/][br/]Ce cours a pour objectif général d'élaborer une réflexion et une analyse sur les élites suisses au XXe siècle. Alors qu'elles occupent une forte position de pouvoir dans la société, les élites suisses restent à l'heure actuelle mal connues en comparaison des autres pays. Ce cours-séminaire se propose d'investir quelques grandes thématiques ayant trait à la question du lien entre élites et pouvoir, comme la concentration du pouvoir entre les mains d'un cercle restreint d'acteurs, les relations étroites entre les élites des différentes sphères de la société (économie, politique et administration) ou encore la question du processus de production et de reproduction des élites. Un accent particulier sera mis sur la question des élites économiques, autour des thématiques suivantes : réseaux inter-firmes, capitalisme familial et internationalisation récente de ces élites. [br/][br/]Les premières séances sont consacrées à la présentation de la problématique générale, des outils de travail et de la méthodologie par l'enseignante. Dans un deuxième temps, les étudiants travaillent sur un échantillon donné d'élites économiques, et effectuent dans ce cadre une courte recherche sur le profil sociologique de ces acteurs pour la période récente, à partir d'un indicateur déterminé (formation, nationalité, cumul des mandats, ...). Une troisième étape consiste à mettre en commun les résultats de ces recherches, autour d'une courte présentation orale par les étudiants et d'une interaction entre les groupes d'étudiants et l'enseignante. [br/]",
      "Forme du contrôle":"Pour obtenir les crédits, les étudiants doivent, par groupe de deux ou trois :[br/]Effectuer une courte recherche sur un échantillon d'élites donné, à partir de sources accessible sur internet.[br/]Présenter les résultats de leurs recherches, et participer activement à une discussion commune de leur interprétation.",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant est capable de :[br/]- mener une réflexion critique sur la question des élites et du pouvoir en Suisse au 20e siècle.[br/]- effectuer un court travail de recherche sur un échantillon d'élites donné, à partir de sources internet.[br/]- mettre en perspective les résultats de cette recherche avec l'approche théorique développée pendant le cours.[br/]"
    },
    "practical":null,
    "language":"Français",
    "title":"Elites et pouvoir",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}