{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216372&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","248(a)"],
    "title":"History of international relations",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216372&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/196783",
      "name":"Schaufelbuehl Janick Marina"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"History of international relations",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/196783",
      "name":"Schaufelbuehl Janick Marina"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Enseignante[/b] : [br/]Janick Maria Schaufelbuehl, professeure (IHES, UNIL)",
      "Bibliographie et matériel":"Il n'y a pas de lectures obligatoires, les étudiant-e-s seront orienté-e-s vers quelques textes utiles pour la préparation de leur travail de recherche.",
      "Mots clés":"Guerre froide, histoire contemporaine, relations internationales, États-Unis, URSS, bombe nucléaire, course aux armements, CIA, guérilla.",
      "Forme d'enseignement":"L'enseignement se déroulera dans un premier temps sous forme d'un cours introductif. Ensuite, les étudiant-e-s prépareront en groupe un petit travail de présentation et contextualisation d'une source d'époque. Ces courts travaux écrits seront également présentés par oral et discutés collectivement.",
      "Contenu":"[b]La Guerre froide : espions, guérilla et armes nucléaires au coeur des relations internationales contemporaines[/b][br/][br/]Ce cours s'intéresse à l'histoire de la Guerre froide, c'est-à-dire à l'affrontement durant une quarantaine d'années (1947-1989) entre le bloc occidental mené par les États-Unis et le bloc de l'Est, sous domination de l'Union soviétique. Il s'agit notamment de comprendre comment se met en place une logique de course aux armements, quel rôle jouent les guerres de guérilla dans les pays du Sud (à Cuba ou au Vietnam notamment) ou encore comment les services secrets deviennent un instrument important de la politique étrangère.[br/][br/]L'objectif du cours est de mieux connaître cette période décisive de l'histoire des relations internationales qu'est la Guerre froide et de comprendre comment elle continue de façonner la situation internationale d'aujourd'hui. Les étudiant-e-s apprendront comment utiliser des sources d'époque (des lettres, télégrammes, procès-verbaux secrets, photos qui émanent des gouvernements, des services secrets, des diplomates, etc.) pour déchiffrer un évènement du passé.",
      "Forme du contrôle":"Les travaux de recherche et leur présentation orale seront évalués par une note.",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/]- problématiser et développer un sujet de façon cohérente,[br/]- se familiariser avec la méthode historique,[br/]- présenter oralement un travail de manière claire et pédagogique."
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire des relations internationales",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}