{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216253&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","207"],
    "title":"Social and political ethics",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216253&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/141572",
      "name":"Poltier Hugues"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Social and political ethics",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/141572",
      "name":"Poltier Hugues"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Enseignant:[/b] [br/]Hugues Poltier (Faculté des lettres, UNIL)",
      "Bibliographie et matériel":"Des extraits de textes, classiques et contemporains (Aristote, Locke, Hume, Kant, Rawls, Nozick, etc.) seront mis à disposition des étudiant-e-s au fur et à mesure des besoins via la plateforme Moodle. Ainsi que des fiches pédagogiques succinctes sur les penseurs utilisés.[br/]Le lien à la page Moodle du cours sera mis à disposition en début de cours.",
      "Mots clés":"Pouvoir, action collective, droits/devoirs, égalité, justice, liberté, contrainte, désobéissance civile, libre disposition de soi (ou: propriété de soi-même), objection de conscience, obligations, réciprocité, solidarité.",
      "Forme d'enseignement":"Ce cours se présente sous une triple forme :[br/]a) un enseignement théorique général assuré par l'enseignant ;[br/]b) un enseignement par cas sur lesquels les étudiant-e-s, réparti-e-s en plusieurs groupes, seront amené-e-s à produire leur propre analyse et à la présenter en plénum ;[br/]c) des discussions en plénum sur les questions et les cas abordés.",
      "Contenu":"[b]Les questions éthiques suscitées par une société de liberté et de justice[/b][br/][br/]L'objectif général du cours n'est pas d'amener l'étudiant-e à une position qui serait l'unique \"éthiquement correcte\". Il est bien plutôt de l'amener à exercer et enrichir sa réflexion personnelle;  à vérifier la \"justesse\" de ses idées en acceptant de les mettre à l'épreuve d'une confrontation éthique; bref à l'entraîner à donner une justification rationnellement (et donc éthiquement) défendable devant autrui de la justesse de sa position. En un mot, l'objectif principal est [i]d'élever la capacité argumentative en éthique de l'étudiant-e[/i].[br/][br/]La matière du cours est circonscrite par cette question : quelles sont les difficultés éthiques que rencontre une collectivité politique s'ordonnant à partir des idées de liberté et de justice ? [br/][br/]La question directrice en est la suivante: dans une société de liberté, avons-nous des obligations les uns envers les autres et l'Etat a-t-il le droit de nous forcer à les respecter? Et si oui, quelles obligations; jusqu'où s'étendent-elles? [br/][br/]Ci-après, quelques-unes des questions que ce cours aborde et propose de discuter dans une perspective éthico-politique :[br/][br/][li]La vie politique est-elle un fait naturel?[br/][li]Y a-t-il un droit à la désobéissance civile?[br/][li]Ai-je un devoir de résistance vis-à-vis de lois injustes qui ne me concernent pas directement (ex. sans-papier)? et si oui, quelle peut en être la forme? ? y a-t-il un droit à la désobéissance civile ?[br/][li]Ai-je un droit à la soustraction fiscale ?[br/][li]L'État a-t-il le droit de m'interdire de me vendre comme esclave - ou d'en posséder un-e ?[br/][li]Ai-je le droit de me prostituer? Ai-je le droit d'être un \"mac\", un \"propriétaire de prostituées\" dont je prélève tous les gains liés à l'exercice de la profession?[br/][li]Ai-je le droit à l'objection de conscience dans l'exercice de mon métier ?[br/][li] Le droit à l'homoparentalité, un droit de l'homme à reconnaître?[br/][li] Faut-il interdire burqa, niqab et autres voiles intégraux?[br/][li] La biométrie rend-elle caduques nos libertés? [br/][li] Ai-je le droit (le devoir?) de torturer lorsque la vie d'innocents est en jeu?[br/][br/]En prenant pour axe de réflexion la distinction entre une vision du politique comprise comme qualité naturelle de l'être humain ou comme résultat d'un accord, explicite ou non, on présentera et développera les lignes de force des débats contemporains sur les droits et devoirs fondamentaux des citoyen-ne-s: droit à la vie, à la libre expression, à la libre disposition de soi (de son corps), à la liberté de religion, etc.[br/][br/][i]Plan de cours[/i][br/]1. Introduction à l'éthique et à la politique ; à l'éthique de la politique[br/]2. \"Grammaire\" de la politique [br/][tab]a.\tUne éthique immanente à cette grammaire ?[br/][tab]b.\tOu Imposition/Insertion de l'éthique du dehors ?[br/]3. Consolidation des notions à la lumière de quelques cas (du type de ceux listés plus haut)[br/]4. Travaux de groupe[br/]5. Présentation des travaux[br/]",
      "Forme du contrôle":"Présentation orale d'un travail de groupe, examen écrit en fin de semestre.[br/]La présentation orale présuppose l'étude d'un cas et la rédaction d'un petit rapport (2-4 pages maximum); l'exposé, suivi par une discussion, vérifiera la capacité à conduire l'examen éthique d'un cas.[br/]L'examen écrit vérifiera la connaissance des contenus du cours et des dossiers présentés.[br/]La note finale prendra pour base : i) la présentation faite en classe, et ii) l'examen écrit de fin de semestre.",
      "Objectifs d'apprentissage":"Au terme du cours l'étudiant-e sera capable de :[br/][li]expliciter l'objet de la politique du point de vue de l'éthique;[br/][li]exposer les principales positions rivales dans le champ de l'éthique politique et savoir critiquer l'une par les autres et réciproquement;[br/][li]rattacher une prise de position sur un problème particulier à la position dont elle dérive;[br/][li]conduire une argumentation éthique sur une question controversée ayant trait au bien et/ou au juste politique;[br/][li]conduire l'analyse et la discussion d'un cas dans l'esprit de la méthodologie éthique enseignée."
    },
    "practical":null,
    "language":"Français",
    "title":"Ethique sociale et politique",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}