{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216105&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","254"],
    "title":"Contemporary international history A",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216105&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["http://moodle.epfl.ch/course/view.php?id=8101","http://moodle.epfl.ch/course/view.php?id=8101"]],
    "instructors":[{
      "url":"http://people.epfl.ch/229444",
      "name":"Lützelschwab Claude"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Contemporary international history A",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://moodle.epfl.ch/course/view.php?id=8101","http://moodle.epfl.ch/course/view.php?id=8101"]],
    "instructors":[{
      "url":"http://people.epfl.ch/229444",
      "name":"Lützelschwab Claude"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Remarque":"Le cours se base sur une série de lectures obligatoires d'articles liés au thème du cours en français et en anglais.[br/][br/][b]Enseignante[/b]:[br/]Claude Lützelschwab (UNIL)",
      "Bibliographie et matériel":"Les références bibliographiques seront communiquées lors de la première séance et mises en ligne sur la page moodle du cours",
      "Mots clés":"Histoire, mondialisation, rapports Nord-Sud, produits coloniaux",
      "Forme d'enseignement":"Ce cours/séminaire consiste en une lecture commune de textes par les étudiant-e-s et leur discussion en classe.",
      "Contenu":"[b]Histoire culturelle : quelques produits qui font l'histoire[/b][br/][br/]L'objectif général du cours consiste à retracer l'histoire de quelques grands produits qui ont marqué l'époque contemporaine (XVIIIe-XXIe siècles) : le pétrole, l'or, le sucre, le café, le tabac, le coton ou encore la coca.[br/][br/]Le cours distingue trois étapes. (1) Dans un premier temps, il s'agit de se pencher sur les conditions de production: transfert d'une plante d'un continent à l'autre, utilisation d'esclaves ou d'une main-d'oeuvre libre, conflits internationaux pour l'acquisition de terrains d'exploitation (cf. le pétrole), tels sont les thèmes qui sont abordés. (2) La deuxième étape concerne la commercialisation de ces produits, en particulier le rôle des multinationales (légales et illégales) dans ce processus. (3) La consommation, dernière étape, porte sur la diffusion de ces produits au sein des populations. Les multiples usages de ces produits, les différentes réactions vis-à-vis de leur consommation (prohibition, taxation, légalisation), les techniques de diffusion (par exemple le recours à la publicité) ou encore les réseaux alternatifs de distribution (Max Havelaar) sont ainsi traités.[br/][br/]Le cours part d'enjeux économiques et sociaux actuels en les replaçant dans une perspective comparative et de longue durée. Il s'attache non seulement à l'évolution des économies des régions industrialisées du Nord, mais également à celles des pays du Sud. La majorité de ces produits proviennent en effet des pays de l'actuel Tiers-Monde. Il convient en outre de souligner que les dimensions économiques, sociales, politiques et culturelles sont prises en compte.[br/][br/]Les deux premières séances sont consacrées à la présentation des outils de travail et de la méthodologie par l'enseignant. Les travaux seront ensuite menés par groupes de deux à quatre étudiant-e-s, selon le nombre d'inscrits. Une semaine avant la présentation orale, les étudiant-e-s ren-contrent brièvement l'enseignante responsable à la fin du séminaire pour discuter de leur présentation. Ils/elles doivent, avant cette rencontre, rendre un document écrit d'un à deux paragraphes résumant les grands axes de leur présentation.",
      "Forme du contrôle":"Pour obtenir les crédits, les étudiant-e-s doivent, par groupe de deux ou trois :[br/]- Lire et présenter de manière problématisée deux textes au cours d'une séance,[br/]- Rendre une problématique écrite d'une demi-page,[br/]- Discuter de manière critique le travail d'un autre groupe d'étudiant-e-s.",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/][li]illustrer l'histoire de la mondialisation à travers celle de quelques grands produits coloniaux;[br/][li]comparer la temporalité et les effets du commerce de différents grands produits coloniaux;[br/][li]élaborer une problématique écrite d'une demi-page sur une thématique spécifique;[br/][li]faire une présentation orale structurée de 20 min avec un support visuel (type power point).;[br/][li]discuter des apports et limites d'un travail effectué par un autre groupe d'étudiant-e-s."
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire internationale contemporaine A",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}