{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249355947&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","225"],
    "title":"Industrial design II",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249355947&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218337",
      "name":"Bürgisser Olivier"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Industrial design II",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218337",
      "name":"Bürgisser Olivier"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Les étudiant-e-s développent leurs projets de façon individuelle ou en groupe et bénéficient de critiques hebdomadaires pour les orienter dans les différentes étapes de conception. Ils sont conseillés sur les questions formelles, conceptuelles ou esthétiques mais aussi sur les questions plus techniques, liées à la représentation graphique et la réalisation de maquettes. L'enseignement pratique est accompagné de cours théoriques qui posent les bases méthodologiques du projet de design industriel tout en constituant un corpus référentiel historique et contemporain par la présentation de réalisations en rapport avec les projets développés.",
      "Contenu":"Le cours propose d'expérimenter les spécificités du design industriel en confrontant les étudiants à la création de deux objets qui seront développés tout au long du semestre.[br/]Un premier projet aura pour objectif de réaliser une lampe de poche. Une première phase de déconstruction permettra d'en comprendre les principes de fonctionnement pour ensuite les développer de façon originale et aboutir à un objet portatif qui produise de la lumière. Le choix des matériaux est libre pour autant que les techniques de mise en ½uvre soient simples.[br/]Un second projet aura pour but la réalisation d'un objet volumétrique en utilisant exclusivement des éléments plans comme des feuilles de papier ou du carton, l'objectif étant d'explorer les techniques de façonnage et d'assemblage d'une matière simple pour en comprendre le potentiel fonctionnel et expressif.",
      "Forme du contrôle":"Les projets réalisés font l'objet d'une d'une défense orale au terme du semestre, en présence du professeur et d'un expert.",
      "Remarque":"[b]Enseignant:[/b][br/]Olivier Bürgisser (ECAL Lausanne)[br/][br/][red]Le cours se déroule à l'ECAL Renens chaque semaine, selon horaire donné par l'enseignant en début de semestre.[/red][br/]L'entrée est la même que celle des locaux de l'EPFL-ECAL LAB qui se situe à l'opposé de l'entrée principale de l'ECAL. Accès en traversant le petit parking situé à l'arrière du bâtiment qui donne sur l'avenue du vingt-quatre janvier. Les salles de cours sont au deuxième étage.[br/][br/]Pour toute question pratique concernant cet enseignement, contacter le responsable SHS à l'ECAL, M. Deodaat Tevaearai (deodaat.tevaearai@ecal.ch).",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/][li]analyser un objet pour en proposer une version personnelle,[br/][li]identifier les contraintes et le potentiel d'un matériau donné,[br/][li]problématiser la création d'un objet sur la base de concepts simples et cohérents,[br/][li]réfléchir en trois dimensions et communiquer ses idées au moyen des outils graphiques traditionnels, esquisses, plans, coupes et perspectives, [br/][li]vérifier ses propositions par le travail en maquette."
    },
    "practical":null,
    "language":"Français",
    "title":"Design industriel II",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}