{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249353276&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","205"],
    "title":"Graphic and interactive design I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249353276&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229955",
      "name":"Faure Gaël"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Graphic and interactive design I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229955",
      "name":"Faure Gaël"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Les étudiant-e-s développent leurs projets de façon individuelle ou en groupe et bénéficient de critiques hebdomadaires pour les orienter dans les différentes étapes de conception et de réalisation. Ils sont conseillés sur les questions formelles, conceptuelles ou esthétiques mais aussi sur les questions plus techniques liées à la réalisation et la production d'un projet graphique. L'enseignement est essentiellement pratique. Il est accompagné de cours théoriques qui posent les bases méthodologiques du projet de design graphique tout en constituant un corpus référentiel historique et contemporain par la présentation de réalisations en rapport avec le projet développé.",
      "Contenu":"Le cours vise à faire découvrir les bases du design graphique, ses enjeux, ses différents domaines d'application, ses techniques et ses conventions. Il s'agit d'un enseignement pratique qui repose sur le développement d'un projet de semestre.[br/][br/]L'évolution récente de la musique underground a favorisé la réactualisation du vinyle 45 tours, support propice à une invention graphique qui n'est pas sans rappeler la production punk de la fin des seventies. Le semestre aura pour objectif la création d'une pochette de disque et d'une affiche de concert qui seront réalisées exclusivement avec des moyens non électroniques (photocopieur, découpage, assemblage, etc), de façon à pouvoir appréhender de façon directe les questions de format, de proportions, de rapport texte image et de hiérarchie de l'information.",
      "Forme du contrôle":"Les projets réalisés font l'objet d'une défense orale au terme du semestre, en présence du professeur et d'un expert.",
      "Remarque":"[b]Enseignant:[/b] [br/]Gaël Faure, professeur (ECAL)[br/][br/][red]Le cours se déroule à l'ECAL Renens.[/red][br/]L'entrée est la même que celle des locaux de l'EPFL-ECAL LAB qui se situe à l'opposé de l'entrée principale de l'ECAL. Accès en traversant le petit parking situé à l'arrière du bâtiment qui donne sur l'avenue du vingt-quatre janvier. Les salles de cours sont au deuxième étage.[br/][br/]Pour toute question pratique concernant cet enseignement, contacter le responsable SHS à l'ECAL, M. Deodaat Tevaearai (deodaat.tevaearai@ecal.ch).",
      "Objectifs d'apprentissage":"Au terme du cours l'étudiant-e sera capable de :[br/]- identifier les différentes étapes d'une réalisation graphique,[br/]- communiquer une idée à travers un dispositif visuel,[br/]- réaliser un projet graphique avec des outils élémentaires."
    },
    "practical":null,
    "language":"Français",
    "title":"Design graphique et interactif I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}