{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581734600&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","343"],
    "title":"Social psychology D",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581734600&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/166176",
      "name":"Butera Fabrizio"
    },{
      "url":"http://people.epfl.ch/221106",
      "name":"Crouzevialle Marie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Social psychology D",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/166176",
      "name":"Butera Fabrizio"
    },{
      "url":"http://people.epfl.ch/221106",
      "name":"Crouzevialle Marie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"[b]Enseignants:[/b][br/]Fabrizio Butera, professeur, enseignant responsable, Marie Crouzevialle, assistante diplômée (ISS, UNIL)",
      "Bibliographie et matériel":"- Tous les textes faisant l'objet d'une présentation en groupe seront indiqués durant le premier cours, et mis à disposition sur Moodle.[br/]- Les powerpoint de chaque cours seront également disponibles sur Moodle au fur et à mesure des séances.",
      "Mots clés":"Motivation, performance, pression évaluative, ressources cognitives, comparaison sociale",
      "Forme d'enseignement":"En début de semestre, les séances se présenteront sous la forme de cours théoriques ; puis, lorsque le semestre sera plus avancé, les séances seront accordées aux travaux de groupe et suivi de la recherche. ",
      "Contenu":"[b]Motivation, évaluation, et performance : Atelier de recherche[/b][br/][br/][i]Objectif [/i]: Cet atelier de recherche a pour objectif  de sensibiliser les étudiant-e-s à une démarche de psychologie sociale expérimentale, qui portera sur l'analyse des effets de l'évaluation et des facteurs sociaux (motivation, émotions, buts poursuivis...) pouvant influencer la performance des individus. Les étudiant-e-s travailleront en groupe afin de développer une expérience de psychologie sociale, ceci impliquant plusieurs étapes (ciblage d'une question de recherche, développement puis test des hypothèses avancées, analyse puis interprétation des données recueillies). L'objectif général de l'étude menée sera d'examiner l'influence d'un contexte évaluatif sur la performance.[br/][br/][i]Descriptif général[/i] : L'évaluation de la performance scolaire, académique et scientifique semble être un élément indissociable de tout système de formation. Durant ce semestre, nous serons amenés à nous intéresser à l'impact de situations évaluatives menaçantes (pression élevée, compétition, présence de pairs potentiellement meilleurs que soi...) sur le fonctionnement cognitif et sur la performance.[br/][br/][i]Plan du cours[/i] : Après présentation par l'enseignant du cadre théorique - ainsi que des principales recherches empiriques - associés au contenu décrit ci-dessus (premières séances), les étudiant-e-s seront amené-e-s à travailler en groupe afin de développer une recherche expérimentale.",
      "Forme du contrôle":"- Rapport écrit à rendre à la fin du semestre. Ce rapport devra présenter la recherche menée, en en détaillant donc les étapes principales (par exemple, la méthodologie adoptée et l'interprétation des résultats obtenus).[br/]- Présentation orale des résultats de l'expérience.",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/][li]identifier une problématique de recherche novatrice en se basant sur des recherches antérieures;[br/][li]concevoir une procédure expérimentale précise permettant de tester efficacement une question de recherche;[br/][li]interpréter correctement des données recueillies;[br/][li]expliquer en quoi des facteurs sociaux, tels que la présence d'un contexte évaluatif, peuvent influencer le fonctionnement cognitif de l'individu, ainsi que sa performance."
    },
    "practical":null,
    "language":"Français",
    "title":"Psychologie sociale D",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}