{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249376043&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","327"],
    "title":"Industrial design IV",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249376043&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/196864",
      "name":"Jeanmonod Grégoire"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Industrial design IV",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/196864",
      "name":"Jeanmonod Grégoire"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Les étudiant-e-s travaillent leurs projets de façon individuelle ou en groupe et bénéficient de critiques hebdomadaires pour les orienter dans les différentes étapes de conception. Ils sont conseillés sur les questions formelles, conceptuelles ou esthétiques mais aussi sur les questions plus techniques. L'enseignement pratique est accompagné de cours théoriques qui évoqueront les enjeux de la communication dans le design industriel en présentant des exemples concrets de réalisation.",
      "Contenu":"Le processus de création d'un objet de design s'effectue en plusieurs phases. Celle que nous allons aborder durant le semestre de printemps est celle de la communication. Les étudiant-e-s seront d'abord amené-e-s à observer et à comprendre un objet qu'ils/elles auront choisi selon un thème qui leur sera donné (objet iconique, du quotidien, etc.) pour ensuite, en faire la présentation à l'aide d'un moyen cinématographique.[br/][br/]Que ce soit par l'intermédiaire d'une exposition ou d'une campagne de presse, la communication des résultats d'un projet est une étape importante dans le processus de création d'un objet. Pour explorer cette dimension du design industriel, les étudiants seront d'abord amenés à observer et à comprendre un objet qu'ils auront choisi selon un thème qui leur sera donné (objet iconique ou objet du quotidien par exemple), pour ensuite en faire la présentation au moyen d'un procédé cinématographique.",
      "Forme du contrôle":"Les projets réalisés font l'objet d'une défense orale au terme du semestre, en présence du professeur et d'un expert.",
      "Remarque":"[b]Enseignant[/b] : [br/]Grégoire Jeanmonod, professeur (ECAL)[br/][br/][red]Le cours est dispensé dans les locaux de l'ECAL à Renens[/red].[br/]L'entrée est la même que celle des locaux de l'EPFL-ECAL LAB qui se situe à l'opposé de l'entrée principale de l'ECAL. Accès en traversant le petit parking situé à l'arrière du bâtiment qui donne sur l'avenue du vingt-quatre janvier. Les salles de cours sont au deuxième étage.[br/][br/]Pour toute question pratique concernant cet enseignement, contacter le responsable SHS à l'ECAL, M. Deodaat Tevaearai (deodaat.tevaearai@ecal.ch).",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/][li]identifier le potentiel poétique et expressif d'un objet[br/][li]communiquer visuellement les qualités de cet objet"
    },
    "practical":null,
    "language":"Français",
    "title":"Design industriel IV",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}