{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249376706&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","326"],
    "title":"Graphic and interactive design IV",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249376706&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229955",
      "name":"Faure Gaël"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Graphic and interactive design IV",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229955",
      "name":"Faure Gaël"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Les étudiant-e-s développent leurs projets de façon individuelle ou en groupe et bénéficient de critiques hebdomadaires pour les orienter dans les différentes étapes de conception et de réalisation. Ils sont conseillés sur les questions formelles, conceptuelles ou esthétiques mais aussi sur les questions plus techniques liées à la réalisation et la production d'un projet graphique et interactif. L'enseignement est essentiellement pratique. Il est accompagné de cours théoriques qui posent les bases méthodologiques du projet de design graphique et interactif tout en constituant un corpus référentiel historique et contemporain par la présentation de réalisations en rapport avec le projet développé.",
      "Contenu":"Le cours vise à faire découvrir les bases du design graphique, ses enjeux, ses différents domaines d'application, ses techniques et ses conventions. Il s'agit d'un enseignement pratique qui repose sur le développement d'un projet de semestre.[br/][br/]Le projet consiste au détournement et à la manipulation d'une série d'images qu'il s'agira d'associer à une sélection de textes pour créer une édition. Seront étudiés les techniques de représentation, les principes de mise en page, les différentes formes d'édition, les structure éditoriales, les possibilités typographiques, les techniques d'impression et de reproduction.",
      "Forme du contrôle":"Les projets réalisés font l'objet d'une d'une défense orale au terme du semestre, en présence du professeur et d'un expert.",
      "Remarque":"[b]Enseignant[/b] : [br/]Gaël Faure, professeur (ECAL)[br/][br/][red]Le cours est dispensé dans les locaux de l'ECAL à Renens[/red].[br/]L'entrée est la même que celle des locaux de l'EPFL-ECAL LAB qui se situe à l'opposé de l'entrée principale de l'ECAL. Accès en traversant le petit parking situé à l'arrière du bâtiment qui donne sur l'avenue du vingt-quatre janvier. Les salles de cours sont au deuxième étage.[br/][br/]Pour toute question pratique concernant cet enseignement, contacter le responsable SHS à l'ECAL, M. Deodaat Tevaearai (deodaat.tevaearai@ecal.ch).",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/][li]identifier les différentes étapes d'une réalisation graphique, [br/][li]associer des images et du texte pour communiquer une idée ou une information,[br/][li]hiérarchiser l'information et la séquencer,[br/][li]réaliser un projet graphique avec des outils élémentaires et électroniques."
    },
    "practical":null,
    "language":"Français",
    "title":"Design graphique et interactif IV",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}