{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581731065&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","317"],
    "title":"Social psychology C",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581731065&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/166176",
      "name":"Butera Fabrizio"
    },{
      "url":"http://people.epfl.ch/221106",
      "name":"Crouzevialle Marie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Social psychology C",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/166176",
      "name":"Butera Fabrizio"
    },{
      "url":"http://people.epfl.ch/221106",
      "name":"Crouzevialle Marie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Enseignant(s)[/b] :[br/]Alain Quiamzade, suppléant de F. Butera, Marie Crouzevialle (ISS, UNIL).",
      "Bibliographie et matériel":"Tous les textes faisant l'objet d'une présentation en groupe seront indiqués durant le premier cours, et mis à disposition sur Moodle.[br/]Les présentations Powerpoint de chaque cours seront également disponibles sur Moodle au fur et à mesure des séances.",
      "Mots clés":"Motivation, performance, pression évaluative, ressources cognitives, comparaison sociale",
      "Forme d'enseignement":"Les séances vont alterner d'une part des cours théoriques, et d'autre part des travaux de groupe. ",
      "Contenu":"[b]Motivation, évaluation et performance[/b][br/][br/][i]Objectifs généraux de l'enseignement[/i] [br/]L'évaluation de la performance scolaire, académique et scientifique semble être un élément indissociable de tout système de formation. Ce cours a pour objectif d'amener les étudiant-e-s à se poser la question des effets de l'évaluation, et à développer une connaissance approfondie des facteurs sociaux (motivation, émotions, buts poursuivis...) pouvant influencer la performance des individus. Plus particulièrement, nous serons amenés à nous intéresser à l'impact de situations évaluatives menaçantes (pression élevée, compétition, présence de pairs potentiellement meilleurs que soi...) sur le fonctionnement cognitif et sur la performance. Nous traiterons cette question en nous basant sur de nombreux travaux empiriques menées dans le champ de la psychologie sociale. Les étudiant-e-s seront également amené-e-s à participer de façon constructive aux discussions lors des travaux de groupe.[br/][br/][i]Plan du cours[/i] [br/]Durant le semestre, nous présenterons plusieurs concepts théoriques de psychologie sociale, qui seront illustrés par de nombreuses recherches antérieures. Dans la mesure où nous nous intéressons à la performance, nous allons également aborder plusieurs concepts de psychologie cognitive. Chaque étudiant-e présentera un article scientifique de psychologie sociale (travail en groupe), dans l'optique d'amener la classe à approfondir les thèmes abordés en cours et d'en développer une connaissance approfondie.",
      "Forme du contrôle":"Examen écrit",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/][br/]- expliquer en quoi des facteurs sociaux, tels que la présence d'un contexte évaluatif, peuvent influencer le fonctionnement cognitif de l'individu, ainsi que sa performance;[br/]- comprendre comment se construit une recherche expérimentale en psychologie sociale, en particulier l'étape de mise en place d'une méthodologie permettant de tester les hypothèses du chercheur;[br/]- développer un regard critique quant aux recherches présentées en cours ou abordées lors des travaux de groupe."
    },
    "practical":null,
    "language":"Français",
    "title":"Psychologie sociale C",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}