{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216198&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","350"],
    "title":"Art Brut (Outsider Art)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216198&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["www.artbrut.ch","www.artbrut.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/207135",
      "name":"Peiry Tillmanns Lucienne"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Art Brut (Outsider Art)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-07-033699-9&amp;con_lng=ENG\" target=\"blank\">Art brut : l'instinct createur / Laurent Danchin</a>\". Year:2006. ISBN:2-07-033699-9</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-0801-1597-9&amp;con_lng=ENG\" target=\"blank\">L' art brut / Lucienne Peiry</a>\". Year:2006. ISBN:2-0801-1597-9</li><li>\"L'art brut / Michel Thevoz\". Year:1975</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["www.artbrut.ch","www.artbrut.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/207135",
      "name":"Peiry Tillmanns Lucienne"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"L'enseignement se déroule sur deux lieux : [br/]1.- Le site de l'EPFL[br/]2.- La Collection de l'Art Brut, à Lausanne (accès par métro et bus).[br/][br/]Ce cours s'adresse particulièrement aux étudiants/tes qui s'intéressent à l'expression artistique et qui sont ouverts à la découverte d'une création inhabituelle et hors les normes, inventive, surprenante, bouleversante.[br/][br/]L'accès à cette collection d'Art Brut - la plus célèbre au monde - est un privilège et une opportunité puisqu'elle est située à Lausanne.[br/][br/]Langues d'échange possibles : français, anglais, italien.[br/][br/][b]Enseignant(s)[/b] :[br/]Lucienne Peiry (directrice de la recherche et des relations internationales, Collection de l'Art Brut, Lausanne).[br/]Invité : Philippe Lespinasse (Bordeaux), réalisateur de films documentaires sur des créateurs d'Art Brut (et journaliste TV, pour Arte, France 2, etc).",
      "Bibliographie et matériel":"- Lucienne Peiry, « L'Art Brut », Paris, Flammarion, existe en version française, anglaise, allemande. 1997 et plusieurs rééditions.[br/]- Michel Thévoz, « L'Art Brut », Genève, Skira, 1981[br/]- Laurent Danchin, « Art Brut, l'instinct créateur », Paris, Gallimard/Découvertes, 2006",
      "Mots clés":"Art Brut, Collection de l'Art Brut Lausanne, Outsider Art, Jean Dubuffet, Compagnie de l'Art Brut Paris, création hors les normes.",
      "Forme d'enseignement":"Les cours du semestre se répartissent en cours ex cathedra (à l'EPFL), visites commentées de la Collection de l'Art Brut à Lausanne (au musée), projection de films, intervention d'invités, présentations orales par groupe de 4 étudiants/tes, discussions. ",
      "Contenu":"[b]L'Art Brut, une création inventive et rebelle. Créateurs d'Art Brut d'Europe, du Japon, de Chine et d'Afrique[/b][br/][br/]Ce cours offre la possibilité aux étudiants/tes de découvrir avec une spécialiste de l'Art Brut le musée installé à Lausanne, en visitant les expositions, permanente et temporaires. Il propose un accès exceptionnel aux réserves du musée, des projections de films documentaires sur plusieurs créateurs hors-normes.[br/]L'Art Brut réunit des oeuvres réalisées par des créateurs autodidactes. Marginaux, rebelles, solitaires, réprouvés, ils créent -  dans la solitude, le secret et le silence - peintures, sculptures, dessins, architectures, sans se préoccuper du regard d'autrui. Leur production est particulièrement inventive (et troublante) car leurs auteurs ont échappé au conditionnement culture et inventent l'iconographie, la technique, le mode de figuration de leurs oeuvres. Le cours permet la découverte de l'Art Brut, mais incite aussi à une interrogation sur la création artistique « officielle » (règles, statut de l'artiste, enjeux, marché de l'art).[br/]Le cours se déroule en deux étapes : [br/]a) cours et visites à la Collection de l'Art Brut, découverte des oeuvres originales (peintures, dessins, sculptures, pièces textiles), projection de films.[br/]b) présentation orale par groupes.",
      "Forme du contrôle":"Deux travaux sont exigés pour le semestre :[br/]1.\tPrésentation orale d'un travail présenté en groupe (de 4 personnes env.) d'une durée totale d'une heure. Le groupe travaille sur une thématique (L'Art Brut au Japon, les architectures oniriques dans l'Art Brut, etc.). Chaque étudiant/e choisit un créateur d'Art Brut. Le fond et la forme de la présentation importent pour que l'exposé soit pertinent, intéressant et stimulant pour la classe.[br/]2.\tRédaction d'un bref texte (1-2 pages) en fin de semestre pour exprimer en quoi la découverte de l'Art Brut entre en lien et/ou en confrontation avec les études que l'étudiant/e suit à l'EPFL. Découvrir l'Art Brut change-t-il notre regard ? Si oui, si non, pourquoi ?[br/][br/]Quelques textes seront sélectionnés pour être publiés sur le site Internet de la Collection de l'Art Brut  de Lausanne : artbrut.ch.",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/]- comprendre la définition de l'Art brut, le contexte dans lequel il apparaît, l'intérêt croissant qu'il suscite au XXe siècle et surtout aujourd'hui.[br/]- étudier l'univers d'un auteur d'Art Brut, à choix."
    },
    "practical":null,
    "language":"Français",
    "title":"L'Art Brut",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-07-033699-9&amp;con_lng=FRE\" target=\"blank\">Art brut : l'instinct createur / Laurent Danchin</a>\". Année:2006. ISBN:2-07-033699-9</li><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=2-0801-1597-9&amp;con_lng=FRE\" target=\"blank\">L' art brut / Lucienne Peiry</a>\". Année:2006. ISBN:2-0801-1597-9</li><li>\"L'art brut / Michel Thevoz\". Année:1975</li></ul>",
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}