{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581730858&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","332"],
    "title":"Science, technology and society D",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581730858&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/141723",
      "name":"Vinck Dominique"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Science, technology and society D",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/141723",
      "name":"Vinck Dominique"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"[b]Enseignants[/b] :[br/]Dominique Vinck, Professeur, Richard Marion, Assistant (ISS, UNIL).[br/]Quelques intervenants experts en études sociales des sciences et des techniques ou experts scientifiques ou techniques réflexifs sur leur propre domaine d'expertise.",
      "Bibliographie et matériel":"- Vinck D. (2009), [i]Les nanotechnologies[/i]. Paris : Le Cavalier Bleu.[br/]- Vinck D. (2007), [i]Sciences et société. Sociologie du travail scientifique[/i]. Paris : Armand Colin. [tr. anglaise : [i]Sociology of Scientific Work. The Fundamental Relationship between Science and Society[/i]. Cheltenham, Edward Elgar, 2010].[br/]Revues : [i]Revue d'Anthropologie des Connaissances[/i]",
      "Mots clés":"STS, nanosciences, nanotechnologies et société.",
      "Forme d'enseignement":"Alternance d'exposés et discussion thématique avec l'enseignant (analyse des transformations à l'oeuvre dans le domaine nano et société), de formation méthodologique à la façon de conduire une enquête auprès d'acteurs scientifiques et techniques et d'atelier d'accompagnement des étudiant-e-s. Les étudiant-e-s ont la possibilité de choisir un sujet qui les intéresse pour mener l'enquête.",
      "Contenu":"[b]Le bouleversement des nanos[/b][br/][br/]Les sciences et les techniques sont le siège de révolutions qui bouleversent l'ensemble de la société. Ce qui se passe aujourd'hui dans le domaine des nanosciences et des nanotechnologies en est un bel exemple. En prenant l'exemple de ce qui se joue aujourd'hui avec les nanosciences et nanotechnologies, le cours aborde le phénomène en parcourant une variété d'approches micro- et macrosociologiques qui portent tant sur l'activité scientifique (scientométrie appliquée à l'échelle planétaire, ethnographie de laboratoires dans le domaine du moteur moléculaire ou des microsystèmes) que sur les régulations (industrielles, politiques, juridiques) et les débats au sein de la société. Le choix, l'approfondissement des thématiques se fera en fonction des travaux des étudiant-e-s. Les étudiant-e-s seront préparé-e-s et accompagné-e-s dans la réalisation d'une mini-enquête dans leur propre domaine en rapport avec ce bouleversement scientifique et technique.",
      "Forme du contrôle":"Contrôle continu sur la base d'une mini-enquête (individuelle ou par groupe), réalisée en partie pendant les séances de cours, portant sur une intrigue nano touchant au domaine de compétence de l'étudiant-e.",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/][li]exposer une connaissance d'ensemble des transformations à l'oeuvre qui touchent l'industrie, les marchés et la société à l'échelle mondiale ;[br/][li]parler des transformations des organisations et des pratiques de recherche ; [br/][li]traiter de mécanismes de régulations des activités scientifiques et techniques tenant compte des réactions de la société et les débats publics ;[br/][li]identifier une variété d'approches possibles pour l'étude sociale des grands bouleversements scientifiques et techniques en société."
    },
    "practical":null,
    "language":"Français",
    "title":"Science, technologie et société D",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}