{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580213986&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","352"],
    "title":"Introduction to intellectual property law",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580213986&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218335",
      "name":"Joye Charles"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Introduction to intellectual property law",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218335",
      "name":"Joye Charles"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Enseignant[/b] :[br/]Charles Joye, Professeur remplaçant (Faculté de droit et des sciences criminelles, UNIL)",
      "Bibliographie et matériel":"Pour chaque cours, un support Powerpoint et des références bibliographiques sont mises à disposition des étudiant-e-s avant le cours sur MyEpfl.",
      "Mots clés":"Propriété intellectuelle - titres et stratégies de protection des investissements - droit d'auteur - brevets d'invention - designs - marques.",
      "Forme d'enseignement":"Cours-séminaire interactif. [br/]Après quelques séances de cours ex cathedra composant la première partie générale et introductive du cours, les étudiant-e-s sont invité-e-s à participer de manière plus active dans les séances ayant pour objet l'analyse de législations ou de thèmes particuliers, dans le cadre de séminaires qu'ils peuvent présenter par groupes ou de conférences parfois données par des intervenants externes.",
      "Contenu":"[b]Introduction au droit de la propriété intellectuelle. Droits et devoirs[/b][br/][br/][i]Objectifs généraux[/i][br/]Ce cours a pour buts de :[br/]- familiariser les étudiant-e-s avec les principaux droits de propriété intellectuelle qui forment le système de protection des biens immatériels;[br/]- les amener à raisonner dans ce système et leur permettre ainsi de participer aux débats qui en influencent l'application et le développement.[br/][br/]Le cours comprend une partie générale et une partie spéciale. Dans la partie générale, le cours introduit les notions permettant de saisir les finalités, l'organisation et le fonctionnement du système de protection des biens immatériels. Dans la partie spéciale, le cours approfondit les principaux droits de propriété intellectuelle qui composent ce système (droit d'auteur, brevets d'invention, designs, marques), à travers la présentation des lois qui les consacrent et l'étude de certains thèmes. Le cours fournit aussi un aperçu des autres titres de protection (indications de provenance, noms commerciaux, topographies, obtentions végétales), ainsi que des rapports entre le droit de la propriété intellectuelle et le droit de la concurrence déloyale. L'accent est mis sur le droit suisse, avec indication des instruments internationaux applicables en Suisse.[br/][br/][i]Plan du cours[/i][br/]Présentation du cours - conférence introductive sur la \"brevetabilité du génome humain\" - introduction au droit - introduction à la propriété intellectuelle - historique - conventions internationales - relations avec la concurrence déloyale - droit d'auteur - brevets d'invention - designs - marques - indications de provenance - noms commerciaux -topographies - obtentions végétales - protection des innovations biotechnologiques - protection des logiciels - protection des ½uvres architecturales - utilité du brevet d'invention et stratégies de protection - lancement et financement d'une startup - recherche fondamentale et valorisation des résultats de la recherche - propriété intellectuelle et rapports de travail.",
      "Forme du contrôle":"L'évaluation du cours fait l'objet d'un contrôle intermédiaire et d'un contrôle final, sous la forme d'examens écrits, qui représentent en principe chacun 50% de la note finale. Les étudiant-e-s qui présentent un séminaire ont la possibilité de réaliser 50% de la note finale à travers la note collective qui leur est attribuée pour leur séminaire. Celui-ci fait l'objet d'une présentation orale de 20 à 30 minutes réparties entre les intervenant-e-s et d'un rapport écrit de 3 à 4 pages (sans compter les éventuelles annexes).",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/][br/][li]connaître les principaux droits de propriété intellectuelle qui composent le système de protection des biens immatériels (droit d'auteur, brevets d'invention, designs, marques);[br/][li]comprendre et distinguer la fonction spécifique de ces différents droits, identifier le contenu et les limites de la protection qu'ils procurent;[br/][li]identifier les intérêts et les équilibres qui sous-tendent le système de protection des biens immatériels, en comprendre les finalités socio-économiques, le fonctionnement et les formalités."
    },
    "practical":null,
    "language":"Français",
    "title":"Introduction au droit de la propriété intellectuelle",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}