{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249373299&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","305"],
    "title":"Graphic and interactive design III",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249373299&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229955",
      "name":"Faure Gaël"
    }],
    "lab":null,
    "credits":2,
    "semester":"Fall",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Graphic and interactive design III",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229955",
      "name":"Faure Gaël"
    }],
    "lab":null,
    "credits":2,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Les étudiant-e-s développent leurs projets de façon individuelle ou en groupe et bénéficient de critiques hebdomadaires pour les orienter dans les différentes étapes de conception et de réalisation. Ils sont conseillés sur les questions formelles, conceptuelles ou esthétiques mais aussi sur les questions plus techniques liées à la réalisation et la production d'un projet graphique et interactif. L'enseignement est essentiellement pratique. Il est accompagné de cours théoriques qui posent les bases méthodologiques du projet de design graphique et interactif tout en constituant un corpus référentiel historique et contemporain par la présentation de réalisations en rapport avec le projet développé.",
      "Contenu":"Le cours vise à faire découvrir les bases du design graphique, ses enjeux, ses différents domaines d'application, ses techniques et ses conventions. Il s'agit d'un enseignement pratique qui repose sur le développement d'un projet de semestre.[br/][br/]Sur la base d'une entreprise ou d'une marque fictive et d'un public cible qu'il s'agira de définir, le projet consistera à élaborer les différents éléments d'une identité visuelle (branding) en produisant un logo et en l'adaptant aux formats propres à la communication d'entreprise, carte de visite, papier à entête, affiche promotionnelle, t-shirt ou site web.",
      "Forme du contrôle":"Les projets réalisés font l'objet d'une d'une défense orale au terme du semestre, en présence du professeur et d'un expert.",
      "Remarque":"[b]Enseignant :[/b] [br/]Gaël Faure, professeur (ECAL)[br/][br/][red]Le cours est dispensé dans les locaux de l'ECAL à Renens.[/red][br/]L'entrée est la même que celle des locaux de l'EPFL-ECAL LAB qui se situe à l'opposé de l'entrée principale de l'ECAL. Accès en traversant le petit parking situé à l'arrière du bâtiment qui donne sur l'avenue du vingt-quatre janvier. Les salles de cours sont au deuxième étage.[br/][br/]Pour toute question pratique concernant cet enseignement, contacter le responsable SHS à l'ECAL, M. Deodaat Tevaearai (deodaat.tevaearai@ecal.ch).",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/][li]comprendre les enjeux et l'importance de l'identité visuelle d'une entreprise, [br/][li]identifier les déclinaisons possibles d'une identité visuelle d'entreprise, [br/][li]comprendre le processus de réalisation d'une identité visuelle, [br/][li]d'identifier le moyen le plus approprié pour communiquer une idée à travers un dispositif visuel."
    },
    "practical":null,
    "language":"Français",
    "title":"Design graphique et interactif III",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}