{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215916&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","329"],
    "title":"Ethics and scientific research",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580215916&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[["Le lien à la page Moodle du cours sera mis à disposition en début de cours.","Le lien %E0 la page Moodle du cours sera mis %E0 disposition en d%E9but de cours."]],
    "instructors":[{
      "url":"http://people.epfl.ch/181991",
      "name":"Barazzetti Gaia"
    }],
    "lab":null,
    "credits":2,
    "semester":null,
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Ethics and scientific research",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["Le lien à la page Moodle du cours sera mis à disposition en début de cours.","Le lien %E0 la page Moodle du cours sera mis %E0 disposition en d%E9but de cours."]],
    "instructors":[{
      "url":"http://people.epfl.ch/181991",
      "name":"Barazzetti Gaia"
    }],
    "lab":null,
    "credits":2,
    "semester":null,
    "free_text":{
      "Remarque":"[b]Enseignante:[/b] [br/]Gaia Barazzetti, Assistante (suppléante), Ethos - Plateforme interdisciplinaire d'éthique, Interface sciences-société, Université de Lausanne[br/][br/]Ce cours s'adresse particulièrement à l'étudiant-e en STI, SV, ENAC (notamment, Sciences et ingénierie de l'environnement), et SB (notamment, Chimie et Physique), qui, dans son activité professionnelle future, pourrait se trouver devoir faire face aux enjeux éthiques de la recherche et du développement d'innovations technologiques.",
      "Bibliographie et matériel":"De la documentation sera mise à disposition sur la page Moodle du cours.",
      "Mots clés":"recherche scientifique, responsabilité sociale, fraude, intégrité, conflits d'intérêt, lanceurs d'alerte.",
      "Forme d'enseignement":"Ce cours se présente sous la triple forme :[br/][br/]a)\td'un enseignement théorique général assuré par l'enseignant ;[br/]b)\td'un enseignement par cas sur lesquels les étudiants, répartis en plusieurs groupes seront amenés à produire leur propre analyse et à les présenter en plénum ;[br/]c)\tde discussions en plénum sur les questions et les cas abordés.[br/][br/]Le cours prévoit l'intervention d'un-e ou de plusieurs intervenant-e-s exerçant des responsabilités particulières et qui s'exprimeront sur la compréhension qu'ils en ont et les difficultés et obstacles qu'ils/elles rencontrent.",
      "Contenu":"[b]La recherche scientifique et l'intérêt public[/b][br/][br/]L'objectif général de ce cours est d'interroger d'un point de vue éthique la place et le rôle de la recherche scientifique dans notre société. À cette fin, on s'efforcera de comprendre le système d'acteurs et d'orientations qui conditionnent la pratique de la recherche, ainsi que son importance pour la société.[br/][br/]Parmi les questions que nous étudierons, citons :[br/][li]La fraude scientifique : combien, pourquoi, est-ce un mal ?[br/][li]L'entrée des acteurs privés dans la recherche : quels bénéfices, quelles menaces ?[br/][li]Les conflits d'intérêt dans la recherche : une résolution juste existe-t-elle ?[br/][li]Les recherches à « double usage » : quelles responsabilités pour les chercheurs, les hautes écoles, le politique ?",
      "Forme du contrôle":"Présentation orale d'un travail de groupe, examen écrit en fin de semestre.[br/]La présentation orale présuppose l'étude d'un cas et la rédaction d'un petit rapport (2-4 pages maximum); l'exposé, suivi par une discussion, vérifiera la capacité à conduire l'examen éthique d'un cas.[br/][br/]L'examen écrit vérifiera la connaissance des contenus du cours et des dossiers présentés.[br/][br/]La note finale prendra pour base : i) la présentation faite en classe, et ii) l'examen écrit de fin de semestre.",
      "Objectifs d'apprentissage":"Au terme du cours, l'étudiant-e sera capable de :[br/]-expliciter le rôle et la place de l'entreprise scientifique dans le monde contemporain.[br/]-présenter des cas de « dérives éthiques » régulièrement observées dans la pratique scientifique et en analyser les causes.[br/]-mettre en lumière pourquoi et en quoi il s'agit là de manquements que l'on peut qualifier de \" éthiques \".[br/]-expliciter le rôle et la pertinence de l'éthique dans la résolution des cas étudiés.[br/]-conduire l'analyse et la discussion d'un cas dans l'esprit de la méthodologie éthique enseignée."
    },
    "practical":null,
    "language":"Français",
    "title":"Ethique de la recherche scientifique",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}