{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249359872&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","307"],
    "title":"Law of technological research",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249359872&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218335",
      "name":"Joye Charles"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Law of technological research",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/218335",
      "name":"Joye Charles"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"[b]Enseignant:[/b] [br/]Charles Joye, Professeur remplaçant (Faculté de droit et des sciences criminelles, UNIL)",
      "Bibliographie et matériel":"Pour chaque cours, un support powerpoint et des références bibliographiques sont mises à disposition des étudiants avant le cours sur MyEpfl.",
      "Mots clés":"recherche technologique - cadre juridique - droits fondamentaux - propriété intellectuelle - statut du corps humain - essais cliniques - controverses éthiques.",
      "Forme d'enseignement":"Cours-séminaire interactif. Après quelques séances de cours ex-cathedra composant la première partie générale et introductive du cours, les étudiants sont invités à participer de manière plus active dans les séances ayant pour objet l'analyse de législations ou de thèmes particuliers, dans le cadre de séminaires qu'ils peuvent présenter par groupes ou de conférences parfois données par des intervenants externes.",
      "Contenu":"[b]Limites et responsabilités[/b][br/][br/][b][i]1. objectifs généraux de l'enseignement[/i][/b][br/]Ce cours a pour buts de :[br/][tab]- familiariser les étudiants avec le cadre juridique des nouvelles technologies et des sciences de la [tab]vie, en les introduisant aux notions et normes qui définissent et composent ce cadre[br/][tab]- les amener à raisonner dans le système formé par les normes qui composent ce cadre et leur [tab]permettre ainsi de participer aux débats qui en influencent l'élaboration et l'application[br/][b][i]2. descriptif général de la matière enseignée[/i][/b][br/]Le cours comprend une partie générale et une partie spéciale. Dans la partie générale, le cours introduit les notions permettant de comprendre l'organisation et le fonctionnement du cadre juridique applicable aux nouvelles technologies et aux sciences de la vie. Dans la partie spéciale, le cours présente les principales normes qui composent ce cadre, à travers l'analyse de certaines législations ou de certains thèmes.[br/]L'accent est mis sur le droit suisse, y compris les instruments internationaux applicables en Suisse, avec des éclairages de droit comparé. La présentation des aspects juridiques est complétée d'une approche interdisciplinaire destinée à mettre en évidence les équilibres que le droit tend à réaliser, ainsi que les principales controverses éthiques qui entourent les thèmes abordés.[br/][b][i]3. plan du cours (aperçu)[/i][/b][br/]présentation du cours - conférence introductive sur les \" limites juridiques du diagnostic préimplantatoire \" - introduction générale au droit - droits fondamentaux - introduction à la propriété intellectuelle - droit d'auteur - brevets d'invention - statut du corps humain - recherche appliquée à l'être humain et essais cliniques de médicaments - procréation médicalement assistée - tests  génétiques - protection des données - biobanques - biopiraterie - nanotechnologies et implants technologiques - animaux de laboratoire - OGM - sécurité alimentaire - lanceurs d'alertes.[br/]",
      "Forme du contrôle":"L'évaluation du cours fait l'objet d'un contrôle intermédiaire et d'un contrôle final, sous la forme d'examens écrits, qui représentent en principe chacun 50 % de la note finale. Les étudiants qui présentent un séminaire ont la possibilité de réaliser 50 % de la note finale à travers la note collective qui leur est attribuée pour leur séminaire. Celui-ci fait l'objet d'une présentation orale de 20 à 30 minutes réparties entre les intervenants et d'un rapport écrit de 3 à 4 pages (sans compter les éventuelles annexes).",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/]-\tidentifier les principales normes qui composent le cadre juridique applicable au développement et à l'application des nouvelles technologies et des sciences de la vie[br/]-\tcomprendre le fonctionnement de ce cadre juridique, les possibilités et les droits qu'il donne, les limites et les devoirs qu'il impose[br/]-\tidentifier les intérêts et les équilibres qui sous-tendent ce cadre juridique et en comprendre les finalités socio-économiques[br/]-\treconnaître les principales composantes (juridiques et éthiques) des questions posées par le développement et l'application des avancées technologiques réalisées dans ces domaines."
    },
    "practical":null,
    "language":"Français",
    "title":"Droit de la recherche technologique",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":2,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":null
  }
}