{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581734415&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=fr",
    "code":["HUM","337"],
    "title":"Media and society B",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581734415&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683117&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"bachelor"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/223902",
      "name":"Rolle Valérie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      
    },
    "practical":null,
    "language":"Français",
    "title":"Media and society B",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/223902",
      "name":"Rolle Valérie"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Remarque":"Une présence et une participation active des étudiant-e-s sont requises pour la bonne marche du cours.[br/][br/][b]Enseignant(s)[/b] :[br/]Valérie Rolle, MER supp., (Institut des Sciences Sociales, UNIL)",
      "Bibliographie et matériel":"Les références bibliographiques seront fournies via MyEpfl.",
      "Mots clés":"Médias, propagande, publicité.",
      "Forme d'enseignement":"Le cours débute par des séances théoriques et se poursuit avec la présentation de textes dont les contenus sont mis à l'épreuve et discutés à travers des corpus concrets.",
      "Contenu":"[b]Médias, propagande et publicité[/b][br/][br/]Le développement des médias de masse depuis le XIXème siècle a permis à deux phénomènes d'influencer un public toujours plus grand : la propagande et la publicité. La propagande comme la publicité sont des rhétoriques qui persuadent avec du discours et des images. Sans aucune violence physique, ces techniques mettent pourtant en mouvement les êtres humains et influent sur la marche du monde. Avant de questionner les formes prises par cette influence, nous reviendrons sur le travail de production de l'information médiatique et publicitaire. Ces séances introductives fourniront un arrière-plan au travail de définition des notions de propagande, de publicité et de manipulation. Au fil d'exemples concrets de propagande politique et de contenus publicitaires, nous tenterons de répondre à diverses questions. La publicité est-elle manipulatoire ? Quelles sont les techniques utilisées par la publicité et la propagande ? La propagande est-elle uniquement politique, sommes-nous actuellement dans une époque dénuée de propagande ? Pourquoi telle image est-elle mobilisée pour vendre tel produit ? Où se situe la limite entre l'information et la mystification ?",
      "Forme du contrôle":"- Présentation orale d'un texte.[br/]- Rapport de synthèse écrit sur le texte lu et les discussions qui ont suivi.",
      "Objectifs d'apprentissage":"A la fin du cours, l'étudiant-e sera capable de :[br/]- explorer les limites entre l'information, la persuasion et la manipulation.[br/]- développer une approche socio-historique de phénomènes de la propagande et de la publicité.[br/]- utiliser des outils permettant d'analyser un contenu persuasif."
    },
    "practical":null,
    "language":"Français",
    "title":"Médias et société B",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}