{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=445483403&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["HUM","405(a)"],
    "title":"Internet : social challenges, global challenges I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=445483403&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[["Course description","http://www.beaude.net/iesem"]],
    "instructors":[{
      "url":"http://people.epfl.ch/168003",
      "name":"Beaude Boris"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"At the end of the teaching, students will be able to adopt a critical thinking when facing the web, emphasizing the issues relative to world scale and the profusion of actors, as well as pointing out the correlated social stakes.",
      "Content":"Economy, politics, culture are all modulated by the double process of telecommunication intensification and simplification. They do so following both complex and often cryptic patterns. Within the process of creating both standardized and automatic flows and treatment of information, Internet so increases the individuals' capacities of exchange, of organisation, of production - in spite of the topographic distances that may separate them. Launched five decades ago, such a process has extended its magnitude during the last ten years, to the extent of disrupting the various elements structuring our \"being together\" - such as norms, ethics, practices and governance - underlining the fragility relative to the latter's only temporarily stable, and so often debated, legitimacy.[br/][br/]A full appreciation of the corresponding stakes requires an appropriate and renewed understanding of social facts at large (reorganisation of the various forms of intermediation, increased exposure of one's personal life, frailty of the digital identity, reconsideration of immaterial goods' market value). Seldom has it been so important to think simultaneously territories and networks, individuals and groups, humans and non-humans, technology and its applications, hardware and software, the tangible and virtual realities.[br/][br/] Students are to write an essay dealing thematically and illustrating effectively one of the following issues:[br/][li]Space: spatial action, spatiality (distance as an obstacle to social interaction)[br/][li]Internet: technology, norms, network, space, place (interspatiality, global and local scale)[br/][li]Individual being: privacy, trust, identity, the body (digital trail, avatar)[br/][li]Group: new intermediation process (hierarchy, collective intelligence)[br/][li]Society: ethics, norms and governance (copyright, conflict of interests).",
      "Form of examination":"Evaluation on a semester basis (grade associated to 3 ECTS). Each student's research is to be confronted to the rest of the class during the first term of the year. The essay is to lead to an oral presentation during specific sessions at the end of the second term.",
      "Note":"[b]Lecturer: [/b][br/]Boris Beaude (ENAC, EPFL)"
    },
    "practical":null,
    "language":"Français",
    "title":"Internet : social challenges, global challenges I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["Descriptif du cours","http://www.beaude.net/iesem"]],
    "instructors":[{
      "url":"http://people.epfl.ch/168003",
      "name":"Beaude Boris"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Cours-séminaire (voir http://www.beaude.net/iesem)",
      "Contenu":"L'économie, la politique ou la culture évoluent avec l'intensification et la simplification de la télécommunication, selon des modalités complexes et souvent peu lisibles. En normalisant et en automatisant les flux et le traitement de l'information, Internet accroît en effet la capacité des individus à échanger, à s'organiser et à produire malgré la distance topographique qui les sépare. Initiée il y a une cinquantaine d'années, cette dynamique s'est largement accélérée cette dernière décennie, au point de perturber les modalités de l'être ensemble (normes, valeurs, pratiques et gouvernance), soulignant la fragilité de leur légitimité, dont la stabilité, provisoire, est toujours discutée.[br/]La compréhension des enjeux correspondants exige une lecture appropriée et renouvelée des faits sociaux (réagencement des intermédiations, exposition accrue de la vie privée, fragilité de l'identité numérique, remise en cause de la valeur marchande des ressources immatérielles). Rarement il fut aussi important de penser, ensemble, les territoires et les réseaux, les individus et les groupes, les humains et les non humains, la technique et les usages, le matériel et l'immatériel, le réel et le virtuel. [br/]Les étudiants réaliseront un mémoire sur une thématique illustrant efficacement les[br/]problématiques suivantes :[br/][tab]- L'espace : l'action spatiale, la spatialité (la distance comme obstacle à l'interaction sociale).[br/][tab]- Internet : technique, norme, réseau, espace, lieu (interspatialité, échelle global/local).[br/][tab]- L'individu : la vie privée, la confiance, l'identité, le corps (la trace numérique, l'avatar...).[br/][tab]- Le groupe : la réintermédiation (la hiérarchie, l'intelligence collective...).[br/][tab]- La société : les valeurs, les normes et la gouvernance (le droit d'auteur, les conflits d'intérêts...).",
      "Forme du contrôle":"Evaluation sur une base semestrielle par une note associée à 3 ECTS. L'évaluation du premier semestre porte sur l'acquisition de connaissances et l'élaboration du canevas d'un projet, qui sera réalisé en groupe ou individuellement. L'évaluation du semestre de printemps portera sur la réalisation d'un projet. Des précisions sont données en début d'année académique.",
      "Remarque":"[b]Enseignant : [/b][br/]Boris Beaude (ENAC EPFL).",
      "Objectifs d'apprentissage":"A la fin du cours les étudiant-e-s seront capables de :[br/][li]Adopter une approche critique d'Internet, en soulignant l'échelle mondiale, la pluralité des acteurs et les enjeux sociaux correspondants."
    },
    "practical":null,
    "language":"Français",
    "title":"Internet : enjeux sociaux, enjeux mondiaux I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}