{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=405249399&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["HUM","427(a)"],
    "title":"History of globalization I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=405249399&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229444",
      "name":"Lützelschwab Claude"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"At the end of the teaching, students will be able to:[br/][br/][li]formulate a problematic in the considered field;[br/][li]define their position in the historiography about colonisation and socioeconomic de-velopment;[br/][li]Locate their subject in time and space;[br/][li]Taking the above into account, write a coherent, synthetic but comprehensive group report.",
      "Content":"[b]Colonizing trends and economic development: a long-term perspective[/b][br/][br/][br/]Details to be added soon.",
      "Form of examination":"Evaluation on a semester basis (grade associat-ed to 3 ECTS). Fall semester evaluation is about knowledge acquisition and the elaboration of a project plan. Spring semester evaluation is about the realization of the project. More information is given at the beginning of the academic year.",
      "Note":"[b]Lecturer:[/b][br/]Claude Lützelschwab, Pierre Eichenberger (IHES, UNIL)",
      "Bibliography and material":"- a space will be available on the Moodle platform ;[br/]- a bibliography list will be distributed at the beginning of the cours."
    },
    "practical":null,
    "language":"Français",
    "title":"History of globalization I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/229444",
      "name":"Lützelschwab Claude"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Enseignant(s)[/b] :[br/]Claude Lützelschwab, Pierre Eichenberger",
      "Bibliographie et matériel":"- un espace de cours moodle sera mis en place.[br/]- une bibliographie sera distribuée lors des premières séances.",
      "Mots clés":"Histoire - Colonialisme - Développement économique et social - Front pionnier - XVIe-XXe siècles.",
      "Forme d'enseignement":"Après quelques séances introductives sous forme [i]ex-cathedra[/i], l'essentiel de ce cours-séminaire prend la forme d'un projet que les étudiants mènent en groupe de deux ou trois.",
      "Contenu":"[b]Mouvements de colonisation et développement économique : une perspective longue[/b][br/][br/]Ce cours porte essentiellement sur la phase contemporaine des mouvements de colonisation entre le début du 19e siècle et la Seconde Guerre mondiale. Il s'agira d'étudier et de comparer le développement d'un certain nombre de mouvements de colonisation en Amérique, en Asie et en Afrique. Le cours portera à la fois sur les modalités d'accès à la terre, les phénomènes migratoires et les caractéristiques régionales des fronts pionniers, marqués par les conditions environnementales et démographiques; et à la fois sur le rôle de l'État (colonial), l'initiative et les capacités [i](capabilities)[/i] des populations indigènes et/ou migrantes, l'hybridation des institutions indigènes et allogènes, le prix relatif des facteurs de production, le changement technologique et les innovations dans les communications et les transports. [br/][br/]Ce cours est organisé en deux phases : une première qui donne un cadre général et une seconde au cours de laquelle les étudiants réalisent leur projet.",
      "Forme du contrôle":"Evaluation sur une base semestrielle par une note associée à 3 ECTS. L'évaluation du premier semestre porte sur l'acquisition de connaissances et l'élaboration du canevas d'un projet, qui sera réalisé en groupe ou individuellement. L'évaluation du semestre de printemps portera sur la réalisation d'un projet. Des précisions sont données en début d'année académique.",
      "Objectifs d'apprentissage":"A la fin du cours les étudiant-e-s seront capables de :[br/][li]formuler une problématique dans le champ considéré.[br/][li]se situer dans l'historiographie sur la colonisation et  le développement économique et social.[br/][li]situer son objet d'étude dans le temps et dans l'espace.[br/][li]sur la base des objectifs cités plus haut, rédiger un texte cohérent en groupe."
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de la mondialisation I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}