{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249730431&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["HUM","416(a)"],
    "title":"Men / Machines I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=249730431&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[["https://documents.epfl.ch/groups/s/sh/shs-master-hommes-machines/public/","https://documents.epfl.ch/groups/s/sh/shs-master-hommes-machines/public/"]],
    "instructors":[{
      "url":"http://people.epfl.ch/196399",
      "name":"Indermühle Christian"
    },{
      "url":"http://people.epfl.ch/181989",
      "name":"Kunz Westerhoff Dominique"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Note":"Reports can be written in English.[br/][br/][b]Lecturers[/b]: [br/]Dominique Kunz Westerhoff, Professor (Section Français moderne, UNIL), Christian Indermuhle, first Assistant, Adrien Guignard, MA (IRCM, UNIL), and guests.",
      "Form of examination":"Evaluation on a semester basis (grade associated to 3 ECTS). Fall semester evaluation is about knowledge acquisition and the elaboration of a project plan. Spring semester evaluation is about the realization of the project. More information is given at the beginning of the academic year.",
      "Content":"[b]The automation of humans between science, cultural phantasy and fiction[/b][br/][br/]The Machine-Man has become real. From electronic prosthetics to bio-inspired robotics, the human body has become a hybrid, in part technological. Our environment, our work, our be-havior, and our styles of life are modeled by machines.[br/]This teaching will merge cultural approaches (especially taken from literature and art) with scientific ones in order to address issues and problems linked with human mechanization and anthropomorphic machines.[br/][br/][i]Program[/i][br/]Some introductive lectures will provide a theoretical and historical frame (a syllabus/reader will be provided), and fields will be suggested for personal research. Stu-dents will then be asked to define their topics and start their own project work, in groups (or individually if the size of the class allows for it).[br/]This preliminary work will lead to the writing and oral defense of a final report about either a field (robotics at EPFL, numeric interface, automatized work in industry, prosthetics in medical structure, ...) or about an artistic artifact (literature, art, film, comics, anime...). On a regular basis, students will present their work-in-progress to the teachers, and finally to the class.",
      "Keywords":"Machine-Man, Robotics, Cyborg, Science-Fiction, Posthumanism",
      "Type of teaching":"Lecture course-seminar-research project",
      "Learning outcomes":"At the end of the teaching, students will be able to:[br/][br/][li]understand historical concepts of Man as Machine;[br/][li]problematize hybrid forms of man and machine;[br/][li]pursue a personal project on cultural representations of Man as Machine;[br/][li]develop an original and creative reflection at the crossing point of sciences and humanities."
    },
    "practical":null,
    "language":"Français",
    "title":"Men / Machines I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["https://documents.epfl.ch/groups/s/sh/shs-master-hommes-machines/public/","https://documents.epfl.ch/groups/s/sh/shs-master-hommes-machines/public/"]],
    "instructors":[{
      "url":"http://people.epfl.ch/196399",
      "name":"Indermühle Christian"
    },{
      "url":"http://people.epfl.ch/181989",
      "name":"Kunz Westerhoff Dominique"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Remarque":"Possibilité de rédiger le projet en anglais.[br/][br/][b]Enseignants[/b]: [br/]Dominique Kunz Westerhoff, professeure (Section Français moderne, UNIL), Christian Indermuhle, premier assistant, Adrien Guignard, MA (IRCM, UNIL) et invités. ",
      "Bibliographie et matériel":"[li]Polycopié du cours (distribué lors de la 1ère séance).[br/][li]Bruce Benderson, [i]Transhumain[/i], Paris, Payot & Rivages, 2010.[br/][li]Jean-Michel Besnier,[i] Demain les posthumains. Le futur a-t-il encore besoin de nous ? [/i], Paris, Hachette Littératures (Haute tension), 2009.[br/][li]Steven T. Brown,[i] Tokyo Cyberpunk. Posthumanism in Japanese visual culture[/i], New York, Palgrave MacMillan, 2010.[br/][li]Dominique Kunz Westerhoff, Marc Atallah dir.,[i] L'homme-machine et ses avatars. Entre philosophie, science et littérature[/i], Paris, Vrin, 2011.[br/][li]Gaby Wood, [i]Le rêve de l'homme-machine. De l'automate à l'androïde[/i], trad. de Sébastien Marty, Paris, Editions Autrement, 2005.",
      "Mots clés":"Homme-machine, robotique, cyborg, science-fiction, posthumanisme.",
      "Forme d'enseignement":"Cours-séminaire-projet de recherche.",
      "Contenu":"[b]L'automatisation de l'humain entre sciences, imaginaires culturels et fictions[/b][br/][br/]L'homme-machine est devenu réalité. Des implants électroniques à la robotique inspirée par le vivant, le corps humain s'hybride avec la technologie. Notre environnement, notre travail, nos comportements, nos styles de vie sont modelés, entre autres, par des machines.[br/]Cet enseignement croisera des approches culturelles (notamment dans les domaines littéraires ou artistiques) et scientifiques pour penser les enjeux, les perspectives et les problèmes que soulèvent la mécanisation de l'humain ainsi que l'anthropomorphisation des machines.[br/][br/][b][i]Plan du cours[/i][/b] [br/]Quelques séances d'introduction donneront des informations utiles (un cadre historique et théorique sur la base d'un polycopié) et proposeront des pistes de recherche. Puis les étudiants définiront leur problématique et commenceront leur projet, par groupes (ou individuellement si le nombre de participants le permet). Ce travail préparatoire aboutira à la rédaction et à la présentation orale d'un rapport final, portant soit sur un terrain (robotique à l'EPFL, interface informatique, automatisation du travail dans l'industrie, prothèses et implants en contexte médical, etc.), soit sur une oeuvre d'art (littérature, bande dessinée, film, oeuvre d'un artiste, etc.). Les étudiants feront régulièrement part de l'avancement et des questions que pose leur recherche.",
      "Forme du contrôle":"Evaluation sur une base semestrielle par une note associée à 3 ECTS. L'évaluation du premier semestre porte sur l'acquisition de connaissances et l'élaboration du canevas d'un projet, qui sera réalisé en groupe ou individuellement. L'évaluation du semestre de printemps portera sur la réalisation d'un projet. Des précisions sont données en début d'année académique.",
      "Objectifs d'apprentissage":"A la fin du cours les étudiant-e-s seront capables de :[br/][li]Historiciser le concept d'homme-machine.[br/][li]Problématiser l'hybridation de l'homme et de la machine.[br/][li]Effectuer une recherche personnelle à travers les représentations culturelles de l'homme-machine.[br/][li]Développer un raisonnement original et créatif au croisement des sciences et des sciences humaines."
    },
    "practical":null,
    "language":"Français",
    "title":"Hommes / Machines I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}