{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580217244&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["HUM","418(a)"],
    "title":"Picture history I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580217244&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/166175",
      "name":"Lugon Olivier"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Note":"[b]Lecturer[/b]:[br/]Olivier Lugon, Professor (Section d'histoire et esthétique du cinéma, UNIL)",
      "Form of examination":"Evaluation on a semester basis (grade associated to 3 ECTS). Fall semester evaluation is about knowledge acquisition and the elaboration of a project plan. Spring semester evaluation is about the realization of the project. More information is given at the beginning of the academic year.",
      "Bibliography and material":"Distributed in class.",
      "Content":"[b]Picture History and Visual Dispositives :Camera, screens, mirrors[/b][br/][br/]The seminar deals not only with images, but also with the visual dispositives, which gives birth or access to them. It focuses on works, which imply devices or apparatuses of a mediatisation of vision: cameras, screens, windows or mirrors, in the field of art, cinema, photography or exhibition design of the 20th and 21st centuries. ",
      "Keywords":"art, photography, film, exhibition, spectator, dispositive",
      "Type of teaching":"After few introductory lectures, the students work in small groups at their own research projects, with regular meetings with the professor.",
      "Learning outcomes":"At the end of the teaching, students will be able to:[br/][br/][li]analyse an image, a work of art or a film from a formal, technical or iconographical point of view; [br/][li]analyse the technical or spatial dispositive, which gives birth or access to the image;[br/][li]understand these images and dispositives in their historical, social and political context;[br/][li]express their observations in a clear and well-structured argumentation, orally and in writing."
    },
    "practical":null,
    "language":"Français",
    "title":"Picture history I",
    "recitation":{
      "week_hours":1,
      "weeks":14
    },
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/166175",
      "name":"Lugon Olivier"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Enseignant[/b]: [br/]Olivier Lugon, professeur (Section d'histoire et esthétique du cinéma, UNIL).",
      "Bibliographie et matériel":"Distribué en cours. ",
      "Mots clés":"Art, photographie, cinéma, exposition, spectateur, dispositif.",
      "Forme d'enseignement":"Séances collectives d'introduction, puis préparation et rédaction d'un projet de recherche par petits groupes (2-3 personnes), avec suivi régulier et personnalisé de l'avancement du projet.",
      "Contenu":"[b]Histoire de l'image et des dispositifs de vision : Caméras, écrans, miroirs [/b][br/][br/]L'atelier examine non seulement les images, mais aussi les dispositifs de vision qui permettent leur création et leur exposition. Il se concentrera dès lors sur des oeuvres qui mettent en jeu diverses modalités de médiatisation de la vision : caméras et appareils photographiques, écrans de projection, fenêtres et miroirs, cela dans le champ de l'art, du cinéma, de la photographie et de la scénographie d'exposition, aux 20e et 21e siècles.",
      "Forme du contrôle":"Evaluation sur une base semestrielle par une note associée à 3 ECTS. L'évaluation du premier semestre porte sur l'acquisition de connaissances et l'élaboration du canevas d'un projet, qui sera réalisé en groupe ou individuellement. L'évaluation du semestre de printemps portera sur la réalisation d'un projet. Des précisions sont données en début d'année académique.",
      "Objectifs d'apprentissage":"A la fin du cours les étudiant-e-s seront capables de :[br/][li] analyser une oeuvre d'art, un corpus d'images ou un film d'un point de vue formel, technique ou iconographique. [br/][li] interroger également le dispositif technique, spatial, scénographique qui a donné naissance aux images ou permet l'accès à elles.[br/][li] replacer ces images et ces dispositifs dans leur contexte historique, social et politique.[br/][li] formuler leurs observations de façon claire et argumentée par oral et par écrit."
    },
    "practical":null,
    "language":"Français",
    "title":"Histoire de l'image I",
    "recitation":{
      "week_hours":1,
      "weeks":14
    },
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}