{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216498&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["HUM","403(a)"],
    "title":"Experimental cognitive psychology I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216498&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/196377",
      "name":"Arminjon Mathieu"
    },{
      "url":"http://people.epfl.ch/218732",
      "name":"Mohr Christine"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Note":"Teaching language: English.[br/][br/][b]Lecturers[/b]:[br/]Christine Mohr, Professor (Institut de psychologie, UNIL), Mathieu Arminjon (Fondation Agalma, Geneva)",
      "Form of examination":"Evaluation on a semester basis (grade associated to 3 ECTS). Fall semester evaluation is about knowledge acquisition and the elaboration of a project plan. Spring semester evaluation is about the realization of the project. More information is given at the beginning of the academic year.",
      "Bibliography and material":"Provided during the course.",
      "Content":"Cognitive psychology covers all aspect of our mental world, whether it is perception, attention, memory, language, mental imagery, emotion, concept formation, problem solving, creativity, decision making, reasoning, etc. To assess cognitive functioning, psychologists working in this field have traditionally applied experimental scientific methods. In this course, we will elaborate research questions that are closely linked to those of the respective project supervisor with the idea that the students can contribute own ideas and suggestions. By accounting for the recent published scientific literature, students will start to elaborate on study ideas and questions that will determine their subsequent research activities (in groups of 2-4 students). After having decided on a hypothesis, students will develop their method, test participants (data collection), treat the data for statistical analysis, and write a scientific report.[br/][br/][i]Examples of topics in the academic year 2011-2012[/i]: [br/]a) can color influence how we experience nonverbal affective bodily expressions, [br/]b) the role of Facebook use on socialization behavior of national and international master students on EPFL campus, [br/]c) do we go with the majority in online survey situations? [br/]d) how many consistent and inconsistent face cues do we require to accurately judge upon another person's trustworthiness? ",
      "Type of teaching":"Lecture course/seminar/research project",
      "Learning outcomes":"At the end of the teaching, students will be able to:[br/][li]run an empirical study using a scientific approach in cognitive psychology;[br/][li]elaborate a study hypothesis based on the existing literature; [br/][li]select a paradigm that is suitable to test their hypothesis and test the hypothesis;[br/][li]analyze whether their hypothesis is likely to be true or false; [br/][li]discuss their findings;[br/][li]write a scientific report (basic structure also to be found in published scientific reports). "
    },
    "practical":null,
    "language":"English",
    "title":"Experimental cognitive psychology I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/196377",
      "name":"Arminjon Mathieu"
    },{
      "url":"http://people.epfl.ch/218732",
      "name":"Mohr Christine"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Remarque":"[b]Langue d'enseignement[/b] : [br/]Anglais[br/][br/][b]Equipe d'enseignement[/b] :[br/]Christine Mohr, professeure (Institut de psychologie, UNIL), Mathieu Arminjon (Fondation Agalma, Genève)",
      "Bibliographie et matériel":"Distribuée en cours.",
      "Mots clés":"Psychologie cognitive, perception, attention, émotion, mémoire, prise de décision, créativité, raisonnement, différences individuelles, méthodes scientifiques, méthodes empiriques.",
      "Forme d'enseignement":"Cours - séminaire - projet de recherche.",
      "Contenu":"La psychologie cognitive couvre tous les aspects de notre monde mental, que ce soit la perception, l'attention, la mémoire, le langage, les images mentales, les émotions, la formation de concepts, la résolution de problèmes, la créativité, la prise de décision, le raisonnement, etc. Pour évaluer le fonctionnement cognitif, les psychologues travaillant dans ce domaine ont traditionnellement appliqués des méthodes scientifiques expérimentales. Dans ce cours, nous allons élaborer des questions de recherche étant liés aux axes de recherches des superviseurs de projets respectifs avec l'idée que les étudiantEs peuvent contribuer avec leurs propres idées et suggestions. Par la prise en compte de la littérature scientifique récente, les étudiants devront commencer à élaborer les idées d'études et de questions qui détermineront leurs recherches par la suite (en groupe de 2-4 étudiantEs). Après avoir décidé d'une hypothèse, les étudiantEs devront développer leur méthode, récolter les données, traiter ces données par des analyses statistiques et écrire un rapport scientifique.[br/]Exemples de sujets choisis en 20111-2012 :[br/]a) La couleur peut-elle influencer la manière dont nous percevons les expressions corporelles affectives non-verbales ?[br/]b) Le rôle de Facebook sur les comportements sociaux d'étudiants de master EPFL suisses ou étrangers. [br/]c) Suit-on la majorité dans les enquêtes en ligne ? [br/]d) De combien de signaux consistants et inconsistants avons-nous besoin pour juger de manière pertinente la fiabilité de quelqu'un ?",
      "Forme du contrôle":"Evaluation sur une base semestrielle par une note associée à 3 ECTS. L'évaluation du premier semestre porte sur l'acquisition de connaissances et l'élaboration du canevas d'un projet, qui sera réalisé en groupe ou individuellement. L'évaluation du semestre de printemps portera sur la réalisation d'un projet. Des précisions sont données en début d'année académique.",
      "Objectifs d'apprentissage":"A la fin du cours les étudiant-e-s seront capables de :[br/][li] conduire une étude expérimentale en utilisant les approches scientifiques de la psychologie cognitive.[br/][li] élaborer une hypothèse basée sur la littérature existante.[br/][li] sélectionner un paradigme adéquat permettant de tester son hypothèse et réaliser le test.[br/][li] utiliser les outils empiriques et statistiques afin de valider ou infirmer une hypothèse.[br/][li] évaluer de façon critique les résultats.[br/][li] écrire un rapport scientifique (les structures basiques des publications scientifiques)."
    },
    "practical":null,
    "language":"English",
    "title":"Experimental cognitive psychology I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}