{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216667&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["HUM","412(a)"],
    "title":"Contemporary ethical issues I",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1580216667&ww_x_anneeAcad=2012-2013&ww_i_section=1751774&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"SHS",
    "program":"SHS",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/181991",
      "name":"Barazzetti Gaia"
    },{
      "url":"http://people.epfl.ch/141572",
      "name":"Poltier Hugues"
    }],
    "lab":null,
    "credits":3,
    "semester":"Fall",
    "free_text":{
      "Note":"It is possible to write the project in French, English or Italian.[br/]Since students are likely to work in teams in their future professional activity, working in groups is strongly recommended, although not mandatory.[br/][br/][b]Lecturers:[/b][br/]Hugues Poltier, MER (Section de philosophie, UNIL), Gaia Barazzetti, dipl. assistant (Interface Science-Société, UNIL).",
      "Form of examination":"Evaluation on a semester basis (grade associated to 3 ECTS). Fall semester evaluation is about knowledge acquisition and the elaboration of a project plan. Spring semester evaluation is about the realization of the project. More information is given at the beginning of the academic year.",
      "Bibliography and material":"Documentation will be available on the Moodle page of the course.",
      "Content":"[b]The engineer in society[/b][br/][br/]The leading idea of this course is that students choose, in agreement with the teachers, an ethical case that will be the subject of their research project. The subject of choice should deal with a contemporary ethical issue.[br/][br/]The research work that will be undertaken during the course includes:[br/][li]the elaboration of the research question, from an ethical point of view;[br/][li]the clarification of the \"ethical\" problem at stake, as well as the assessment of the \"ethical\" implications that will be discussed in the research project;[br/][li]the development of an ethical discussion on the problem.[br/][br/]In order to achieve their research, students will be asked to realize some intermediate tasks (e.g. readings reviews). The teachers will provide regular monitoring of students' work, including feedbacks and suggestions to facilitate the successful accomplishment of the research project.",
      "Keywords":"ethics, engineer, social responsibility.",
      "Type of teaching":"Types of teaching include:[br/]a)  an introduction to methodological approaches in ethics, aimed at providing students with the concepts and methods of reasoning necessary to develop their research project;[br/]b)  regular monitoring of students' work through the discussion of problems that they encounter in their research, thus encouraging a col-lective learning;[br/]c)  time available to students to accomplish their research.[br/][br/]Students have to comply with the course calendar and deliver a report on their research project on a fixed date. The report has to be written following the teachers' instructions",
      "Learning outcomes":"At the end of the course the student will be able to :[br/]-  identify the ethical questions at stake in a practical problem that an engineer might face ;[br/]-  recognize the ethical issues which are controversial ;[br/]-  outline the controversy and relate it to the choices of actors involved ;[br/]-  use ethical concepts to make his/her own assessment."
    },
    "practical":null,
    "language":"Français",
    "title":"Contemporary ethical issues I",
    "recitation":null,
    "exam_form":"During the semester",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/181991",
      "name":"Barazzetti Gaia"
    },{
      "url":"http://people.epfl.ch/141572",
      "name":"Poltier Hugues"
    }],
    "lab":null,
    "credits":3,
    "semester":"Automne",
    "free_text":{
      "Remarque":"Il est possible de rédiger son projet en français, en anglais, ou en italien.[br/]De surcroît, et parce que l'ingénieur sera appelé à travailler en équipe dans sa prochaine vie professionnelle, le travail de groupe est de rigueur.",
      "Bibliographie et matériel":"Le lien à la page Moodle du cours sera mis à disposition en début de cours.",
      "Mots clés":"Ethique, ingénieur, responsabilité sociale.",
      "Forme d'enseignement":"Ce cours se présente sous la triple forme :[br/]a) d'un enseignement méthodologique général assuré par l'enseignant, de manière à doter les étudiants des éléments nécessaires pour accomplir leur travail.[br/]b) d'un coaching favorisant l'apprentissage collectif, via le traitement des problèmes rencontrés par les étudiants lors de leur travail.[br/]c) du temps laissé à la libre organisation des participants.[br/]À la date fixée sur le calendrier de l'année, l'étudiant-e (le groupe d'étudiants) remet aux enseignants son travail portant sur la question thématique de l'année. Ce travail satisfera aux normes communiquées par les enseignants en début d'année.",
      "Contenu":"[b]L'ingénieur dans la société[/b][br/][br/]L'idée directrice du cours est que l'étudiant-e choisisse comme objet de son travail un cas éthique de son choix, en accord avec les enseignants. La condition première à laquelle doit satisfaire le thème choisi est que celui-ci puisse être considéré comme un « enjeu éthique contemporain ».[br/]Le travail de l'année consistera :[br/][li] à élaborer la question, cela, tout particulièrement sous l'angle de l'éthique.[br/][li] à clarifier ce qui constitue au juste un problème « éthique » ainsi que ce en quoi consiste une discussion « éthique » d'une question pratique.[br/][li] à mettre en oeuvre cette discussion éthique sur le thème choisi.[br/]Dans cette perspective, les enseignants proposeront à l'étudian-t-e quelques petits travaux intermédiaires (p.ex. rédaction de fiches préparatoires en vue de la rédaction finale) et suivront pas à pas, ou à la demande de l'étudiant-e, l'avancement de son travail : dans ce cadre, conseils et encouragements lui seront prodigués.",
      "Forme du contrôle":"Evaluation sur une base semestrielle par une note associée à 3 ECTS. L'évaluation du premier semestre porte sur l'acquisition de connaissances et l'élaboration du canevas d'un projet, qui sera réalisé en groupe ou individuellement. L'évaluation du semestre de printemps portera sur la réalisation d'un projet. Des précisions sont données en début d'année académique.",
      "Objectifs d'apprentissage":"A la fin du cours les étudiant-e-s seront capables de :[br/]- saisir la présence d'enjeux éthiques dans le cadre de la discussion d'un problème pratique que peut rencontrer un ingénieur.[br/]- déceler les composantes normatives qui sont objet de controverses.[br/]- restituer la controverse et la rattacher aux choix fondamentaux des uns et des autres.[br/]- mobiliser les outils conceptuels de l'éthique afin de former son jugement"
    },
    "practical":null,
    "language":"Français",
    "title":"Enjeux éthiques contemporains I",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":{
      "week_hours":1,
      "weeks":14
    },
    "library_recommends":null,
    "lecture":{
      "week_hours":2,
      "weeks":14
    }
  }
}