{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1772847&ww_x_anneeAcad=2012-2013&ww_i_section=944917&ww_i_niveau=6683147&ww_c_langue=fr",
    "code":["ME","312"],
    "title":"Design for X",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1772847&ww_x_anneeAcad=2012-2013&ww_i_section=944917&ww_i_niveau=6683147&ww_c_langue=en",
    "section":"MX",
    "program":"GM",
    "plan":"master"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/107556",
      "name":"Xirouchakis Paul"
    }],
    "lab":null,
    "credits":2,
    "semester":"Spring",
    "free_text":{
      "Form of examination":"Group project reports on « Conception pour X » modeling. An oral exam will concern the application of the theory in the projects.",
      "Bibliography and material":"Course documentation is distributed during the semester. Project support material can be downloaded from the licp laboratory website (http://licpwww.epfl.ch/cours/DFX/)",
      "Required prior knowledge":"[li]List the functions of an existing or new product based on the specifications, CP4 (Méthodes de conception)[br/][li]Choose the main solutions and identify the respective components to fulfil one function, taking into account the performance, technology and price constraints, CP5 (Méthodes de conception)[br/][li]Choose material and the relative treatments based on its use, performance and compatibility with the manufacturing process of the final product, CP13 (Méthodes et procédés de fabrication)[br/][li]Illustrate the physics principles of production processes, CP16 (Méthodes et procédés de fabrication)[br/]Illustrate the features and limits of production processes, CP17 (Méthodes et procédés de fabrication)",
      "Content":"The goal of this course is to introduce to the student some basic concepts, methods and algorithms in computer aided product life-cycle engineering. The student will learn multi-criteria optimization methods to make trade-offs and optimize the design of a product from different points of view (assembly, disassembly, environment, injection molding and reliability). Theoretical exercises and projects will complement the course.",
      "Keywords":"Cost and environmental impact modelling, Product life-cycle modelling",
      "Type of teaching":"The course is organised in theoretical sessions and the \"Design for X\" modelling to be realised in team projects.",
      "Learning outcomes":"[b]Domain Skills:[/b][br/][li]Choose suitable methods and tools for the development, the modelling and simulation, the analysis and solution selection of an engineering problem in the mechanical engineering domain (product design, manufacturing process and system production), CP1[br/][li]Master experimental and numerical analysis tools, CP2[br/][li]Formulate the modelling hypotheses to tackle a problem and choose the respective solution methods and tools considering the available resources, CP6[br/][li]Realize, analyse and discuss a model: 3D complex geometries and assemblies, static, kinematic, dynamic, thermal and ultimate behaviour, life-cycle and costs of a system (product, manufacturing process or production system), CP8[br/][li]Carry out a multi-criterion (technological, economic and environmental) analysis of the solutions, CP10[br/][br/][b]Transversal skills:[/b][br/][li]Write a scientific or technical report, T6[br/][li]Analyse decisions in terms of subjective and objective aspects, T9[br/][li]Organize activities prioritizing the objectives, T10[br/][li]Document and communicate a project, T12[br/][li]Form and motivate a team, T13[br/][li]Analyse the consequences of a decision or solution, T20[br/][li]Share knowledge and experience with peers, T25"
    },
    "practical":null,
    "language":"Français",
    "title":"Design for X",
    "recitation":{
      "week_hours":1,
      "weeks":14
    },
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/107556",
      "name":"Xirouchakis Paul"
    }],
    "lab":null,
    "credits":2,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"[li]Rédiger à partir d'un cahier des charges la liste des fonctions d'un produit existant ou à concevoir, CP4 (Méthodes de conception)[br/][li]Choisir des solutions de principe et identifier les composants correspondants en termes de performances, de technologie et de coût permettant de réaliser une fonction du cahier des charges, CP5[br/][li]Choisir un matériau et les traitements en fonction de son usage, de sa performance et son adéquation au mode de fabrication du produit final, CP13 (Méthodes et procédés de fabrication)[br/][li]Enoncer les principes physiques des procédés de fabrication, CP16 (Méthodes et procédés de fabrication)[br/][li]Enoncer les caractéristiques et les limites des procédés de fabrication, CP17 (Méthodes et procédés de fabrication)",
      "Bibliographie et matériel":"La documentation du cours est distribuée pendant le semestre. Le matériel de support des projets du cours peut être téléchargé du site du licp",
      "Mots clés":"Modélisation des coûts et d'impacts d'environnement, Modélisation[br/]des cycles de vie des produits",
      "Forme d'enseignement":"Le cours est organisé en sessions théoriques et comprend la modé-[br/]lisation «Conception pour X» réalisée dans des projets de groupe.",
      "Contenu":"Le but du cours est de transmettre aux étudiants les concepts, les méthodes et les algorithmes de base de la conception de produit en rapport avec son cycle de vie. L'étudiant va apprendre des méthodes d'optimisation multi- critères pour faire des compromis et optimiser la conception d'un produit des différents aspects de sa vie (assemblage, démontage, environnement, moulage par injection et fiabilité).Les étudiants travailleront sur des exercices théoriques et des projets de conception pour X de produits.",
      "Forme du contrôle":"Rapports de groupe des projets de modélisation (30%). Examen oral sur l'application de la théorie aux projets (70%).",
      "Objectifs d'apprentissage":"[b]Compétences de domaine:[/b][br/][li]Choisir les méthodologies et les outils adéquats pour le développement, la modélisation et simulation, l'analyse et la sélection de solutions à un problème d'ingénierie du domaine du Génie mécanique (conception de produit, processus de fabrication et de systèmes de production), CP1[br/][li]Maîtriser les outils d'analyse numériques et expérimentaux, CP2[br/][li]Poser/extraire les hypothèses de modélisation adaptées et choisir les méthodes et outils en fonction des ressources pour le traitement du problème, CP6[br/][li]Réaliser, analyser et critiquer un modèle: forme géométrique 3D complexe et assemblages, comportement statique, cinématique, dynamique, thermique et de résistance d'un système, cycles de vie et les coûts associés d'un système (produit, processus de fabrication ou système de production), CP8[br/][li]Effectuer une analyse multicritères (technologiques, économiques et environnementaux) des solutions, CP10[br/][b]Compétences transversales:[/b][br/][li]Rédiger un rapport d'étude scientifique ou technique, T6[br/][li]Analyser ses décisions en considérant les aspects objectifs et subjectifs, T9[br/][li]Organiser ses activités en priorisant ses objectifs, T10[br/][li]Documenter et communiquer un projet, T12[br/][li]Composer une équipe, la motiver, T13[br/][li]Analyser les conséquences d'une décision ou d'une solution, T20[br/][li]Partager ses connaissances et expériences avec ses pairs, T25"
    },
    "practical":null,
    "language":"Français",
    "title":"Conception pour X",
    "recitation":{
      "week_hours":1,
      "weeks":14
    },
    "exam_form":"Oral",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":1,
      "weeks":14
    }
  }
}