{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=352630597&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","453"],
    "title":"Industry dynamics, models & trends",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=352630597&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/141278",
      "name":"Finger Matthias"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      "Form of examination":"15% active participation[br/]70% written document of 30 pages prepared by participants[br/]15% oral presentation by participants at the end of the course",
      "Bibliography and material":"See: http://mir.epfl.ch",
      "Prerequisite for":"None",
      "Required prior knowledge":"None",
      "Content":"The course will present the different [u]approaches[/u] to industry analysis, as well as the different [u]methodologies[/u] and [u]tools[/u] which are generally used to perform such analyses. In this respect, Porter's five forces framework, the techniques used to analyse the degree of competition, the regulatory environment, the static and dynamic value chains, as well as other concepts and tools generally used to assess industry dynamics and trends will be presented. [br/][br/]Furthermore, the course will discuss [u]future trends[/u] both from a theoretical as well as from a practical perspective. Particular attention will be paid to environmental changes and their subsequent impacts upon industry, such as regulatory and technological changes. Finally, the course will also consider the issue of industry evolution and corresponding models, in particular the question of convergence across industries.",
      "Keywords":"Industry analysis, industry trends, business models, industry change, business regulation",
      "Type of teaching":"Lectures by the professor.[br/]Participants develop their own industry cases during the course.",
      "Learning outcomes":"The purpose of this course is to introduce the participants to industry analysis as a method. Furthermore the participants will also learn about business models as well as industry changes and industry trends."
    },
    "practical":null,
    "language":"English",
    "title":"Industry dynamics, models & trends",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/141278",
      "name":"Finger Matthias"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Aucun",
      "Bibliographie et matériel":"Voir: http://mir.epfl.ch",
      "Mots clés":"Analyse industrielle, trends dans l'industrie, modèle économique, changement dans l'industrie, règulation économique",
      "Forme d'enseignement":"Conférences par le professeur.[br/]Les participants développent des cas pendant le cours.",
      "Contenu":"Le cours présentera les différentes [u]approches[/u] de l'analyse industrielle, ainsi que les différentes [u]méthodologies[/u] et [u]outils[/u] qui sont généralement utilisés pour effectuer de telles analyses. À cet égard seront présentés le modèle des 5 forces de Porter, les techniques utilisées pour analyser le degré de concurrence, l'environnement réglementaire, les chaînes de valeurs statiques et dynamiques, ainsi que d'autres concepts et outils généralement utilisés pour évaluer les  dynamiques et les tendances des industries.[br/][br/]En outre, le cours abordera les [u]tendances futures[/u] tant du point de vue  théorique que pratique. Une attention particulière sera accordée aux changements environnementaux et à leurs impacts subséquents sur les industries, tels que les changements de réglementation et technologiques. Finalement, le cours prendra aussi en considération la question de l'évolution industrielle et des modèles correspondants, en particulier la question de la convergence à travers les industries.",
      "Forme du contrôle":"15% participation active[br/]70% document écrit de 30 pages préparé par les participants[br/]15% présentation oral des participants à la fin du cours",
      "Préparation pour":"Aucun",
      "Objectifs d'apprentissage":"Le but de ce cours est d'introduire les participants à l'analyse des industries. En outre, les participants apprendront les modèles d'entreprise, ainsi que les changements et les trends dans les industries."
    },
    "practical":null,
    "language":"English",
    "title":"Industry dynamics, models & trends",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}