{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=352632242&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","401"],
    "title":"Strategic marketing & technology commercialization",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=352632242&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/181916",
      "name":"Durisin Boris"
    }],
    "lab":null,
    "credits":4,
    "semester":"Fall",
    "free_text":{
      "Form of examination":"5% class presence and participation[br/]5% in-class examination (quiz)[br/]40% case studies preparation and presentation[br/]50% written final exam",
      "Bibliography and material":"Case series, technical notes, and business journal articles (in English)",
      "Prerequisite for":"Useful for \"Technology strategy Corporate Entrepreneurship\"",
      "Content":"[b][li]Marketing: An introduction for innovative firms[/b]:[br/]Marketing, innovation, and value creation - Marketing and the dynamics of innovation - The role of technology commercialization - New product success - Product Innovation Charter[br/][b][li]Marketing: Identifying market opportunities[/b]:[br/]Segmenting - Targeting - Positioning - Market research - Immersion and empathic design - Lead user analysis[br/][b][li]Technology commercialization: New product launch[/b]:[br/]Market sizing: A.T.A.R. methodology; Bass model and Rogers Model - Strategic Pricing - Effective Pricing Policy - Conjoint analysis - Pricing and Customer Equity - \"go to market\" strategies - The strategic role of brands - Marketing communications and branding - Brand architecture and brand equity - Brand extension strategies",
      "Keywords":"Marketing, strategic innovation, technology commercialization, new product development",
      "Type of teaching":"Lectures, case studies, group projects",
      "Learning outcomes":"This course explores how companies shape, implement, and change strategies to introduce new products. It provides a set of integrated frameworks and tools to help a manager more effectively design and manage the strategies, processes, and organizational structures required for identifying opportunities and introducing new products. The course tackles issues at both a strategic level as well as decisions of a more tactical nature. [br/]The course equips you with frameworks to analyze processes of marketing products and services in both emerging and mature industries; it explores both the launch of products in existing businesses as well as new-to-the-world products. An emphasis is on strategic issues coupled with applicative methodologies. Class discussions involve real examples of turbulent changes in various industries on a global scale to better illustrate the ideas and learning of the course. [br/]"
    },
    "practical":null,
    "language":"English",
    "title":"Strategic marketing & technology commercialization",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/181916",
      "name":"Durisin Boris"
    }],
    "lab":null,
    "credits":4,
    "semester":"Automne",
    "free_text":{
      "Bibliographie et matériel":"Série de cas, notes et articles de revues de management (en anglais)",
      "Mots clés":"Marketing, innovation stratégique, commercialisation de la technologie, développement de nouveaux produits",
      "Forme d'enseignement":"Cours, études de cas, projets en groupe",
      "Contenu":"[b][li]Marketing: introduction pour les entreprises innovatrices[/b]:[br/]Marketing, innovation et création de valeur - Marketing et dynamique d'innovation - Le rôle de la commercialisation de la technologie - Succès d'un nouveau produit - Charte de l'innovation d'un produit[br/][b][li]Marketing: identifier les opportunités du marché[/b]:[br/]Segmenter - Cibler - Positionner - Etudes de marché - Immersion et conception orientée client - Analyse du client lead[br/][b][li]Commercialisation de la technologie: le lancement d'un nouveau produit[/b]:[br/]L'estimation du marché: méthodologie A.T.A.R; modèle de Bass et Rogers - La stratégie de tarification - Politique de prix efficace - Analyse conjointe - Prix et valeur pour le client [br/]- Les stratégies du \"go to market\" - Rôle stratégique de la marque - Communications marketing et marques - Architecture des marques et valeur des marques - Stratégies d'extension des marques",
      "Forme du contrôle":"5% présence et participation en classe[br/]5% examen en classe (quiz)[br/]40% préparation et présentation d'études de cas[br/]50% examen final écrit",
      "Préparation pour":"Utile pour \"Technology Strategy & Corporate Entrepreneurship\"",
      "Objectifs d'apprentissage":"Ce cours explore comment les sociétés conçoivent, mettent en oeuvre et font évoluer les stratégies pour introduire de nouveaux produits sur le marché. Il fournit un cadre et des éléments destinés à aider le manager à bien concevoir et gérer les stratégies, les processus et les structures organisationnelles requises pour identifier les opportunités et introduire de nouveaux produits. [br/]Ce cours permettra d'analyser les processus de commercialisation des produits et des services dans les industries tant émergeantes qu'établies; il explore le lancement de produits dans des entreprises existantes et de produits totalement nouveaux pour le marché. L'accent sera mis sur les thèmes stratégiques ainsi que sur les méthodologies empiriques. Les discussions en classe porteront sur des exemples réels de turbulences survenues dans diverses industries à l'échelle mondiale, ceci pour mieux illustrer les idées et le contenu du cours."
    },
    "practical":null,
    "language":"English",
    "title":"Strategic marketing & technology commercialization",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}