{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=130135576&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","455"],
    "title":"Practical Business law",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=130135576&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/184288",
      "name":"Rochat Frédéric"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"In this course, students will learn to:[br/]- understand, negotiate and draft the business terms of the major types of contracts used in international business transactions, engineering agreements, R&D agreements and corporate transactions. [br/]- spot legal issues in a business setting and know when to contact a lawyer.",
      "Content":"This course will cover the legal foundation of international business transactions with focus on practical ahndling of legal issues frequently arisinge in a business context. [br/][br/]This course includes an introduction to contracts (formation, completion and termination) followed, based on students' and teacher's interest, by the study of transactions in the following areas:[br/]- common business agreements (non-disclosure, non-compete, purchase and sale agreements, services agreements, cooperation agreements,[br/]- intellectual property (patents, copyrights & trademarks) [br/]- technology development and transfer (licenses, franchises, R&D, joint ventures),[br/]- IT agreements,[br/]- incorporation of a company with special emphasis on start-up companies, including the relationships amongst shareholders and financing by investors.[br/][br/]Specific skills will be taught, such as drafting typical contractual clauses and negotiation techniques. [br/][br/]Finally, this course draws the students' attention to certain issues relating to taxation, insurance and dispute resolution.",
      "Keywords":"Law, legal, negotiation, business transactions, contracts, companies, intellectual property.",
      "Form of examination":"20% class participation[br/]80% written exam (closed book, i.e. without access to personal notes or course material)",
      "Type of teaching":"Lecture, case studies, critical analysis, class discussions."
    },
    "practical":null,
    "language":"English",
    "title":"Practical Business law",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/184288",
      "name":"Rochat Frédéric"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Forme d'enseignement":"Cours, étude de cas, analyse critique et discussions en classe.",
      "Contenu":"Ce cours couvrira les fondements légaux des transactions internationales en mettant l'accent sur les réponses pratiques aux problèmes légaux qui surviennent fréquemment dans un contexte commercial.[br/][br/]Ce cours comprendra une introduction aux contrats (conclusion, exécution, résiliation), suivie, selon les intérêts des étudiants et de l'enseignant, d'une étude des transactions dans les domaines suivants:[br/]- accords commerciaux courants (accords de confidentialité et de non-concurrence, contrats d'achat et de vente, contrats de services, accords de coopération,[br/]- propriété intellectuelle (brevets, droits d'auteurs et signes distinctifs)[br/]- développement et transfert de technologies (licences, franchises, R&D, [i]joint ventures[/i]),[br/]- contrats en matière informatique,[br/]- création d'une société, avec un accent particulier sur les sociétés [i]start-up[/i], y compris les relations  entre actionnaires et le financement par des investisseurs.[br/][br/]Des compétences spécifiques seront enseignées, telles que la rédaction de clauses contractuelles typiques et des techniques de négociation.[br/][br/]Enfin, ce cours rendra également les étudiants attentifs aux problèmes de fiscalité, d'assurance et de résolution des litiges.",
      "Mots clés":"Droit, légal, négociation, transactions commerciales, contrats, sociétés, propriété intellectuelle.",
      "Forme du contrôle":"20% participation en classe[br/]80% examen écrit (livre fermé, soit sans recours aux notes personnelles ou au matériel de cours)[br/]",
      "Objectifs d'apprentissage":"Dans ce cours, les étudiants apprendront à:[br/]- comprendre, négocier et rédiger les termes commerciaux des principaux types de contrats utilisés dans les transactions internationales, les contrats d'ingénierie, les accords de R&D et les transactions en matière de sociétés.[br/]- repérer les problèmes légaux pouvant survenir dans un contexte commercial et savoir quand avoir recours à un avocat."
    },
    "practical":null,
    "language":"English",
    "title":"Practical Business law",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}