{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=352625368&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","400"],
    "title":"Corporate strategy",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=352625368&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/185026",
      "name":"Strecker Nanja"
    }],
    "lab":null,
    "credits":4,
    "semester":"Fall",
    "free_text":{
      "Learning outcomes":"[li] To develop an understanding of the strategic process by (a) studying and forecasting the external environment of the firm (b) assessing the present and expected enterprise strengths and weaknesses (c) setting enterprise goals (d) formulating and implementing plans to achieve these strategic goals, and (e) evaluate performance and progress toward strategic objectives.[br/][br/][li] To develop decision-making skills from a top management perspective.[br/][br/][li] To understand the integration of operating objectives and decisions within the enterprise strategy.[br/][br/][li] To use the tools and concepts of strategic management.",
      "Content":"The course deals both with strategy formulation and implementation for objective economic results. It combines theory and practice. [br/] [br/]First, a framework for policy formulation is established through exposure to different concepts and processes. [br/][br/]Second, the role of the chief executive and the senior managers is analyzed to establish a more realistic description of the required integrated duties and capabilities as well as values which lead strategy as a dynamic process.[br/][br/]Third, the function of organizations is examined both as static and dynamic expressions of the major mechanism for implementing strategy.[br/][br/]Finally, different contexts (applications) of strategy are examined to link theory to practice.",
      "Type of teaching":"Lectures supplemented with cases and practical exercices",
      "Form of examination":"30% classroom contribution[br/]30% assignments (e.g. case analysis, news presentations) and mini mid-term exam[br/]40% team project",
      "Bibliography and material":"A list of readings for each session will be distributed at the beginning of the course.[br/]The Economist, Business Week, The Wall Street Journal, Financial Times, and Company Reports "
    },
    "practical":null,
    "language":"English",
    "title":"Corporate strategy",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-0-07-131791-7&amp;con_lng=ENG\" target=\"blank\">Strategic nanagement : concepts and cases / Frank Rothaermel</a>\". Year:2012. ISBN:978-0-07-131791-7</li></ul>",
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/185026",
      "name":"Strecker Nanja"
    }],
    "lab":null,
    "credits":4,
    "semester":"Automne",
    "free_text":{
      "Forme d'enseignement":"Cours complété par des cas et des exercices pratiques",
      "Contenu":"Ce cours traite à la fois de la formulation et de l'implémentation d'une stratégie dans le but d'obtenir des résultats économiques objectifs. Il combine théorie et pratique. [br/][br/]Nous établirons tout d'abord un cadre pour la formulation de la politique, à travers l'exposé de différents concepts et processus. [br/][br/]Les rôles du directeur général et des principaux dirigeants seront ensuite analysés afin d'établir une description réaliste des tâches requises, du savoir-faire et des valeurs qui font de la stratégie un processus dynamique.[br/][br/]Troisièmement, nous examinerons la fonction des organisations en tant qu'expression à la fois statique et dynamique des principaux mécanismes pour mettre en oeuvre une stratégie.[br/][br/]Nous examinerons enfin différents contextes d'application d'une stratégie afin de faire le lien entre la théorie et la pratique.",
      "Forme du contrôle":"30% participation en classe[br/]30% devoirs (p.ex. analyses de cas, nouvelles présentations) et un mini examen intermédiaire[br/]40% projet de groupe",
      "Bibliographie et matériel":"Une liste de lectures à préparer pour chaque session sera distribuée au début du cours.[br/]The Economist, Business Week, The Wall Street Journal, Financial Times, and Company Reports",
      "Objectifs d'apprentissage":"[li] Développer une compréhension du processus stratégique (a) en étudiant et en anticipant l'environnement extérieur de la firme, (b) en évaluant  les forces et faiblesses présentes et futures de l'entreprise, (c) en fixant des objectifs pour l'entreprise, (d) en élaborant une stratégie pour atteindre ces objectifs et (e) en évaluant la performance ainsi que sa progression vers ces objectifs stratégiques.[br/][br/][li] Développer les compétences dans la prise de décision au niveau de la direction d'entreprise.[br/][br/][li] Comprendre l'intégration des objectifs d'exploitation et des décisions dans la stratégie d'entreprise.[br/][br/][li] Utiliser les outils et les concepts du management stratégique."
    },
    "practical":null,
    "language":"English",
    "title":"Corporate strategy",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":"<ul><li>\"<a href=\"http://opac.nebis.ch/F?local_base=nebis&amp;func=find-b&amp;find_code=020&amp;request=978-0-07-131791-7&amp;con_lng=FRE\" target=\"blank\">Strategic nanagement : concepts and cases / Frank Rothaermel</a>\". Année:2012. ISBN:978-0-07-131791-7</li></ul>",
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}