{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581028449&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","413(b)"],
    "title":"Entrepreneurship & new venture strategy (b)",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1581028449&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[["Entc.epfl.ch","Entc.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/171551",
      "name":"Gruber Marc"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      "Learning outcomes":"This class is the foundation course in Entrepreneurial Management. The purpose of this course is to explore new venture creation by adopting a process perspective - from opportunity recognition to establishing a successful new firm - and by studying the challenges of entrepreneurship from multiple perspectives, i.e. from various functional perspectives such as finance, managerial economics and marketing, as well as from the perspective of various key constituents involved in new venture creation (e.g., venture capitalists). In this course, a new venture is defined as an innovative start-up firm which has a high potential for growth and value generation.[br/]The course will offer a thorough theoretical understanding of new venture creation combined with practical techniques and methods for analyzing and evaluating business opportunities, crafting growth-oriented strategies and developing creative approaches to commercialization. The class will prepare students to work as key employees in new ventures, to pursue careers as autonomous entrepreneurs, careers as entrepreneurs and careers in the start-up community. The five main pedagogical objectives of this course are:[br/][li] Understand the challenges of new venture creation in a comprehensive, integrative way[br/][li] Experience the early stages of the entrepreneurial process by working on a business project proposal[br/][li] Sharpen your ability to analyze and evaluate new venture opportunities[br/][li] Be able to write and present a convincing business project proposal[br/][li] Develop an \"entrepreneurial min",
      "Content":"[li] Theoretical Foundations / Innovation and Industry Evolution [br/][li] Opportunity Identification / Sources of Innovation[br/][li] Entry Strategy, Competitive Advantage and Uncertainty / Business Models / Judo Strategy[br/][li] Entrepreneurial Marketing and Technology Commercialization II[br/][li] Discovery Driven Planning / Basics of business planning[br/][li] Issues in Building a New Venture Team / Growth and Scalability of Organizations[br/][li] Raising Capital / The Economics of Venture Capital Financing [br/][li] Harvesting the Rewards / Dealing with Failure ",
      "Keywords":"Entrepreneurship, New Firms, Technology Commercialization",
      "Form of examination":"40% Business Plan proposal[br/]30% Participation [br/]30% Assignments"
    },
    "practical":null,
    "language":"English",
    "title":"Entrepreneurship & new venture strategy (b)",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["Entc.epfl.ch","Entc.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/171551",
      "name":"Gruber Marc"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Contenu":"[li] Fondements théoriques / Evolution de l'innovation et de l'industrie[br/][li] Identification d'opportunités / Sources d'innovation[br/][li] Stratégie d'entrée, avantages concurrentiels et incertitudes  / Modèles commerciaux / Stratégie du judo[br/][li] Marketing d'entreprise et commercialisation de la technologie II[br/][li] Planification par découvertes / Bases de planification stratégique[br/][li] Les défis liés à la constitution d'une équipe de créateurs d'entreprise/ Croissance et extensibilité des organisations[br/][li] Récolte de fonds / Enjeux économiques du financement par Venture Capital.[br/][li] Récolter les récompenses / Gérer les échecs",
      "Mots clés":"Entrepreneuriat, nouvelles entreprises, commercialisation de la technologie",
      "Forme du contrôle":"40% Projet de business plan[br/]30% Participation[br/]30% Devoirs",
      "Objectifs d'apprentissage":"Ce cours présente les fondements de l'entrepreneuriat. Son but est d'explorer la création d'entreprise en tant que processus - de l'identification d'opportunités à l'établissement d'une nouvelle entreprise prospère - et d'étudier les défis propres à l'entrepreneuriat sous différentes perspectives: fonctionnelles (finance, économie, marketing) ou axées sur les constituants clés impliqués dans la création d'entreprise (par exemple, les venture capitalists). Une nouvelle entreprise est définie comme une start-up innovatrice, qui possède un fort potentiel de croissance et de génération de valeur.[br/]Ce cours offre une compréhension théorique approfondie de la création d'entreprise, combinée avec l'étude de techniques et méthodes pratiques permettant d'analyser et d'évaluer les opportunités d'affaires, de développer des stratégies de croissance et des approches novatrices en matière de commercialisation. Il prépare les étudiants à devenir des employés clés au sein d'une nouvelle entreprise, à poursuivre des carrières d'entrepreneurs indépendants, d'intrapreneurs ou encore des carrières dans la communauté des start-up.[br/]Les cinq objectifs pédagogiques principaux de ce cours sont:[br/][li] Comprendre l'ensemble des défis liés à la création d'entreprise [br/][li] Expérimenter les étapes préliminaires du processus entrepreneurial en travaillant sur un projet de création d'entreprise[br/][li] Développer sa capacité à analyser et à évaluer les opportunités de nouvelle entreprise[br/][li] Apprendre à élaborer et à présenter un projet de création d'entreprise convaincant[br/][li] Développer un \"esprit d'entreprise\""
    },
    "practical":null,
    "language":"English",
    "title":"Entrepreneurship & new venture strategy (b)",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}