{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1772927&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","552"],
    "title":"Corporate governance",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1772927&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[["http://mir.epfl.ch","http://mir.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/141278",
      "name":"Finger Matthias"
    }],
    "lab":null,
    "credits":4,
    "semester":"Spring",
    "free_text":{
      "Form of examination":"15% active participation in the course[br/]70% final document of 30 pages produced by the participants[br/]15% oral presentation at the end of the course",
      "Bibliography and material":"See syllabus at: http://mir.epfl.ch",
      "Prerequisite for":"None",
      "Required prior knowledge":"None",
      "Content":"This course will address corporate governance from an organizational and institutional point of view: it will illustrate how corporate governance has evolved over time and will cover both theory and relevant practices. In terms of content, the course will:[br/][br/]- highlight the main issues of corporate governance (e.g., the relationships between the owners, the board, and firm management, and the relationships between the company and its major stakeholders; [br/][br/]- provide concrete examples of \"good\" and \"bad\" corporate governance; [br/][br/]- outline key principles of corporate governance; [br/][br/]- present the main tools for assessing corporate governance practices;[br/][br/]- discuss the relevant theories underlying corporate governance practices (e.g., theories of organizations, institutions, governance, organizational behavior, leadership, new institutional economics, power, and agency.",
      "Keywords":"Corporate governance - stakeholders",
      "Type of teaching":"Lectures by the professor[br/]The participants develop their own case during the course",
      "Learning outcomes":"The purpose of this course is to offer the participants an appreciation of the importance and understanding of the foundations, the mechanisms, the evolution, as well as the main assessment tools of corporate governance.[br/][br/]Good corporate governance is an indispensable ingredient of any successful corporation or organization, be it for established firms or start-ups. As a matter of fact, it is today generally admitted that there exists a relationship between governance practices and corporate performance. As a consequence, increasing attention is being paid to questions of how firms - and all other organizations for that matter - are being \"governed\" and how they relate to shareholders in particular and to stakeholders in general. The course addresses this broad issue."
    },
    "practical":null,
    "language":"English",
    "title":"Corporate governance",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[["http://mir.epfl.ch","http://mir.epfl.ch"]],
    "instructors":[{
      "url":"http://people.epfl.ch/141278",
      "name":"Finger Matthias"
    }],
    "lab":null,
    "credits":4,
    "semester":"Printemps",
    "free_text":{
      "Prérequis":"Aucun",
      "Bibliographie et matériel":"Voir syllabus sur: http://mir.epfl.ch",
      "Mots clés":"Gouvernance d'entreprise - acteurs intéressés.",
      "Forme d'enseignement":"Conférences par le professeur[br/]Les participants préparent leur propre cas durant le cours",
      "Contenu":"Ce cours abordera la gouvernance d'entreprise d'un point de vue organisationnel et institutionnel: il illustrera comment la gouvernance d'entreprise a évolué à travers le temps et couvrira tant la théorie que les pratiques appropriées. En termes de contenu, le cours va:[br/][br/]- Mettre en évidence les éléments principaux de la gouvernance d'entreprise (p. ex. les relations entre les propriétaires, le conseil d'administration et la direction, ainsi que les relations entre l'entreprise et ses principaux acteurs intéressées;[br/][br/]- Fournir des exemples concrets de \"bonne\" et \"mauvaise\" gouvernance d'entreprise;[br/][br/]- Décrire les principes clés de la gouvernance d'entreprise;[br/][br/]- Présenter les outils principaux pour évaluer les pratiques de gouvernance d'entreprise;[br/][br/]- Discuter les théories appropriées étant à la base des pratiques de gouvernance d'entreprise (p. ex. théories des organisations, des institutions, de gouvernance, de comportement organisationnel, de leadership, nouvelle économie institutionnelle, de pouvoir et agence.",
      "Forme du contrôle":"15% participation active au cours[br/]70% travail final de 30 pages produit par les participants[br/]15% présentation orale à la fin du cours ",
      "Préparation pour":"Aucun",
      "Objectifs d'apprentissage":"Le but de ce cours est d'offrir aux participants un aperçu de l'importance ainsi qu'une compréhension des fondements, des mécanismes, de l'évolution et des outils principaux d'évaluation de la gouvernance d'entreprise.[br/][br/]La bonne gouvernance d'entreprise est un ingrédient indispensable à toute entreprise ou organisation fructueuse, que ce soit pour des entreprises établies ou des start-ups. En fait, il est aujourd'hui généralement admis qu'il existe une relation entre les pratiques de gouvernance et la performance des entreprises. En conséquence, une attention croissante est accordée à la manière dont les entreprises et toutes autres organisations sont \"gouvernées\" et comment elles interagissent avec les actionnaires ainsi qu'avec les acteurs intéressés plus généralement."
    },
    "practical":null,
    "language":"English",
    "title":"Corporate governance",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}