{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=353946399&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=fr",
    "code":["MGT","503"],
    "title":"Technology strategy & corporate entrepreneurship",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=353946399&ww_x_anneeAcad=2012-2013&ww_i_section=84483036&ww_i_niveau=&ww_c_langue=en",
    "section":"MIN-MTE",
    "program":"MTE",
    "plan":"min"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/169976",
      "name":"Wadhwa Anu"
    }],
    "lab":null,
    "credits":4,
    "semester":"Fall",
    "free_text":{
      "Form of examination":"Group projects, class participation, exam/quizzes, paper critique",
      "Bibliography and material":"A list of readings for each session will be distributed at the beginning of the course",
      "Required prior knowledge":"Technology & Innovation Management ",
      "Content":"The competitiveness of large, established corporations is continuously being challenged in today's fast changing environment.  In an effort to find ways to stay competitive, executives in these organizations are recognizing the critical role that entrepreneurial thinking plays in creating opportunities for growth and renewal. This course will focus on how entrepreneurial skills and processes can be applied effectively in corporations.  It will examine the theory and best practices associated with the process of converting new ideas to new products, technologies and businesses, within the boundaries of a large corporation. [br/][br/]The course will focus on topics such as designing and encouraging organizational contexts that promote innovation and creativity, corporate investments in new ventures and their uses to the investor,  briefly survey alliances, joint ventures and acquisitions and key success factors for achieving success, how organizations exploit assets (such as intellectual property and complementary assets) for innovation and growth. During the course, the participants will be placed in the role of a project manager or key decision maker and asked to address issues related to the creation and reinforcement of both an individual business venture and an innovative parent organization.",
      "Keywords":"Innovation management; technology strategy",
      "Type of teaching":"Case method, supplemented with lectures, films and external speakers",
      "Learning outcomes":"The central focus of the course is to examine how large corporations can become more adept at creating opportunities for change, capitalizing on them, and reacting to disruptive changes in the environment. Accordingly, the course objectives are two fold: (1) to develop an awareness and understanding of the range, scope, and complexity of issues involved in the creation of an organizational climate that helps recognize, nurture, and grow entrepreneurial activities within large firms; (2) to gain insight into the effective commercial exploitation of technological and organizational innovations in such a context. "
    },
    "practical":null,
    "language":"English",
    "title":"Technology strategy & corporate entrepreneurship",
    "recitation":null,
    "exam_form":"During the semester",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/169976",
      "name":"Wadhwa Anu"
    }],
    "lab":null,
    "credits":4,
    "semester":"Automne",
    "free_text":{
      "Prérequis":"Technology & Innovation Management",
      "Bibliographie et matériel":"Une liste de lectures à préparer pour chaque session sera distribuée au début du cours",
      "Mots clés":"Gestion de l'innovation, stratégies technologiques",
      "Forme d'enseignement":"Etudes de cas, complétées par des cours, films et intervenants externes",
      "Contenu":"La compétitivité des grandes entreprises existantes est sans cesse remise en cause dans un environnement en perpétuelle évolution. Dans la mesure où il faut trouver des moyens pour rester concurrentiels, les responsables de ces organismes reconnaissent le rôle déterminant de la pensée entrepreneuriale pour créer des opportunités de croissance et de développement. Ce cours se concentrera sur la façon dont les aptitudes et méthodes entrepreneuriales peuvent être appliquées efficacement aux entreprises. Il examinera la théorie et les meilleures pratiques associées à la conversion des idées nouvelles en de nouveaux produits, technologies et affaires, ceci dans le cadre d'une grande entreprise.[br/][br/]Ce cours est centré sur la conception et la mise en valeur de contextes organisationnels qui promeuvent l'innovation et la créativité, les investissements dans de nouvelles sociétés et leur utilité pour l'investisseur. Il survole brièvement les alliances, les \"joints ventures\", les acquisitions  ainsi que les facteurs clés pour parvenir au succès, et traite de l'exploitation des biens (tels que la propriété intellectuelle et les biens annexes) pour l'innovation et la croissance. Durant le cours, les participants joueront le rôle d'un chef de projet ou d'un décideur et devront aborder des questions liées à la création et au renforcement d'une entreprise financière et d'une organisation mère innovatrice.",
      "Forme du contrôle":"Projets en groupes, participation en classe, examen/quiz, critique de documents",
      "Objectifs d'apprentissage":"Le but principal du cours est d'examiner comment les grandes sociétés peuvent devenir plus compétentes pour créer des opportunités de changement et en tirer parti, et pour  réagir aux changements perturbateurs dans leur environnement. En conséquence, les objectifs du cours sont: (1) développer une connaissance et une compréhension de la variété, de la portée et de la complexité des éléments impliqués dans la création d'un climat organisationnel qui permette d'identifier, de consolider et d'accroître les activités entrepreneuriales au sein de grandes entreprises; (2) acquérir, dans un tel contexte, une perspicacité dans l'exploitation commerciale d'innovations technologiques et organisationnelles."
    },
    "practical":null,
    "language":"English",
    "title":"Technology strategy & corporate entrepreneurship",
    "recitation":null,
    "exam_form":"Pendant le semestre",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "week_hours":3,
      "weeks":14
    }
  }
}