{
  "study_plan_entry":{
    "url_fr":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639497442&ww_x_anneeAcad=2012-2013&ww_i_section=2141714&ww_i_niveau=&ww_c_langue=fr",
    "code":["MSE","632"],
    "title":"CCMX Winter School \"Nanoparticles: From Fundamentals to Applications in Life Sciences\"",
    "url":"http://isa.epfl.ch/imoniteur_ISAP/!itffichecours.htm?ww_i_matiere=1639497442&ww_x_anneeAcad=2012-2013&ww_i_section=2141714&ww_i_niveau=&ww_c_langue=en",
    "section":"EDMX",
    "program":"EDMX",
    "plan":"edoc"
  },
  "en":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/",
      "name":"Various lecturers"
    }],
    "lab":null,
    "credits":2,
    "semester":null,
    "free_text":{
      "Learning outcomes":"This course is designed to enhance participants' understanding of the physico-chemical properties and behaviour of nano- devices and formulations in the human body. Scientists from academia, industry and research institutions will present the broad array of disciplines influenced by nanomaterials science and technology&#8212;from engineering and characterisation to applications in life science and medicine.[br/][br/]Organised as five modules, the lectures will address nanoparticles production and risk assessment, biological and toxicological effects, in a variety of scientific, technological and clinical applications. [br/]",
      "Content":"Lectures from featured speakers will take place in the morning sessions. The evenings are planned for the small groups of participants to present their assigned case studies.[br/][br/]Monday, 14 JANUARY 2013[br/]08:00-12:00 Module 1: Nanoparticle fundamentals by Prof. Heinrich Hofmann (EPFL) and Prof. Francesco Stellaci (EPFL) - 4x50 min[br/]18:30-21:30 Group exercises & presentations on the topic of the day - 3 groups of participants; 3x50min; tutors Prof. Heinrich Hofmann (EPFL) and Prof. Francesco Stellaci (EPFL)[br/][br/]Tuesday, 15 JANUARY 2013[br/]08:00-12:00 Module 2: Synthesis and characterisation by Prof. Markus Niederberger (ETH Zurich) and Prof. Heinrich Hofmann (EPFL)- 4x50 min[br/]18:30-21:30 Group exercises & presentations on the topic of the day - 3 groups of participants; 3x50min; tutors Prof. Markus Niederberger (ETH Zurich) and Prof. Heinrich Hofmann (EPFL)[br/][br/]Wednesday, 16 JANUARY 2013[br/]08:00-12:00 Module 3: Interaction of nanoparticles with biomolecules, membranes and cells by Dr. Geraldine Coullerez (EPFL) and Prof. Alke Fink (AMI, Fribourg) - 4x50 min[br/]18:30-21:30 Group exercises & presentations on the topic of the day - 3 groups of participants; 3x50min; tutors Dr. Geraldine Coullerez (EPFL) and Prof. Alke Fink (AMI. Fribourg)[br/][br/]Thursday, 17 JANUARY 2013[br/]08:00-12:00 Module 4: Biological impact and nanotox behaviour in animal model and in humans by Dr. Thomas Broschard (Merck-Serono, Darmastad) and Dr. Peter Wick (Empa) - 4x50 min[br/]13:30-17:30 Module 5: Imaging, diagnostics and medical applications by Dr. Arne Seitz (EPFL) and Prof.Johannes Heverhagen (University of Bern) - 4x50 min[br/][br/]Friday, 18 JANUARY 2013[br/]08:00-10:00 Module 5: Continued topics by Dr. Olivier Jordan (Uni Genève) 2x50 min[br/]10:30-12:30 Group exercises & presentations on the topic of the day - 2 groups of participants; 2x50min; tutors Dr. Thomas Broschard (Merck-Serono, Darmastad), Dr. Peter Wick (Empa); Dr. Olivier Jordan (Uni Genève)  [br/]",
      "Keywords":"Physico-chemical properties,synthesis and surface engineering, interaction of nanoparticles with the biological matrix, with biomolecules, with membranes and cells, nanotoxicological behaviour in animal and human models, medical and imaging applications of nanoparticles",
      "Form of examination":"Oral presentation",
      "Required prior knowledge":"Master in materials science, chemistry, physics, biology, pharmaceutical sciences or life sciences"
    },
    "practical":null,
    "language":"English",
    "title":"CCMX Winter School \"Nanoparticles: From Fundamentals to Applications in Life Sciences\"",
    "recitation":{
      "total_hours":12
    },
    "exam_form":"Oral presentation",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "total_hours":22
    }
  },
  "fr":{
    "coefficient":null,
    "links":[],
    "instructors":[{
      "url":"http://people.epfl.ch/",
      "name":"Various lecturers"
    }],
    "lab":null,
    "credits":2,
    "semester":null,
    "free_text":{
      
    },
    "practical":null,
    "language":"English",
    "title":"CCMX Winter School \"Nanoparticles: From Fundamentals to Applications in Life Sciences\"",
    "recitation":{
      "total_hours":12
    },
    "exam_form":"Exposé",
    "project":null,
    "library_recommends":null,
    "lecture":{
      "total_hours":22
    }
  }
}